{"business_id": "e2l19ABu1xIn9hnvWukJ3Q", "name": "Aladdin Pizzeria & Eatery", "address": "4746 Spruce St", "city": "Philadelphia", "state": "PA", "postal_code": "19139", "latitude": 39.9533259, "longitude": -75.217555, "stars": 3.0, "review_count": 57, "is_open": 0, "attributes": {"GoodForKids": "True", "RestaurantsReservations": "False", "HasTV": "True", "RestaurantsGoodForGroups": "True", "NoiseLevel": "u'average'", "RestaurantsDelivery": "True", "Caters": "True", "BikeParking": "True", "WiFi": "u'free'", "RestaurantsAttire": "u'casual'", "Alcohol": "u'none'", "OutdoorSeating": "False", "RestaurantsTakeOut": "True", "Ambience": "{'romantic': False, 'intimate': False, 'classy': False, 'hipster': False, 'divey': False, 'touristy': False, 'trendy': False, 'upscale': False, 'casual': True}", "RestaurantsPriceRange2": "1", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "GoodForMeal": "{'dessert': False, 'latenight': True, 'lunch': True, 'dinner': True, 'brunch': False, 'breakfast': False}", "BusinessAcceptsCreditCards": "True"}, "categories": "Italian, American (Traditional), Pizza, Restaurants", "hours": {"Monday": "10:30-1:30", "Tuesday": "10:30-1:30", "Wednesday": "10:30-1:30", "Thursday": "10:30-1:30", "Friday": "10:30-1:30", "Saturday": "10:30-1:30", "Sunday": "10:30-1:30"}, "category_list": ["Italian", "American (Traditional)", "Pizza", "Restaurants"], "stratification_tag": "Italian"}
{"review_id": "EjIDItxIvtC43jzERX-Tkw", "user_id": "eR2mg_K9-otbiqB9uA3L7Q", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I got to try this via Uber eats. By far one of the best pizzas I ever had. It had fresh tomatoes and broccoli.", "date": "2018-04-14 12:18:05", "user": {"name": "Karen", "review_count": 8, "yelping_since": "2015-07-08 18:30:41", "elite": "", "average_stars": 3.56, "fans": 1}}
{"review_id": "RFdtEcpgFoPzViAnN2LhoA", "user_id": "c8aTh6t3UGnq3d8Qw_Q6vg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered a cheese burger special through Grubhub which is supposed to come with lettuce, tomato and onions but they were not on the burger. The description says the burger is fresh but what I was delivered is clearly a frozen patty. It had a weird after taste so after two bites I was done. The fries were good though. Also, I got 25% off because it was my first time ordering but this will most likely be my last.", "date": "2018-02-19 04:42:04", "user": {"name": "Marquita", "review_count": 37, "yelping_since": "2015-09-12 19:24:52", "elite": "", "average_stars": 2.88, "fans": 1}}
{"review_id": "lkeLiD51K_PT3Ikys8rjmQ", "user_id": "hR3syPvqB8BXmWNfOHd6gA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you can't reach someone by phone during a delivery you ring the doorbell, right? That's what one would assume. It's bad business to take a customer's money with no recompense. After being their customer for over five years they no longer have my business or anyone in ear shot that plan on giving them business. Go elsewhere. I'm so annoyed....like what do we tip for, lol", "date": "2018-02-14 02:21:12", "user": {"name": "Will", "review_count": 1, "yelping_since": "2018-02-14 02:20:52", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "wl42EemJsw2zuw0jspOmmg", "user_id": "ThrbbVj_TZ8V6I24DBPLuw", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered via uber eats and stated twice not to include cheese/dairy on one half of the vegetarian pizza. Pizza arrived liberally coated in cheese - one half of party unable to partake in dinner. Onion rings did not come with ketchup or any condiments. Overall extremely disappointed with taste and presentation.", "date": "2017-11-01 16:28:22", "user": {"name": "Rachel", "review_count": 9, "yelping_since": "2017-10-01 14:29:07", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "ntIi0GZeAIm94ZJV0uB3ag", "user_id": "JrwBSKdIDLOhFRIMmzyw1w", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "HORRIBLE. I ordered cheese fries and a cheeseburger. What I got was fries with no cheese and THE driest burger I've ever had in my life; all of it cold after being 30 minutes late. To make matters worse, there was not a single packet of ketchup or any other condiment to be found. I have never placed an order for a burger and fries and had to make a special request for ketchup to be included. Seriously? If you're going to serve me this dry ass burger and fries, at least give me some freaking ketchup to make it go down a little easier. So now I'm sitting here on Friday night, hungry, writing this review instead of enjoying my cheese fries and cheeseburger. This is hands down the worst delivery experience I've ever had.", "date": "2017-09-23 01:18:47", "user": {"name": "Tyreeka", "review_count": 1, "yelping_since": "2014-10-11 01:38:22", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "7tmlZcn6SPTJy70xSxXHxw", "user_id": "FaRu0KBhd6D1bk3V-YnZdA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Eh...I keep ordering the chicken salad hoagie but it's inconsistent every time I get it. Today they made it with Miracle Whip and I opened it to find that it was stuffed with tomato and onion: hardly any chicken salad and the chicken salad itself looks like it came out of a can (mushy, almost like canned tuna).\n A few weeks ago I also had a run-in with one of the delivery people. I block anonymous calls and didn't get his when he was here. When the restaurant called I went outside to get my food. I was met with a belligerent asshole who kept complaining that he wasted his time waiting for me. On top of that, they left the onions off my pizza. To their credit, they did apologize and send me a new pizza.\nThe garlic bread with cheese seems always to be tasty.\nMy last few experiences here have been pretty awful. BUT I've had some good experiences too. Just nothing consistent, definitely a crap shoot.", "date": "2017-07-11 00:09:48", "user": {"name": "HEATHER", "review_count": 18, "yelping_since": "2011-10-30 21:39:34", "elite": "", "average_stars": 2.86, "fans": 1}}
{"review_id": "4_tTKfkDPFxC6pVANAYqew", "user_id": "wZFhPJnlOojW_jTAyLQq_w", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered alladin fries and hotwings. They came in a timely fashion. The food was good and those fries were amazing", "date": "2017-03-26 19:29:22", "user": {"name": "Chris", "review_count": 3, "yelping_since": "2017-03-02 04:55:29", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "ATMmV2EyVTqqegbEGZD_zA", "user_id": "nAe5USXtIe-o7Y-7J0tHlQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Best local pizza/sandwiches place for the Cedar Park area. And they have milkshakes! Their chicken parm sandwiches are the best and the staff are really friendly. Delivery is usually pretty fast and the prices are super reasonable.", "date": "2017-02-04 01:18:20", "user": {"name": "Kay", "review_count": 130, "yelping_since": "2011-09-15 01:21:36", "elite": "", "average_stars": 3.76, "fans": 1}}
{"review_id": "qUBtvXUmmRD02JjYi0PERQ", "user_id": "cD8P20oaMLQEnik4vC8KIA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "Absolutely horrible! The hot wings has a weird barbecue-like sauce on it that's super spicy and odd tasting. The pizza taste like it was made with sandwich cheese and turned my stomach. I wasted money on this and I'm so over it.", "date": "2017-01-28 03:47:14", "user": {"name": "Toni", "review_count": 2, "yelping_since": "2017-01-21 23:36:24", "elite": "", "average_stars": 1.67, "fans": 0}}
{"review_id": "7iiBqF3T6YyLiNbsuV_BtA", "user_id": "-_rTOJyBN_oIT_jaISsUgg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered a plain cheese pizza for take out.  It was edible but not enjoyable. It barely had any tomato sauce (at first I wondered if I was given a white pizza by mistake) and the crust tasted like cardboard.", "date": "2016-07-13 17:50:19", "user": {"name": "Daria", "review_count": 9, "yelping_since": "2013-02-10 19:26:39", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "pXnFfEh1lKcmjzrr4njHsg", "user_id": "JqIPq7TVp12LHpQ8HI4SJg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I ate here a few times and liked it at first, until my husband got very sick after eating the margarita pizza. This place will offer you a heavy discount if you give them a five star review. It is worth checking out there ongoing poor health reports on clean plates before ordering.\n\nhttp://data.inquirer.com/inspections/philly/?detail=Aladdin%20Pizza%20%26%20Eatery%7C4746%20SPRUCE%20ST%2019139", "date": "2016-06-30 22:08:34", "user": {"name": "Katie", "review_count": 64, "yelping_since": "2014-04-22 14:28:14", "elite": "", "average_stars": 4.15, "fans": 0}}
{"review_id": "UjvSk8-jXneNh7X-pOSiaQ", "user_id": "6EAdlV8DS06G0q_ub1RjiA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food was ok until I seen a bunch of mice droppings at the bottom of my pizza. I couldn't believe it. I should have know better if your hungry and looking for a bite. Go up the street to Accu Pizza. Please stay away from this place. I should have known they were hiding something. I will be calling the health department first thing in the morning.", "date": "2016-06-08 01:44:38", "user": {"name": "Kevin", "review_count": 12, "yelping_since": "2015-05-12 00:45:54", "elite": "", "average_stars": 2.21, "fans": 0}}
{"review_id": "LDxO5GwbpokdlWrHEl_FHg", "user_id": "pMMTFtJ6BONrrNDOGs9rhA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 2, "funny": 3, "cool": 0, "text": "I was looking for a decent pizza in West Philly....and I found it via West Willy recommendations. I got a margarita pizza from here (probably spelling it wrong) and that was awesome. The other night got mozzarella sticks and they were batter coated  and delightful and came with great chunky marinara that I ate on its own after I ate the sticks. I also was super indulgent and got chicken fingers that were amazing as well--(batter covered too none of that breadcrumb crap) with honey mustard. The honey mustard was the thick and it was the good kind not that watery crap.  The delivery was fast and the guy was super friendly. The only bad thing about this place is that they are on Grub Hub and I might gain 50 lbs.", "date": "2016-05-07 17:51:42", "user": {"name": "Cathy", "review_count": 22, "yelping_since": "2013-01-21 00:54:47", "elite": "", "average_stars": 4.59, "fans": 1}}
{"review_id": "ZUye3TapBU5AA2U4jsdj9Q", "user_id": "JR3LYR26mLNHLWsjP7FSYA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I am very disappointed with the quality. \nThe first time I placed my order, I was genuinely satisfied, so I ordered that same meal a second time. The second order was disappointing, the salad lack the quantity of ingredients, therefore, I end up eating a salad that mainly consisted of Romain lettuce only. Not only am I leaving you with this post, I plan to phone them and speak with someone in charge. With such an inferior product, I felt slighted.", "date": "2016-03-25 16:36:31", "user": {"name": "Terry", "review_count": 5, "yelping_since": "2012-10-28 13:04:08", "elite": "", "average_stars": 2.6, "fans": 0}}
{"review_id": "6lZ20AtsJsxWDUq_albshw", "user_id": "fQ7cjgyI6l8UTtgPETMBkQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "So first off, I had ordered from here a few weeks ago and the food never came. I figured it was my fault for trying to place an online order 10 min before closing. They didn't call to tell me they were closed, but still my card was charged. \n\nNow FYI I've been a delivery driver before so I know stuff happens. So I decided to try them once more. Honestly I'd would have preferred the food not even come. \n\nIt was a simple order. Their special cheeseburger, which should come with fries and coleslaw. So obviously it didn't. Also the burger was just as bland as other reviews stated. Then there was my antipasto salad. It was so bad I couldn't even finish it. They were out of artichoke hearts, so they subbed pickle slices!?!?!?! Also it was supposed to be on romaine lettuce, but it was definitely iceberg. They pretty much threw some tuna salad on top of the basic b***h version of a salad and called it an antipasto salad. \n\nTo top it off it took them a little over an hour to deliver this. Honestly I'm more disgusted with myself for paying $25 (including tip). I called to complain and they tried to offer me $5 off my next order. There won't be a next order.", "date": "2016-03-11 06:59:10", "user": {"name": "Ron", "review_count": 3, "yelping_since": "2011-07-18 19:00:35", "elite": "", "average_stars": 2.33, "fans": 0}}
{"review_id": "UZU1KH-l2JIj6k3HNgi-5g", "user_id": "FaRu0KBhd6D1bk3V-YnZdA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have been ordering pizza from this place for awhile. It's good, not the best. Today I thought I'd shake it up and order a chicken salad hoagie. Let me say that I LOVE chicken salad and I am VERY picky. This was the best chicken salad that I have ever had. There are real chunks of hand cooked chicken, seasoned perfectly. Bravo.", "date": "2016-02-27 01:49:20", "user": {"name": "HEATHER", "review_count": 18, "yelping_since": "2011-10-30 21:39:34", "elite": "", "average_stars": 2.86, "fans": 1}}
{"review_id": "F7WCE5x9H2hPQUzBYvVS9Q", "user_id": "CBZ4O5JBwLAVPMTfKFaj_g", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "So my food is over a half hour late (ordered off of grub hub) grub hub updated me to the point saying everything was out for delivery 45 mins ago. When I called the store nobody answered the first time. Call the second time and the manager told me the driver JUST left almost an hour after the app told me it left. And then the guy hung up on me! Absolutely horrific customer service for sub par food. You better off eating papa john then dealing with this place.", "date": "2015-12-31 22:56:36", "user": {"name": "Emily", "review_count": 8, "yelping_since": "2015-11-23 00:20:25", "elite": "", "average_stars": 1.13, "fans": 0}}
{"review_id": "OfCRyOAV6jmlxYurIhElMA", "user_id": "4YbazqUAnEAZnig3dLXO-w", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Yes, I was one of \"those people\" who left town for the Pope's visit. Yes, I came back starving and with no food in my fridge. Yes, I ordered from Aladdin for the first time despite living in the neighborhood for three years. Maybe, is the answer I would give you if you asked if I would order again. \n\nHere's the scoop:\n\nOrdered over the phone and the guy on the phone was very quiet and made it really difficult to order. He wasn't rude, I just couldn't understand what was happening.\n\nPicked up my food so I can't comment on delivery. It was ready in 10 minutes which was the time promised on the phone - the only thing I heard this guy say for sure. \n\nGot a cheesesteak (which may be be problem since it's a pizza place). It was just okay. There was plenty of meat and cheese, but it didn't taste like anything. Maybe it was the quality of the meat, but it just didn't taste like what you want out of a cheesesteak - very bland. I'll definitely go back and try their pizza, but the cheesesteak was underwhelming. 3.5 stars if I could.", "date": "2015-10-05 03:09:19", "user": {"name": "Melissa", "review_count": 7, "yelping_since": "2011-02-07 04:04:35", "elite": "", "average_stars": 3.71, "fans": 0}}
{"review_id": "HKIobofqqMDM0dy9ytRKVw", "user_id": "-VLTu1xodjWlMKex4h5QiQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Please for the love of God stay away from the Buffalo Chicken Pizza. Worst Pizza I have ever had and I say that with utmost honesty.  I literally could not even get through a slice and threw the entire pizza away. This is coming from a very frugal and non-picky pizza eater. I can almost always eat a number of slices from anywhere in Philly. I am also Asian and never like to waste food. \n\nDetails: There is barely any chicken to start and the dough is tasteless and just kind of looked white. The real part that killed me was the blue cheese sauce underneath the cheese. This tasted like someone just mixed mayo, blue cheese and perhaps water together. There was way too much of this white sauce and it made me almost vomit. The only ok part was the texture overall being acceptable (not soggy) but this is still by far the worst pizza I have ever had. \n\nI was also asked to pay 8 dollars more than the price I was shown after ordering pickup online. The guy said he was looking at the wrong order and I believe him but leaving this on record here in case others have had similar instances. \n\nI am sure there are other options here that may be okay but I have to give this place a negative review based on this pizza. Seriously, I can't even remember the last time I thought to myself, \"worst pizza ever.\"", "date": "2015-09-24 05:59:13", "user": {"name": "Jonathan", "review_count": 9, "yelping_since": "2014-11-09 20:50:20", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "BFVV8nRN0t7ncW77nSsHzQ", "user_id": "hQjN1FuYaB4pQACZwfrclw", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I finally ordered from Aladdin after a year of living in the neighborhood and what I received yesterday was solid, but not mind-blowing good pizza. Enjay's for example, is one pizza I had that was really, really good.\n\nAladdin has a lot of good choices though -- Capri pizzas that have spinach, broccoli , ricotta , garlic etc. \n\nYesterday we opted for the Quattro Formaggio pizza priced around $18 including tax for a large 16\" pie. 4 cheese pizza + tomatoes + black olives. \nPros - The pizza had a lot of flavor -- nice strong garlic flavor which went well with the tomatoes and olives. \nGiven that it was a 4 cheese pizza -- the awesome cheesiness was a little lacking. The cheese wasn't that stretching, pulling apart  cheese you like to see in the pizza -- which makes me worried that it was not fresh, nor good quality cheesed.\n\nSecondly, the pizza was sloppily put together. The onions were not cut all the way through, and some areas of the pizza had 3 layers of onions, and other parts of the pizza had no onions -- which just shows either sloppiness or inexperienced pizza makers just literally throwing ingredients onto the dough. \n\nSummary? Okay pizza -- good flavor, messy/sloppily arranged pizza.", "date": "2015-08-17 13:50:22", "user": {"name": "Tiffany", "review_count": 655, "yelping_since": "2011-03-23 20:49:36", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.55, "fans": 58}}
{"review_id": "0D-F1w-pb_RDQhge4i7Gqg", "user_id": "D9aw3G-9sU7LbPv7I46ipQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "My local pizzeria. Their crust is a little bland for my taste, but the overall quality of their ingredients more than makes up for it. Also, I highly recommend adding some garlic bread to your order. A very affordable way to stretch out a meal if you are on a budget!", "date": "2015-08-14 19:39:31", "user": {"name": "Nathan", "review_count": 17, "yelping_since": "2014-02-28 17:16:41", "elite": "", "average_stars": 4.3, "fans": 0}}
{"review_id": "85c_dVNINMZheHp16ibUJw", "user_id": "6tsoeM0XgpuNQmvNCQBHfQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "absolutely the worst burger platter I don't know what they season there meat with even if it was meat pepperoni pizza a joke\n Never again", "date": "2015-06-23 22:14:00", "user": {"name": "El", "review_count": 1, "yelping_since": "2015-02-21 02:14:27", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "H6UbmUey0JS5-GgUNry8fQ", "user_id": "b8aCjlTJDA0hoZLMAE-iLg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was sorely disappointed after reading the Yelp reviews.  To be fair, even the 5 star reviews have negative comments.\n\nWe gave Aladdin 2 tries, and both times our food was sub-par.  We tried a pepperoni pizza, the Liguria pizza #1, jalepeno poppers, and a cannoli.  The cannoli bumped my review up to 2 stars.\n\nThere's nothing specifically wrong with the food, it's just overall... not good.  I love pizza, and this pizza was bad enough that I didn't want to eat it.  We've never had so much pizza left in the box after dinner -- both times.  The jalepeno poppers tasted like they came from a box, we didn't finish those either.  They were not spicy or cheesy, more like bland breaded pepper.\n\nNeedless to say, we will not be ordering from Aladdin again.  Especially with their delivery fee, it is the most expensive pizza around.  There are so many better options that are also cheaper, just choose one of those places.", "date": "2015-04-30 01:08:52", "user": {"name": "Selena", "review_count": 153, "yelping_since": "2012-12-19 19:10:08", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.27, "fans": 12}}
{"review_id": "IhV97R7ccTqnuhG2uWR2xA", "user_id": "jUD1PZWHvPnM7rCuAXGRbg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Aladdin pizza is one of those places you're not sure if their good or bad, but by all means they are amazing! They have a wide variety of pizzas not just your typical pepperoni one. I saw an eggplant steak and recommend it to everyone. They are super fast and generally takes less than 15 min to bake your pizza. The place itself is not the best since it, but the pizza is one of the best ones I've tried", "date": "2015-04-25 02:23:17", "user": {"name": "Jesus", "review_count": 6, "yelping_since": "2012-07-02 23:15:21", "elite": "", "average_stars": 3.83, "fans": 1}}
{"review_id": "T4_KFCEA1hW2AsoxYjWmWg", "user_id": "p25XAH6acIt3YcofNro0KA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "This place is absolutely disgusting, how did this place get rated4 stars???!!@$?\nI ordered a buffalo chicken cheesesteak (per menu, sauce is blue cheese & hot sauce), but instead it came with BBQ sauce. The BBQ sauce had a very strong vinegar smell and was 100% disgusting. I was very disappointed and will NEVER order from here again!", "date": "2015-02-08 20:44:56", "user": {"name": "Gah", "review_count": 1, "yelping_since": "2015-02-08 20:38:02", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "0btRuI5tyd-Ea1UAlPaGig", "user_id": "A-7urc8i5PI0J-7QzTpY7w", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "you gotta try Margarita pizza its the beat in town.\nThe manager is really nice when I think of pizza I think Aladdins", "date": "2015-01-23 23:58:51", "user": {"name": "Jonathan", "review_count": 8, "yelping_since": "2013-03-24 16:53:14", "elite": "", "average_stars": 1.5, "fans": 0}}
{"review_id": "qHyOaw1WkAhUUTqj4J_seQ", "user_id": "oHdsJ3kbnYnaj2Qd4JFO9g", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Aladdin has a great selection of tasty and innovating pizzas, such as lamb gyro, and beef eggplant, in addition to the standard pizza selection. They also have milkshakes on the menu! As far as pizza joints go, this is top tier in my book.", "date": "2015-01-22 14:22:21", "user": {"name": "Jonas", "review_count": 2, "yelping_since": "2014-02-02 16:29:49", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "dtJMC7HRAb7i1suZSHGNpw", "user_id": "NbWVDoOgJgdwGnU3rCRyJQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is as good as it gets for take-out pizza in West Philly. Better than Allegro, better than Axis, better than Fiesta, better than Colonial, and definitely better than its neighbor Accu. The owner and staff are always very friendly, the pizza (or slices) is always hot and delicious - I'm a particular fan of the margherita. I also have been very pleased with the taste and portion of the strombolis, and the Aladdin fries are out of this world. If you're a sauce lover, then this is the kind of pizza for you.\n\nGO try them! It shows how hard the owner tries to make it a good experience for customers. You won't be disappointed!", "date": "2015-01-15 02:36:09", "user": {"name": "Tom", "review_count": 10, "yelping_since": "2012-02-23 18:53:46", "elite": "", "average_stars": 4.83, "fans": 0}}
{"review_id": "5AoH-KkdL1rcfOvvAWfyPA", "user_id": "5IBMN_CFw8nydtXvnhszsQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "This was honestly the worst pizza I've ever had...no exaggeration. I would actually recommend you get a slice from the Fresh Grocer over this place. I ordered a medium Umbria and Toscana Special for delivery. The Umbria: sour pizza sauce, no tomatoes, no onions, and a handful of mushrooms clearly from a can (advertised as wild mushrooms). The Toscana Special: also sour pizza sauce, ridiculously hard pizza crust, no cheese (advertised as extra cheese), no ground beef, no black olives. All pizzas: arrived cold, not even warm, and flavorless. To try to salvage one of the pizzas, we scraped off the sour sauce and replaced with our own. I'm not sure if this was an abnormally bad night or something, but it was DEFINTELY enough to keep me from trying a second time. Very misleading descriptions in the menu, ingredients were far from fresh, and it showed in the appearance and taste. Awful product for the $30+ spent for this. With this type of unpredictable service, I would recommend eating elsewhere or taking the time to make it yourself.", "date": "2015-01-03 03:46:27", "user": {"name": "Sherise", "review_count": 42, "yelping_since": "2013-01-03 05:23:23", "elite": "", "average_stars": 3.06, "fans": 2}}
{"review_id": "XGZ3a6N9SOH2mJ0xCuechQ", "user_id": "7UVH0pYhL1Mpvdt4rGFBMA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Philly is a bit of a pizza dessert. Aladdin's offers great service and more thoughtful toppings than many others in this city. \n\nWe recently ordered the Umbria to take home. Looked good, but nothing spectacular - tasty enough but lacked the flavor I expected from the description. Biggest complaint was the \"wild mushrooms\" it advertised. They looked and tasted like they'd come from a can.\n\nService upon pickup was friendly, professional, and prompt (which makes all the difference). I might order from them again in the future, but can't say this is the best option in the area.", "date": "2015-01-03 02:25:35", "user": {"name": "Ariel", "review_count": 23, "yelping_since": "2011-07-18 17:30:01", "elite": "", "average_stars": 3.54, "fans": 0}}
{"review_id": "EgegbwqRewkxky3ChVx7Sg", "user_id": "4zndI51AO-IXvuZCVgARaQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Aladdin Pizzeria delivers a solid pizza, and the staff are friendly and accommodating. They have a decent variety of pizzas available, albeit at a premium for anything interesting, and they make an effort at customer loyalty by offering a free pizza if you hold onto 10 receipts for previous pizzas (which might get a little unwieldy, but is appreciated).", "date": "2014-12-29 20:54:16", "user": {"name": "Bryan", "review_count": 17, "yelping_since": "2012-08-15 18:54:27", "elite": "", "average_stars": 4.35, "fans": 1}}
{"review_id": "kXCoEAcpixcX47IM5fmPUQ", "user_id": "bcU8vHrHvWCMEx6hmQktkQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place has such great cheesesteaks and hoagies! Every time I move within Philly I try different places to get a good cheese steak and this is definitely my new place. And they're fast- I place an order and pick up in 10 minutes. The pizza was a little too cheesy for me, it kept falling off my slice but it still tasted great. If you want great hoagies in a matter of minutes this is the place.", "date": "2014-12-20 01:19:41", "user": {"name": "Genevieve", "review_count": 28, "yelping_since": "2014-01-22 04:02:51", "elite": "", "average_stars": 3.86, "fans": 0}}
{"review_id": "D2oYPI-QpD-nmOHLECkPhg", "user_id": "oiupv9Z2dnH7Fe5setoK-Q", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food. The pizza was fresh and the chicken broccoli sandwich was delicious and different. Service was great too at 1:30 am.", "date": "2014-12-09 23:20:02", "user": {"name": "Amir", "review_count": 14, "yelping_since": "2011-12-26 15:50:17", "elite": "", "average_stars": 4.21, "fans": 0}}
{"review_id": "KeqC3RoAlnmM9JHkzh6GeQ", "user_id": "Hyx7yCz0sdcxJJa4Qm7DYg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "YES. On so many levels love this place. Friendly owner and a great crowd whenever there is one. Food is amazing and I think what I'll miss most during the move I'm making. Definitely coming back for their pizza from time to time.\nGreat staff, great timing, great energy.\nSicilian pie is great and a major favorite for every pizza I've ever had... Seriously.", "date": "2014-12-07 04:01:40", "user": {"name": "Grace", "review_count": 32, "yelping_since": "2014-08-24 16:02:39", "elite": "", "average_stars": 3.72, "fans": 2}}
{"review_id": "AeWEJVQEjXRMRU7SMgF5hA", "user_id": "CIrnrGHph0a_U2xtLDwKhA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I love Aladdin! It is the best pizza joint in west Philadelphia! My favorite is the Margarita pizza but the cheese fries are another guilty pleasure as well.", "date": "2014-11-24 04:12:53", "user": {"name": "Christin", "review_count": 2, "yelping_since": "2012-01-27 01:10:54", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "mm8noKWdrxBUD0bi7eu__Q", "user_id": "7xWrRJ5kfgcQyQ3UL3fImQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered delivery at a friend's place and this place took forever. It was over an hour for the pizza to get there! Once the sicilian pizza got here it was not that spectacular. The cheese was rubbery and there was hardly any sauce on it. This is why South Philly pizza is better than this crap, so I doubt I will eat at (or from) this place again if I am in the area.", "date": "2014-11-12 00:31:17", "user": {"name": "Mark", "review_count": 532, "yelping_since": "2012-05-24 03:13:57", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.75, "fans": 18}}
{"review_id": "PdBfIttpDmbpEDmbp-CrqA", "user_id": "AoiUsIFjIcDa1FQxQnjZ9g", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great pizza, store owner/staff, and service! A true gem in West Philly. \n\nAlso it's open and Grubhub-able till 2AM.", "date": "2014-10-31 23:04:26", "user": {"name": "Serena", "review_count": 22, "yelping_since": "2014-06-03 05:47:10", "elite": "", "average_stars": 4.09, "fans": 1}}
{"review_id": "RMnGdODDwe-vaQiFys0Dpg", "user_id": "hX9Uza5h-s9B7OKvB6qw_Q", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "West Philly local pizzeria has been a neighborhood staple. We've been coming here for years and definitely years to come. Everything on their menu is delicious, and their long list of specialty pizzas is definitely something you should check out. The staff is extremely friendly and very helpful when you're stuck and don't know what to order. Also, as a vegetarian, there are plenty of options available. \n\nGive this place a try and you won't be let down!", "date": "2014-10-25 00:19:51", "user": {"name": "Miley", "review_count": 23, "yelping_since": "2014-04-18 23:21:58", "elite": "", "average_stars": 4.19, "fans": 0}}
{"review_id": "foeMbLY_cFCt2XGGQRET0A", "user_id": "HVGKpnv8gLs870KQCf0Thg", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love this restaurant. They always have my pizza ready in under 20 minutes for pick up and the people that work there are very nice and helpful. They have recommended some great items, but my favorite is the delicious margarita pizza. They have a new breakfast menu as well which is nice. Great place all around!", "date": "2014-09-29 21:58:16", "user": {"name": "Christin", "review_count": 1, "yelping_since": "2014-09-29 21:52:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "UwULKCodrDINFyNg92EaPw", "user_id": "gOAvWocRyGbKvUaitVy8fQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I moved nearby and had to check it out. Nice to know they have Sicilian style crust if I want thick crust. Also nice to know they sell slices. This pizzeria has sandwiches and now serve breakfast. I ordered two slices to go since I am still unpacking. It was delicious. Employee was friendly. Happy to know I have a pizza place so close. There are tables to eat in ad well.", "date": "2014-09-01 23:52:49", "user": {"name": "Xando", "review_count": 375, "yelping_since": "2009-11-18 02:41:22", "elite": "2012,2013,2014,2015,2016,2017,2018,2019", "average_stars": 4.5, "fans": 16}}
{"review_id": "yEQEpfv2sMxXg0dAVMMh-Q", "user_id": "EuIgz-a1nm-pCkW2iX7e-A", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Taste: 8/10\nPortions: 10/10\nCustomer service: 10/10\n\nFood was made quickly and the customer service was amazing. Portions were huge and taste was also good. Highly recommended!!!", "date": "2014-08-22 01:18:51", "user": {"name": "Cory", "review_count": 6, "yelping_since": "2014-08-22 01:18:46", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "ATJkLc7M57GZvY7FqlheAw", "user_id": "V4ZCxiWUCUWsKxeZY2JxGw", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I placed an order about two weeks ago through Eat24. When I got to the restaurant to pickup my food, I had to wait to be noticed because the two guys behind the counter were having a heated discussion.\n\nAs part of my order, I got a cannoli. When I opened the package at home, it was melted (from sitting atop the hot food) and the shell was barely two inches long. I paid $2.25 for that piece of crap. \n\nI could have went to any half-way decent pizza place in South Philly and got a real cannoli and most likely better customer service.", "date": "2014-08-05 02:32:05", "user": {"name": "Michael", "review_count": 42, "yelping_since": "2014-08-05 02:23:12", "elite": "", "average_stars": 3.25, "fans": 2}}
{"review_id": "UtEFyJizCP1mVTP5v4SCzQ", "user_id": "scOIqqM_RoxL5OFDirb7DQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Being new to the area, I ordered around to get a taste of the local pizza scene.  They were all average for the most part.  Then on a walk with my dog I dropped into Aladdin's and asked what was good.  He told me to come back in 10 min. and he'd take care of me.  I'm sure he knew he couldn't miss with the Margherita Pizza, because he was quite confident I'd be back and had some more recommendations for future orders.  I took it home and my girlfriend and I both agreed that it was the best we had tasted in West Philly.  Now we go about once a week trying new things, but always grabbing a Margherita Pizza (best on smell alone, so fresh).\n\nAs another side note, I've noticed that they make everything upon order.  Even the chicken that they use is fresh, not frozen, and prepared fresh for your order.  I've been able to tell at other sandwich places that this isn't the case and it's another reason I appreciate having a place like this around.\n\nEverything that I have had there, from sandwiches to strombolis to wings, has been great.  When you add the amazing service and surprisingly warm atmosphere inside it's a can't miss for West Philly locals.", "date": "2014-07-10 13:54:50", "user": {"name": "Ryan", "review_count": 5, "yelping_since": "2014-01-18 00:20:21", "elite": "", "average_stars": 4.2, "fans": 0}}
{"review_id": "zwq-e_xpI97nE30mbZHQ8g", "user_id": "-TLXQfY2lZ6DVWQj4BosxQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered a bunch of sandwiches for my family & friends as they helped me move.  We ordered by phone, and picked it up 20 minutes later.\n\nWhen we picked it up, the order was ready & hot, all correct and packaged ready to go.  The person behind the counter (not sure if he was the manager, head cook, or what - I think he was the only person there mid-day on a Saturday) was extremely accommodating and friendly. \n\nI shared a chicken parm hoagie and an eggplant parm hoagie with a friend.  Both were delicious. Everyone else enjoyed their sandwiches too.", "date": "2014-06-16 15:43:07", "user": {"name": "Herbie", "review_count": 535, "yelping_since": "2012-01-15 02:05:22", "elite": "2013,2014,2015,2016,2017,2018,2019", "average_stars": 4.24, "fans": 28}}
{"review_id": "IwuDeiyKEnGNeQ9WqcgTMQ", "user_id": "XUywm1fGNpBPlgET8KnwaA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 2, "funny": 1, "cool": 0, "text": "Okay. I wanted to wait until after my food was delivered before I wrote a review. Hopeful that it would have been a burger worth 1.5 hr wait. NEGATORY!\n\nI called. Said it was my first time ordering from them and asked for a turkey burger with fries. 50 mins later still no delivery and when I called to inquire I was told they don't have turkey burgers. Seriously. I have to call back to find that out? Why didn't the person who took my order inform me of this crucial piece of information? Oh. My number you ask? The one they have to call to let me know their outside? They CLAIMED someone called me but my phone didn't ring. \n\n20 FREAKING MINUTES LATER! My food arrived and the burger was gross. Definitely not worth the 1.5 hr wait to put it lightly. \n\nThat was my first and FINAL order from this place. Save yourself the supreme irritation.", "date": "2014-04-21 01:07:30", "user": {"name": "Gisela", "review_count": 12, "yelping_since": "2010-12-04 23:49:28", "elite": "", "average_stars": 4.64, "fans": 0}}
{"review_id": "FH9D2mh87PyGT9RgrZe6BA", "user_id": "IneFMPA9rIYnx9ym635K3Q", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "The day after I posted the review here on yelp concerning my horrible experience at Aladdin's, I received a phone call from the store's general manager, Mike.\n\nAfter apologizing profusely for the previous day's missteps, he explained that he was not present when my situation was handled, & that he had new people working that day. He assured me that he coached the responsible staff on the importance of high quality customer service & to never allow anything like that to occur again. \n\nIn the end, he offered me a free meal any time I'd like--to just give him a call & he'd take care of it. I happened to be just heading home from work & was starving so I ordered the Eggplant Parmigiana Sandwich with their Old Bay fries on the side. Happy to take care of my order, he even threw in another Peach Cobbler, noting I had ordered one the night before, & assured a speedy arrival. \n\nSure enough, not long after I arrived home, (not even 25 minutes later) my phone rang with my delivery outside. The driver apologized for the previous day's mishap as well, clearly knowing who he was delivering food to, and ensured me they took great care to make me the \"Best sandwich [I'd] ever have!\" \n\nAs always, the food was just a tad spicier than most other pizza places in the area, but the quality was great! And (in my opinion) even more importantly, so was the fantastic customer service!", "date": "2014-04-16 12:55:30", "user": {"name": "Katrina", "review_count": 8, "yelping_since": "2011-12-23 04:02:01", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "xc6zIN5cFR8xbXWGqLyExg", "user_id": "IneFMPA9rIYnx9ym635K3Q", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "Before today, I had an outstanding view of Aladdin's. Tonight, however, that certainly changed. \n\nI ordered their Vegetarian Sandwich from the grill (which is supposed to come with fries & coleslaw), & paid the extra 50 cents for cheese as well. I also ordered their peach cobbler for $2.50. \n\nI was happy to receive my order about 15 minutes ahead of schedule...until I opened it.\n\nNot only did my sandwich have not even the slightest trace of cheese, but there were no fries or coleslaw to be found. And the size of the peach cobbler was closer to a dollar sized portion as it came in a circular container that couldn't have been more than 2.5 inches in diameter.\n\nAnd this isn't even the worst of it. \n\nYou see, I ordered through grub hub. And so upon seeing my lack of food delivered, I called customer service to report the issue. The rep put me on hold to speak with the pizzeria themselves. They returned to tell me that the restaurant REFUSED to send fries OR give me any of my money back!!! I was in shock! Like, are they serious right now?!?\n\nThat is COMPLETELY UNACCEPTABLE!!!! One thing is for sure, I will NEVER be ordering from Aladdin again! \n\nAnd I'm going to try and post photos as well because this is so outrageous I wouldn't believe it myself unless I had seen it! The only saving grace was that GrubHub themselves did offer $5 for the inconvenience. But Aladdin's handling of the situation was piss poor at best.", "date": "2014-04-15 03:34:08", "user": {"name": "Katrina", "review_count": 8, "yelping_since": "2011-12-23 04:02:01", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "kctFmmEaQ6gf9ZgicLXLog", "user_id": "4WuPoVuTK5AB-onOdql6fQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered the Mannicotti and it was excellent. The driver forgot my 2 liter drink, went to the corner store and returned with a warm bottle, +5 for motivation, -5 for execution. Things happen, hope the .25 he saved was worth this review.", "date": "2014-04-07 15:53:00", "user": {"name": "Fred", "review_count": 10, "yelping_since": "2013-02-24 01:22:40", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "JJq5DXxLiX-__49ZgzikIw", "user_id": "gCRBwUVGLxoxm85deceFLA", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Great food and fantastic customer service.\n\nCheesesteaks are delivered toasty hot; cheesefries aren't the slightest bit soggy; even the cannoli is delicious!  \n\nEverything arrives fast & hot!\n\nWhen you walk in the restaurant, you can see the entire kitchen. It's very clean and everything is made fresh in front of your eyes. \n\nMy order spilled all over due to a defective takeout container, and they refunded the entire thing without hesitation. \n\nThis is my favorite delivery in University City !!!", "date": "2014-02-08 00:32:21", "user": {"name": "Liz", "review_count": 15, "yelping_since": "2014-02-08 00:28:05", "elite": "", "average_stars": 3.78, "fans": 0}}
{"review_id": "p7lr4UjPH8prpE9ueE0Zvg", "user_id": "kIUDNNr0lCzYZ5WjNjsRAQ", "business_id": "e2l19ABu1xIn9hnvWukJ3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Oh goodness the buffalo chicken pizza is my favorite of all the pizza places I've tried in the area.  SO GOOD!", "date": "2014-01-03 03:38:24", "user": {"name": "Renea", "review_count": 256, "yelping_since": "2011-06-09 13:47:10", "elite": "", "average_stars": 3.75, "fans": 5}}
