{"business_id": "Bih0eT_lbbCUwKmGYpX0hw", "name": "Ricci's Hoagies", "address": "1165 S 11th St", "city": "Philadelphia", "state": "PA", "postal_code": "19147", "latitude": 39.9353601, "longitude": -75.1615836, "stars": 4.0, "review_count": 67, "is_open": 1, "attributes": {"OutdoorSeating": "True", "RestaurantsDelivery": "True", "RestaurantsAttire": "'casual'", "Alcohol": "u'none'", "Corkage": "False", "RestaurantsPriceRange2": "1", "RestaurantsReservations": "False", "BYOBCorkage": "'yes_free'", "GoodForKids": "True", "NoiseLevel": "u'average'", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "BikeParking": "False", "RestaurantsTakeOut": "True", "WiFi": "u'no'", "Caters": "True", "HasTV": "True", "WheelchairAccessible": "True", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': True, 'dinner': False, 'brunch': False, 'breakfast': False}", "Ambience": "{'touristy': False, 'hipster': False, 'romantic': False, 'divey': False, 'intimate': False, 'trendy': False, 'upscale': False, 'classy': False, 'casual': False}", "BusinessAcceptsCreditCards": "True", "RestaurantsGoodForGroups": "True"}, "categories": "Restaurants, Italian, Sandwiches", "hours": {"Monday": "8:0-15:0", "Tuesday": "8:0-15:0", "Wednesday": "8:0-15:0", "Thursday": "8:0-15:0", "Friday": "8:0-15:0", "Saturday": "9:0-15:30"}, "category_list": ["Restaurants", "Italian", "Sandwiches"], "stratification_tag": "Italian"}
{"review_id": "mW6JYRVFLAkZouQgtNvdTw", "user_id": "gcMPEkEXekKN6mYhLUI-Rw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 11, "funny": 2, "cool": 12, "text": "Ricci's Hoagies is an iconic and long established neighborhood institution in the City of Brotherly Love, Philadelphia, Pennsylvania. Ricci's has been in business since 1920 and any business that can not only survive, but flourish after hitting a century mark, has to be doing something right. \n\nHoagies ate a Philadelphia staple and definitely a food of the working man. A hoagie allows someone to eat something substantial in a quick an efficient manner. You don't have to worry about a fork and knife to help you in eating it. I heard somewhere that a sandwich was a favorite amongst truckers because they could eat it while driving. I do not know about the authenticity of the story, but it makes sense. But I think what allowed hoagies (or subs, grinders, whatever you want to call them) to survive is that they also taste great.\n\nI can say that a hoagie is one of my favorite meals. It is a perfect culmination of bread, meats, cheeses, veggies, vinegar, oil and spices and has been embraced worldwide as a lunch (or donner) favorite. Ricci's do hoagies right and as it continues to get handed down through the generations, I hope that they continue to flourish.\n\nSo, after over a hundred years, the community still loves Ricci's and after eating here, you will understand why. My go-to hoagie has always been an Italian and they do their Italian right. It is a substantial meal at a fair price and it is something that you will return to Ricci's again and again for.\n\nAs Ricci's enters into their second century, they still produce an outstanding product. With them continuing to do so, I can see them making it another century and beyond.", "date": "2022-01-11 14:07:02", "user": {"name": "John", "review_count": 3148, "yelping_since": "2018-08-03 12:39:48", "elite": "2019,20,20,2021", "average_stars": 4.0, "fans": 87}}
{"review_id": "b-pSMWmJdNVh7qnQf3AR4A", "user_id": "OExmdhEdcKHQQqXrv6ftTg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 3, "text": "Fantastic hoagies. Can't believe I never knew about this place in all my years living here? Sign outside boasts that it was featured on the Food Network, and I'm always a sucker for anything and everything Flavortown so knew I had to drop in for to-go lunch one day. \n\nIt's typical hectic South Philly ordering and I was a little intimidated when I walked in and saw the line of workers behind the glass shouting orders over the masses, but they couldn't be more pleasant.\n\nGot chicken cutlet hoagies with Cooper sharp and all the fixins' of an Italian sub (shredded lettuce, oil and vinegar, Italian seasoning shake, and pickles to boot.) With two bags of chips and two sodas, it was in the $20 range but WELL worth the price, plus I had leftovers for the next day the sandwich was so huge.\n\nProbably the best sandwiches I've had in a minute and fresh as all hell.", "date": "2021-11-17 00:56:38", "user": {"name": "Andrea", "review_count": 483, "yelping_since": "2011-04-24 02:36:06", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.0, "fans": 48}}
{"review_id": "P0gv-ERZEhDGUlUr54DehQ", "user_id": "WDH0zFOo4MhQ63Svc1gJhg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Long line, but short wait! Tried Ricci's Old fashion Italian and it was provably one of the best hoagies I've had. Bread has a little bit of chew to it yet was soft and absolutely stuffed with toppings 10/10 would recommend", "date": "2021-09-21 14:27:05", "user": {"name": "Alex", "review_count": 17, "yelping_since": "2016-06-27 23:11:58", "elite": "", "average_stars": 3.47, "fans": 0}}
{"review_id": "pSe5DPjDRST3o7VK-6b84Q", "user_id": "qhUgJ83GRhQ4yZIqApbfmg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Finally got to have a Rocco Hoagie  Yesterday and I have to say , Not Bad , definitely not the best in the City but overall not bad. It was very busy of course it was a Saturday. My real disappointment was with the finishing or condiment stations at the deli. They were so vastly inconsistent  which left me totally disappointed. My 5 hoagies had hardly any lettuce on them and I had to keep telling the guy to put the oil and vinegar on the side. And put the sweet peppers on it. He was just not paying attention and seemed as if he was very new at putting a hoagie together. Mayo on the meats , just a mess. It's a hoagie , it's not rocket science!  Meanwhile the other end where the woman was doing the condiment section was awesome. She just got it right and wasn't afraid to put the condiments on the hoagie. \nNeedless to say. These hoagies Just didn't have the right flavor or experience. It was just a meat sandwich with no condiments which is not my style of hoagie at all. \nSo, back to Marinucci's I go!!", "date": "2021-09-12 17:49:07", "user": {"name": "Dnr422", "review_count": 50, "yelping_since": "2016-12-30 11:59:59", "elite": "", "average_stars": 2.75, "fans": 0}}
{"review_id": "CB_k6isznFMZ4nz2UK6KXQ", "user_id": "86Sy0lj1Cxdv3MjT0NSfmQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I'm not usually a fan of Italian hoagies, but my father is, so I agreed to try Ricci's for his birthday. We had the old fashioned Italian hoagie with sharp provolone on a seeded roll. We were both blown away by the quality and taste. The meat was freshly cut, the roll was super soft, and the toppings were equally great. I can now say I'm a true fan of Italian hoagies thanks to Ricci's. Five stars - highly recommend.", "date": "2021-08-08 17:03:26", "user": {"name": "Adam", "review_count": 72, "yelping_since": "2013-01-31 16:25:14", "elite": "", "average_stars": 4.47, "fans": 3}}
{"review_id": "f0WELE1Lh-XQv0U8ES_aSg", "user_id": "fu7wU5WrMxqwYUN7mvyCUw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Thank goodness for Yelp. I am always on the lookout for a good Italian hoagie (hero). One would never find and this without Yelp and it's only 3 miles from where I live. South Philadelphia and Port Richmond and places like that aren't places one usually explores but they have some great food shops. I walked in. Nice and spacious for a South Philly shop. Signs indicating where you order are clear. People are pleasant enough for South Philly. I ordered an Italian. The next person takes your topping. Then you slide down to the cashier. I love seeded rolls and this place had them. I will NOT eat at a shop that doesn't have seeded rolls with the exception of Chick's in jersey. The ratio of meat to cheese to bread was spot on. Too little meat and cheese and the bread overwhelms. Too much meat and cheese and not even a seeded roll can hold it and meat and cheese are sliding out and you're chewing off the overflow without bread. Bottom line, deal with the parking or lack of and GO!", "date": "2021-07-13 17:07:45", "user": {"name": "Glen", "review_count": 132, "yelping_since": "2010-07-11 08:57:38", "elite": "", "average_stars": 3.69, "fans": 4}}
{"review_id": "VE9gvahOChLO2wZG3ytmTg", "user_id": "4CePQPV5N9u67i9PNHlRhA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 2.0, "useful": 2, "funny": 1, "cool": 0, "text": "As an update, I went a second time and seems there are consistency issues... I ordered the same hoagie (Old fashioned Italian with the works, with hot peppers & pickles). Unfortunately what I received  is not the hoagie I fell in love with. Very dry, very little meat & cheese. It's also missing a few of the requested items (i.e. hot peppers, pickles).  They were busy (which is great to see) but it's unfortunate to see their quality greatly decrease during busy times. \n\nI called ahead as suggested to avoid the wait and was told about 30 minutes (I waited closer to 50), but the line ended up going faster. I'd suggest going in line vs calling ahead so you can see your hoagie made in real time as well.", "date": "2021-03-30 18:02:52", "user": {"name": "Diane", "review_count": 76, "yelping_since": "2018-12-09 23:38:18", "elite": "20,20,2021", "average_stars": 4.19, "fans": 4}}
{"review_id": "aUMgOWFRuBodAZc7_vwGxQ", "user_id": "4CePQPV5N9u67i9PNHlRhA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I finally found it - the best Italian hoagie in the city! Ricci's Old Fashioned Italian Hoagie are what sandwich dreams are made of. I have no idea what makes it 'old fashioned' and have no idea what's exactly on it since their menu doesn't include descriptions, but I do know it's delicious!! \n\nMy best bet is - it includes the typical meat (high quality) , LTO, with pickles. The garlic-looking stuff in the middle is actually provolone chunks (I think provolone, but don't hold me to it- it's definitely some sort of cheese..).  \n\nThere is also mayo on it (not oil & vinegar) which I thought went really well together but if mayo isn't your thing, be aware. \n\nOverall I enjoyed every last bite of this hoagie & already can't wait for my next one!", "date": "2021-03-17 19:19:08", "user": {"name": "Diane", "review_count": 76, "yelping_since": "2018-12-09 23:38:18", "elite": "20,20,2021", "average_stars": 4.19, "fans": 4}}
{"review_id": "6anDscrFIjw1MjLcQHMgvw", "user_id": "XrciwUb4_JKSyW25mfEd0g", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Absolutely delicious. Old school classic Italian hoagie shop. The bread is soft flavorful and perfect. \"Old fashioned Italian\" is the best Italian sub I've ever had.", "date": "2020-12-22 17:15:00", "user": {"name": "Charlie", "review_count": 5, "yelping_since": "2015-05-21 02:34:46", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "3U1l3Y4a5i75qu5MmpQvDw", "user_id": "tUBOAn8bIl1d6TwrT3Lx1w", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place was goood!! I'm not a person that would order and Italian but I'm definitely glad I did.  Get there early because if they run out of bread your out of luck.  Can't wait to go back", "date": "2020-12-08 02:20:04", "user": {"name": "Rebecca", "review_count": 35, "yelping_since": "2010-08-08 23:23:50", "elite": "", "average_stars": 3.97, "fans": 0}}
{"review_id": "CWM1am8A1srArZT_X1E64Q", "user_id": "6S_QIPCejdJEht-LOY0zcg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 2.0, "useful": 0, "funny": 1, "cool": 1, "text": "We have  been going to Ricci's for Hoagies for years. Each trip we drive 10-12 miles from the mainline to South 11th street. Here of late something has changed. For one, the rolls are different they are not as soft and tasty as the rolls used previously. While our favorite Hoagie is the Italian Hoagie with pepperoni, things are just not as Good as they used to be. This change lets us know that we can get the same type and quality Hoagie right here on the Mainline. And in doing so, we will save gasoline and time by  not making the long distance trip to South Philly. \n\nSorry Ricci's, ... we hope you get back on point. We enjoyed you for years, but  things have changed, Your Italian Hoagies w/pepperoni,  are now debatable.", "date": "2020-10-10 23:13:42", "user": {"name": "Von", "review_count": 21, "yelping_since": "2009-05-10 21:23:01", "elite": "", "average_stars": 2.18, "fans": 0}}
{"review_id": "hT5C2-nB1ovgJspjTvZhhw", "user_id": "IZPu9be3lBueuMiyfg75MA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ricci's has the best hoagies in the entire world  They are so mouth watering and delicious and I've been craving one for years and just don't have the time to go get one  but guess what tomorrow I'm going ‍  Ricci's here I come", "date": "2020-10-02 15:08:38", "user": {"name": "Crystal", "review_count": 4, "yelping_since": "2020-08-30 19:29:59", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "toS4mZNudBFyl1ev7lcaGQ", "user_id": "aBJYRfsbETRKrzz5KNByPg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "The best hoagies in S. Philly!  Fresh meat and rolls always!  Great customer service too.", "date": "2020-09-22 14:14:04", "user": {"name": "Star", "review_count": 11, "yelping_since": "2015-12-31 02:02:29", "elite": "", "average_stars": 3.09, "fans": 1}}
{"review_id": "ci3mWEKOeUUEpEhBuU4MKw", "user_id": "cYMGeomll0s28QZwMQ6eMQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I have been going here since the 70s when I was a kid. Why, because my dad was going there when he was a kid and he introduced my brother and I. The prices have gone up since then, but the quality of the hoagie has not. Despite the current climate we are in, I had no issues today. Clearly marked areas to stand and you can still see their friendly smiles despite the masks. I appreciate their service and hoagies whenever I can get back in the city.", "date": "2020-08-30 03:35:46", "user": {"name": "Thomas", "review_count": 2, "yelping_since": "2018-09-22 21:13:48", "elite": "", "average_stars": 4.5, "fans": 1}}
{"review_id": "5YN9m3YrM2nBhNlIoNPB3Q", "user_id": "HbJjgFxMYBEAVHN46YnITg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Favorite place for a sandwich, everyone is so friendly at Ricci's, Great quality! I love going there! 10/10 recommend!!", "date": "2020-08-12 00:23:17", "user": {"name": "D", "review_count": 7, "yelping_since": "2020-08-11 19:01:08", "elite": "", "average_stars": 3.29, "fans": 0}}
{"review_id": "CZl8jhHLoJjmzvHURRyibA", "user_id": "gMERsoW2GWzl7kTOaH5qvg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent Sandwiches. Excellent customer service. Need to catering a party this is the place that can help \nyou out.", "date": "2020-05-09 21:07:30", "user": {"name": "Maria", "review_count": 3, "yelping_since": "2014-02-27 21:13:44", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "HjDmP6HfWNk4DHiDsOIiLA", "user_id": "edZabMpWKLiUDHKrVe2vMA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Ahh man where do I start ? The Italian tuna hoagie is heaven on earth . I was ordering two subs everyday for a span of two weeks straight. I had to stop going there for the sake of my waistline . The food is fresh and the staff are very friendly . Highly recommended!", "date": "2020-04-19 03:35:03", "user": {"name": "Mo", "review_count": 8, "yelping_since": "2016-05-21 06:19:31", "elite": "", "average_stars": 2.5, "fans": 0}}
{"review_id": "TU2D3OtKvzH9OIz_iRzpVQ", "user_id": "FQ6zou9WQJNU9KezrNaFYQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Amazing service and amazing sandwiches! Staff was so polite during social distancing. Asked us to stand outside, took our order and had us on our way in less than 5 minutes. The food is always so great and we will continue to come here for lunch during these times of uncertainty! :)", "date": "2020-03-24 17:17:00", "user": {"name": "Shannon", "review_count": 8, "yelping_since": "2016-04-03 22:01:23", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "1dG6Htuo3p1qLrkh5wCOJw", "user_id": "GqRMFfSySD-qGHzNThENRA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Little gem in a small neighborhood, great food and service. We stumbled upon this place and had a great experience!!", "date": "2020-02-23 14:42:14", "user": {"name": "JP", "review_count": 10, "yelping_since": "2013-09-12 15:18:05", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "KaNn-_N8lCpGwOH3ByIVBw", "user_id": "v59JOYQC0CleymY4RG2Abw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "There tuna hoagie are the best there fresh and for filling the bread is the best not to too soft or too hard sorry there no pic", "date": "2019-12-21 06:01:54", "user": {"name": "Brook", "review_count": 13, "yelping_since": "2014-02-20 13:26:10", "elite": "", "average_stars": 4.38, "fans": 0}}
{"review_id": "i0hNCpBud0KJshwZNnqQfA", "user_id": "EuMFWgEnd8HuQGxuUE8zpA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "Good quality Bread good quality meat and good quality service, the staff is very friendly and the service was good and fast. I had the italian hoagie it was very good. I will be returning", "date": "2019-10-17 17:45:49", "user": {"name": "Rahmir", "review_count": 155, "yelping_since": "2014-08-13 14:18:06", "elite": "", "average_stars": 3.55, "fans": 15}}
{"review_id": "PRG9JhovaGjoJ4yWIpm_4w", "user_id": "FNM3cyBEiHcC8fNhZBVbpQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Well I been going to Ricci's since I was a kid so even though this is my 1st review on here, I've had many positive reviews with them throughout my life. Still til this day not disappointed by anything I had. Most ppl know that If you want a official, authentic South Philly tasting hoagie whether you from Sp or not, this is one of the heavy hitters in the whole city for hoagies. This coming from a dude that's from Southwest, but the two so close it ain't impossible but it's doesn't take away from the fact though.\n\n  My hoagies were a Turkey and cheese, and an Italian. The rolls are real soft with no signs of dryness down to the ends. The turkey was very, very fresh most likely also because they slice the meat as soon as you order. Fresh lettuce, juicy pickles, tasty onions, peppers, and creamy flavourful mayonaise. All this made me realize even at my age now and 20yrs later they may never fall off which is legend.\n\n  So to anybody curious about where and who in Sp have one of the best hoagies whether you not from the city or even If you are from here but never discovered Ricci's, Come here. You should not be disappointed. You'll thank me again.", "date": "2019-10-04 17:21:20", "user": {"name": "Shareef", "review_count": 80, "yelping_since": "2019-06-26 21:25:03", "elite": "2019,20,20,2021", "average_stars": 3.39, "fans": 10}}
{"review_id": "z_IKHfIe41SSgX8tU5Ebqw", "user_id": "CmR9s-2zH20UkmUt5Qwqnw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Only been here twice so far, and has good, but not incredible, hoagies. Have tried both the Italian and the Italian Tuna (dry tuna). Italian Tuna is probably my preferred one of the two; slight bit of Philly tude with the ordering, but nothing too bad (they were ultimately nice after I had a bit of a misunderstanding as to how the orders work). Would recommend, but nothing to separate it from the many other hoagie shops in South Philly.", "date": "2019-08-09 01:40:42", "user": {"name": "Benjamin", "review_count": 333, "yelping_since": "2015-03-17 14:50:30", "elite": "2019,20,20,2021", "average_stars": 3.94, "fans": 7}}
{"review_id": "J6-LSy5yrGuAD7nq6CPLBA", "user_id": "cGSIXpOJ-OS3qFqcsVacVA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best Italian hoagie I've ever had. We tried the \"Old fashioned Italian\" and a Turkey hoagie with all the toppings - both were delicious. Portions of the \"hoagie\" size are HUGE. They slice the meat to order and use Licio rolls. Staff was fast and very friendly. This will definitely be my exclusive hoagie shop from now on!", "date": "2019-02-02 18:45:42", "user": {"name": "Sal", "review_count": 3, "yelping_since": "2014-10-16 23:05:38", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "3MqQB0hgPCkygqVG9f7LYg", "user_id": "Ah3ZDxhdY8Y01ZzznTaGgQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "this place...best hoagies. i can't believe i'm now finding this gem. people there are so friendly. all i can say is get your hoagies here. it's just delicious. i wish they sold deli meat by the pound. classic hoagie perfected", "date": "2019-01-25 05:06:05", "user": {"name": "Rozena", "review_count": 26, "yelping_since": "2014-07-15 05:22:33", "elite": "", "average_stars": 3.93, "fans": 1}}
{"review_id": "mAZWzwN3pOzv6SdY-73t1Q", "user_id": "zMpvGbNYAHasx-ZxN_hFQw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Strait up gained 15-pounds after moving across the street!  This place was amazing to live near...not for my clothing, or body shape (unless rounder & lumpier is what you're into) but great all the same!  My two go-to's:\n- Old Fashioned Italian\n- Honey Turkey & Prosciutto w/ Swiss\n\nI have since moved out of Philadelphia and I still dream about the Old Fashioned Italian.  May be the best sandwich I've ever had.", "date": "2019-01-05 04:44:04", "user": {"name": "Nathan", "review_count": 31, "yelping_since": "2013-03-17 17:37:22", "elite": "", "average_stars": 3.77, "fans": 1}}
{"review_id": "HiFV90UTpCPClLDgmhTbjw", "user_id": "VADOHGTzguEeBMIELPQA8w", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of the best hoagie shops in the city. Everything is so fresh, from the meat to the bread. The Italian hoagies are the best, trust me you will not be disappointed if you get one. The customer service is good also.", "date": "2018-11-10 17:59:00", "user": {"name": "Terry", "review_count": 18, "yelping_since": "2014-01-05 20:10:54", "elite": "", "average_stars": 3.42, "fans": 0}}
{"review_id": "egRMzryz5R8BqXViLYzDLQ", "user_id": "CGPCE8uhkRK3E3fVpaMg7Q", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Perfect Italian. Simple, cut to order meats with fantastic bread! I will be back many times over. The entire atmosphere is great too. Nice people", "date": "2018-09-28 18:37:36", "user": {"name": "Fran", "review_count": 10, "yelping_since": "2015-09-09 22:35:30", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "RvrGe-vM47kAN3n18kD9vg", "user_id": "3dbl4HldLqBSzcqlORmo8g", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Good food . Messed up my order twice . Than last time i order they give us American hoagie with no meat. Just cheese .", "date": "2018-09-12 17:33:01", "user": {"name": "Heather", "review_count": 1, "yelping_since": "2014-06-16 18:55:26", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "qmJ6suH8mnoGTjvR83WUtA", "user_id": "NE2jp6pQ3AzfUnuMVBDMPg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've heard great things about this place and today was he day to try it. I'd attach a photo of the turkey hoagie I got but it was too good to stop eating it. Oops haha. If you like a simple turkey hoagie with LT and SP then you're in luck! They have other specials and a variety of different hoagies to make too, so I hope I get to try any other one. They have a $10 min for card, but they're hoagies are all around 8-9 dollars. Buy a drink and you're good to go! The only thing that I didn't or don't like is how early they close. I'd totally go here for dinner or a late night sandwich.", "date": "2018-08-21 18:28:28", "user": {"name": "Riley", "review_count": 18, "yelping_since": "2017-08-13 14:38:57", "elite": "", "average_stars": 4.32, "fans": 0}}
{"review_id": "1RHq1h9sfU9shTzImi30Yg", "user_id": "dOwIWBXE2zp2gz_LQ3gfMA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fresh bread. Fresh meat. The prettiest hoagie you'll see. Great (and consistent) service and even better food. Get \"the works\" you can't go wrong.", "date": "2018-07-19 18:11:28", "user": {"name": "Marisa", "review_count": 15, "yelping_since": "2015-11-19 22:22:25", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "dyjEoAKlA5tc1bFCxCE_0w", "user_id": "fJhr0G2JBNkfqpbIwkEQHg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Ricci's is probably the best example of an Authentic South Philly hoagie spot. This place is absolutely tops, from the portion sizes, to the quality ingredients, to the price. \n\nIf you go, just keep an eye on the clock, they close pretty early most days.", "date": "2018-07-03 19:50:52", "user": {"name": "Adam", "review_count": 122, "yelping_since": "2013-01-07 01:33:26", "elite": "2017,2018,2021", "average_stars": 3.93, "fans": 7}}
{"review_id": "cix1a7wFiP8y41LUdzQuMw", "user_id": "ZXKSdMJe2bG5pbfKPh9Lqg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Good sandwich customer service sucks they only have or make short rolls for certain customers!!", "date": "2018-06-15 14:54:43", "user": {"name": "Bitsy", "review_count": 1, "yelping_since": "2018-06-07 22:01:54", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "F4WajPK3XntH9T_zMpZ7dA", "user_id": "0YyF7OrD2VEUVUiYmKZ8MA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 3, "funny": 1, "cool": 1, "text": "So I was driving by I see the sign that they had best Italian 2017. So I stopped. Am I glad that I did. I ended up with the Ricci special that was amazing!!! The bread, the chopped peppers and olives. Made to order!!!  I am going back to try that Italian next. The only suggestion that I have is a menu to break down the sandwich. Can't wait to go back. My new favorite sandwich place.", "date": "2018-02-21 15:25:27", "user": {"name": "Tanya", "review_count": 322, "yelping_since": "2010-05-25 14:48:50", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.92, "fans": 29}}
{"review_id": "fi_x3iX0OdRyfC7cXiShOA", "user_id": "xnOzqVKDs4SgD37VFZ6EtQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "Solid hoagie spot that makes some design choices in their sandwiches that put it solidly among the pack, but nothing mind-blowingly good to exceed some of the others in the neighborhood.\n\nOrdered the Italian hoagie -- meats and standard toppings were good, but wasn't a huge fan of the grated sharp provolone for me, found it mixed in too much with the other wet ingredients on the sandwich. Bread was good, but pretty consistent with other South Philly hoagie institutions in the area.\n\nFriendly staff and they were good with keeping the line moving, so did not take long to place order, pay and be on my way. Limited outdoor seating available, but this place is really intended for sandwiches on the go.\n\nIf you're often in South Philly and looking for a new hoagie place to check out and add to your existing repertoire, would recommend you check out Ricci's.", "date": "2018-01-04 02:58:50", "user": {"name": "Chris", "review_count": 82, "yelping_since": "2012-10-21 16:02:42", "elite": "2018", "average_stars": 4.12, "fans": 0}}
{"review_id": "UxkfD4RgJVT3fwt0cGJhDA", "user_id": "X0irK9P-3gX3yq-lneoQaA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great hoagies, great price, and they are fast! Their sandwiches are quite large too. My Fiancé and I share them when we work from home. Don't be discouraged if you see a line, it moves fast!", "date": "2017-11-30 21:54:37", "user": {"name": "Chris", "review_count": 28, "yelping_since": "2012-02-29 01:23:36", "elite": "", "average_stars": 4.11, "fans": 0}}
{"review_id": "z4LZLOIxI186OkQVZxE8uw", "user_id": "kyI_3H0gY_HQ9Qv6ouzt8A", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "This is my new favorite hoagie shop! I really dig the family owned vibe that has been around for almost 100 years. Everyone is super friendly there and they really know how to make a mean hoagie. There might be a long line but they know how to move it quickly. And while they're very focused on freshly sliced deli meats, they still have a very solid vegetarian friendly hoagie. The Veggie with Roasted Peppers and Eggplant has all the wonderful flavors you'd expect from an Italian hoagie.\n\nIt's also awesome that they won a Best of Philly award last year since they certainly deserved it!", "date": "2017-11-05 20:52:53", "user": {"name": "Dan", "review_count": 311, "yelping_since": "2010-05-31 03:23:19", "elite": "2012,2013,2014,2015,2016,2017,2018", "average_stars": 3.84, "fans": 30}}
{"review_id": "CuEPdwkF3XgGPs1RBzNbxw", "user_id": "-bQxSRisWHun5l4e7YgYZQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "These are the best hoagies on the planet. I ate them as a child growing up, and I eat one everytime I visit South Philly. These never get tired or old. LOVE THEM FOREVER!", "date": "2017-11-03 02:10:13", "user": {"name": "T", "review_count": 5, "yelping_since": "2016-07-23 20:15:06", "elite": "", "average_stars": 3.2, "fans": 0}}
{"review_id": "8M5P822fBtd5Pgnflc5CnA", "user_id": "vjoJxlyulSVje4eYgAi0NA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "I live down the street and they have a contender of a italian hoagie aka it was the bomb. I will be back with friends. Facts. Rolls were fresh and the meats were authentic. A must try in my opinion only other sub shop that comes close would be Primo Hoagies which serves ice cold beer.", "date": "2017-10-05 18:22:04", "user": {"name": "Domenic", "review_count": 24, "yelping_since": "2017-08-21 20:26:15", "elite": "", "average_stars": 3.92, "fans": 0}}
{"review_id": "bWdV2lYzh4dt0Q8pzIuzJA", "user_id": "GfI-d9mQePFA2PvhAd4WGQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great value!! Big sandwich at great prices. Sliced to order! But... the bread never holds up. My buddy thinks this is the best hoagie and I respect his opinion, but he's wrong. So many hoagies so little time.....", "date": "2017-09-26 01:25:06", "user": {"name": "Robert", "review_count": 746, "yelping_since": "2015-03-28 03:27:59", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.76, "fans": 55}}
{"review_id": "GWhg2-you1OkkS8Nj8-7Qg", "user_id": "7uZ3cuA0wf4JKz3j4tk1yg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Agree with others, the honey turkey and mozzarella is where it's at. Busy at lunch, but the line moves fairly quickly.", "date": "2017-09-23 09:50:08", "user": {"name": "Anita", "review_count": 437, "yelping_since": "2008-03-28 03:16:14", "elite": "2014,2015,2016,2017,2018,2019", "average_stars": 4.02, "fans": 20}}
{"review_id": "nvOmEmMT8EDPt2bbZpcBZQ", "user_id": "-AevxiaIfN33SBjDN_jRog", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Best hoagies in South Philadelphia.\n\nIf you are stuck between Antonio's and Ricci's, I highly suggest Ricci's.\n\nThey are 100 for 100, never had a poor hoagie.\n\nAntonios is 0 for 2.", "date": "2017-07-25 21:26:27", "user": {"name": "Jason", "review_count": 3, "yelping_since": "2013-08-31 16:15:44", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "VYUqMHvjU16MI3Dqyd6Oog", "user_id": "oBY1zh0egZq3X9knSA6Zgg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I moved down to Philadelphia from the Reading area and this is now my \"go to\" place for high quality hoagies & sandwiches. The rolls are outstanding and late on Saturdays they sell the rolls seperatly to move out inventory.", "date": "2016-08-07 13:05:04", "user": {"name": "Charles", "review_count": 4, "yelping_since": "2016-05-06 16:46:48", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "r1OJijlB283EhAI54HeS2g", "user_id": "DFp6gn-sh6SsqydrETYJoA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Best hoagies in the south Philadelphia miss them since I moved to DC. Wish they had them here", "date": "2016-02-09 16:25:15", "user": {"name": "Carl", "review_count": 11, "yelping_since": "2012-07-19 20:06:39", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "QbcNxiGOk80QUbGplxe7jQ", "user_id": "GVnBlAPCt8S7QM8zjKYKkQ", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Been to all hoagie and sandwich shops in the city and by far they're the best. Watching my sandwich be made and with no mistakes. Quick service and never let down.", "date": "2015-10-29 16:34:48", "user": {"name": "Ron", "review_count": 25, "yelping_since": "2015-10-28 15:26:18", "elite": "", "average_stars": 4.23, "fans": 0}}
{"review_id": "AIutjuRIGpYbdHUYkBZKNg", "user_id": "ZrbYj3wVwIkp2Ulz1pq3HA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was very surprised to read someone say that the lady who answers the phone is standoffish Well every since i started going into this family oriented sandwich shop I have been treated with kindness. I always tell friends to go to Ricci's service is great they get really busy and out of consideration for other customers may not hold long conversations but they have been nothing but nice to me.... the food is awesome and if you see something you don't want to buy move on its not that DEEP....", "date": "2015-09-04 16:48:08", "user": {"name": "Tamika", "review_count": 4, "yelping_since": "2015-09-04 16:48:01", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "0JOfyXafzQXxRjChhQmw8g", "user_id": "fEtWwhNKSoTqIWTSEwGIvg", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The only thing is South Philly parking is the pits I was riding around and around then I found one. After all of that the store was empty. Next time I will call and place my order and double park.  I took a menu and I will place a order next time phone when I want a hoagie.", "date": "2014-10-14 18:58:37", "user": {"name": "Tanya", "review_count": 189, "yelping_since": "2013-01-28 02:39:12", "elite": "", "average_stars": 2.7, "fans": 80}}
{"review_id": "sF6lf6eXswUzlS-VjYqW5A", "user_id": "9a_aIrzdhEA0Elcb_y7FQw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 1.0, "useful": 1, "funny": 7, "cool": 0, "text": "I lived in the East Passyunk ave neighborhood for 2 years and wasnt impressed with the local hoagie joints. I was excited when I saw the reviews for this place and found it was walking distance from my place on 12th and moore. \n\nI walked in  ordered a tuna hoagie, lettuce, onion and American cheese. Come on its A TUNA HOAGIE, this isnt rocket science.  I knew something was wrong when they asked me if i wanted mayo..... bro I said TUNA, as in TUNA SALAD! Have you seriously never made a basic tuna salad hoagie before? Get this, the guy opened up a can of tuna poured the contents of said can onto the roll and wiped mayo down one side of the roll, threw on lettuce cheese and onion wrapped it up and gave it to me.  In shock i paid and walked away. \n\nTo give them the benefit of the doubt, I ate it. It sucked. and I will never go back. the end.", "date": "2014-07-02 02:12:47", "user": {"name": "T.", "review_count": 12, "yelping_since": "2013-10-25 20:34:49", "elite": "", "average_stars": 3.06, "fans": 1}}
{"review_id": "Trcjm0arwscixWKvwqN0KA", "user_id": "1TVFpuoMj2Xed9k9Q7VrUA", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "So I'm taking three stars off for selling counterfeit/ pirate DVD's and fake (or possibly obtained another way) Uggs. And by selling I mean the guy at the counter actively trying to make every customer buy one! Can't I just have a hoagie without the side of bootlegging? So long Ricci's.", "date": "2014-01-28 01:20:07", "user": {"name": "Jemma", "review_count": 304, "yelping_since": "2013-07-24 00:59:02", "elite": "", "average_stars": 3.47, "fans": 5}}
{"review_id": "FzExWc3Y3pZ97mSP9lkMQg", "user_id": "OVT5qmyfRiD3nS05-IDBTw", "business_id": "Bih0eT_lbbCUwKmGYpX0hw", "stars": 5.0, "useful": 2, "funny": 1, "cool": 0, "text": "I feel so lucky to live 50 feet away from this place. If you're looking for a genuine South Philly hoagie, this is the place. They've got great italian rolls (seeded or regular), fresh lunch meat (they slice it right in front of you when you order) and fresh ingredients. Go there enough and they'll know your order just by looking at you. \n\nI get the Old Fashioned italian every time and it's delicious. Tip 'em well.", "date": "2013-12-16 18:52:19", "user": {"name": "Rick", "review_count": 24, "yelping_since": "2010-05-06 06:32:39", "elite": "", "average_stars": 3.58, "fans": 0}}
