{"business_id": "2BRbu3cBbH2bCgzN3DVc8w", "name": "Table 31", "address": "Comcast Center, 1701 JFK Blvd", "city": "Philadelphia", "state": "PA", "postal_code": "19103", "latitude": 39.9540959695, "longitude": -75.1681137085, "stars": 2.5, "review_count": 127, "is_open": 0, "attributes": {"Alcohol": "u'full_bar'", "RestaurantsAttire": "u'dressy'", "RestaurantsReservations": "True", "NoiseLevel": "u'average'", "RestaurantsDelivery": "False", "HasTV": "True", "RestaurantsPriceRange2": "3", "BusinessParking": "{'garage': False, 'street': False, 'validated': True, 'lot': False, 'valet': True}", "Caters": "True", "RestaurantsGoodForGroups": "True", "GoodForKids": "False", "RestaurantsTakeOut": "True", "Ambience": "{'romantic': False, 'intimate': False, 'touristy': False, 'hipster': False, 'divey': False, 'classy': False, 'trendy': True, 'upscale': True, 'casual': False}", "BusinessAcceptsCreditCards": "True", "OutdoorSeating": "True", "WiFi": "u'no'", "HappyHour": "True"}, "categories": "Steakhouses, Italian, Restaurants", "hours": {"Monday": "11:30-22:0", "Tuesday": "11:30-22:0", "Wednesday": "11:30-22:0", "Thursday": "11:30-22:0", "Friday": "11:30-23:0", "Saturday": "17:30-23:0"}, "category_list": ["Steakhouses", "Italian", "Restaurants"], "stratification_tag": "Italian"}
{"review_id": "sI37eHbYCFiTuWr8QKGueg", "user_id": "zGc3UZ8gq_orRc3xNCf-ow", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Flabbergasted.\n\nI went here on a beautiful summer evening with my sister, and we were happy to see that there was outdoor seating in front of the Comcast Building.  We thought it would be awesome to chill and hang out in the open air, so we asked a bartender if we could sit anywhere.  \n\nWe sat down in a booth, and 3 servers walked back and forth past us, made eye contact, but no one came over.  They then stood 15 feet from us talking amongst themselves, again looked over, and still no one comes over. In the meantime, the bartender we spoke to was talking with someone that looked like a manager, who also looked at us a few times, but made no attempt to come over. \n\nWe finally had enough after sitting there for 10+ minutes with no greeting, so we got up to leave.  As we walked past the original bartender, we told him we were leaving because no one took care of us, and he was genuinely apologetic.  The wait staff shrugged and claimed they didn't know we were not being waited on, yet no one made an attempt to ask us to stay and make up for the horrible service.  To top it off, as we walked off, the guy who I presumed to be the manager pointed to the bartender and laughed at him for us walking out.  Seriously?", "date": "2013-09-02 13:49:31", "user": {"name": "C Y", "review_count": 87, "yelping_since": "2010-06-09 01:39:21", "elite": "", "average_stars": 3.47, "fans": 1}}
{"review_id": "r8znttfRmFfviQoqXUsZOQ", "user_id": "WT36RE4WkUIaEbLDjkPB3g", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "Great happy hour, this is the #1 spot for Philly Sips on Wenesdays in the summers.\n\nInside, the food is average for a steak house, but the service at the bar leaves much to be desired.\n\nCalamari is a great appetizer to start with, slighly peppery and no hint of being oily or greasy (although a larger portion would be nice).\n\nThe pizza's are hand tossed and large enough for 4 at the table to share as an appetizer.  you can't go wrong with the margherrita.\n\nThe steaks here are the most disappointing, you would expect more attention paid to the steaks in a steakhouse.  The filet is a little on the dry side, and be mindful that whatever you order will consistently come out a little more well done than what you ordered (my medium rare was medium-medium well)", "date": "2013-08-22 18:39:01", "user": {"name": "Ron", "review_count": 439, "yelping_since": "2012-07-04 13:19:17", "elite": "2013,2014,2015,2016,2017", "average_stars": 3.65, "fans": 24}}
{"review_id": "8wRPv88lrMf9BqwwmFzTvA", "user_id": "V7JZ5xGj7uZT5XFbjYLXfw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you want to go somewhere for sips where the bartender doesn't wash his hands and you and your friends get food poisoning as a result, then this is your place. Beware the big buckets of dirty ice water harboring the cans you just ordered.", "date": "2013-08-21 15:50:27", "user": {"name": "Fuzzy", "review_count": 17, "yelping_since": "2011-04-27 18:00:48", "elite": "", "average_stars": 2.94, "fans": 0}}
{"review_id": "kAtR-0zBDnpb5-TOsliGiA", "user_id": "QPkJADQ4GJU3lY6AyOgv0g", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here for dinner, wasn't very impressed, a little over priced for the ambiance and actual menu. Food was ok, but for price could have went somewhere better.", "date": "2013-07-21 15:03:04", "user": {"name": "John", "review_count": 6, "yelping_since": "2012-12-27 20:56:26", "elite": "", "average_stars": 2.67, "fans": 0}}
{"review_id": "1UtCZ0_-UqP3ft7mZVWT9w", "user_id": "kyI_3H0gY_HQ9Qv6ouzt8A", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 2, "funny": 1, "cool": 0, "text": "Non-conforming Center City Sips location: Table 31 does have the beer, wine, and cocktail specials, but they do NOT honor the half priced appetizers. And the Center City Sips website does list Table31 as having appetizer specials on Tuscan hummus with bruschetta; Artichoke, fresh ricotta and crap dip with pita chips. But good luck in trying to actually getting them to honor the deal.\n\nAs far as the drinks, stick with the beer. There are huge gatoraid coolers for the cocktails. And as you could imagine, good cocktails don't come out of a gatoraid cooler.", "date": "2013-07-21 14:49:05", "user": {"name": "Dan", "review_count": 311, "yelping_since": "2010-05-31 03:23:19", "elite": "2012,2013,2014,2015,2016,2017,2018", "average_stars": 3.84, "fans": 30}}
{"review_id": "QMAmRM8Z2Td8vD0i5YG4yA", "user_id": "prpyhhJBEsCnvFGQl6H8aw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "We went to Table 31 for dinner on Thursday and it was good. Originally we wanted to sit outside but it seemed as if the DJ wanted to make us tone death and it was only 7:00 pm. Inside was relatively busy and for some strange reason they packed everyone into one side of the restaurant instead of spreading us out. I ordered the gnocchi and my friend ordered something that was on the specials list that had an egg and beef on it. The gnocchi was ok and the small plate was the perfect size. My friend really enjoyed his meal so there were no complaints there. We then ordered the ice cream samples and the nutella cheese cake. The desserts really made the meal!", "date": "2013-07-14 14:18:49", "user": {"name": "Noheli", "review_count": 154, "yelping_since": "2012-09-09 02:23:35", "elite": "2013,2014", "average_stars": 3.85, "fans": 10}}
{"review_id": "mG-M9OlmRwE0qliJL0Dvow", "user_id": "zVe1jVmnHXJd1ysLVley6A", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was originally excited about my plans to dine at Table 31 because their website makes you think it's a great restaurant. Unfortunately, I was quite disappointed. From the bread basket & red pepper olive oil (the bread was cold and tasteless, and so was the olive oil sauce), to the vegetable dish (everything came fried even though it didn't say \"fried\" anywhere on the menu), everything was below average. The atmosphere is modern and trendy, but it was quite empty on a weekend evening for dinner...", "date": "2013-07-05 07:05:11", "user": {"name": "Naz", "review_count": 40, "yelping_since": "2013-07-05 06:00:45", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "t5VUmVvakU0_VYvnykFh5g", "user_id": "Rb9h7rGhhE7m-a43nXlOXQ", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "i was pretty impressed by my first sips session at table 31.  a south beach lounge feel complete with red ropes and loud dance music at the comcast center.  the space is definitely beautiful, an urban oasis of sorts.  the courtyard was noticeably flooded with hundreds of people having a good time after work.  the rainfall couldn't even dampen the electric atmosphere on this humid wednesday evening.  this is where all the philly yupsters come out to play for center city sips.  it's definitely not for everyone, especially if the philly bar scene is more your style.  but if you're  pocket square sportin, wingtip rockin kinda guy.  or if you're a marc jacobs toting, louboutin lovin lady.  then this is your place.  i'll be back again this summer when i'm feeln fancy after work on wednesday.", "date": "2013-06-28 13:54:16", "user": {"name": "Loy", "review_count": 112, "yelping_since": "2009-07-11 05:17:15", "elite": "2013,2014", "average_stars": 3.91, "fans": 6}}
{"review_id": "nabt6sEtQjRPse4wWKLljQ", "user_id": "itcyGJsassJ0iutr0gBMjg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I came here with friends for happy hour. What I like about this place is the outdoor seating area. Fancy and nicely designed, similar with the indoor space. It is truly a nice space to sit, relax and chat with friends. Other than that it is a pricey steak place, overrated and hard to find parking. It is probably one of the worse areas in the city to find parking. Drinks are pricey even for happy hours and service was not good. I guess it varies from time to time same with the quality of food.", "date": "2013-06-24 19:01:32", "user": {"name": "KhanhMy", "review_count": 407, "yelping_since": "2013-05-23 14:15:35", "elite": "2021", "average_stars": 3.41, "fans": 28}}
{"review_id": "lAZbFsc5KGly6h_I_5pb8g", "user_id": "ysdRPfF2yoXEfyortptsLg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love this place. Their specials are amazing. The Pizza is Sinful, and the hand-cut French Fries are TO DIE FOR. I love French Fries. \n\nI'm not sure why it has such low ratings, but I enjoy it when I'm in the area. I've only been to Philly twice. My first trip we were starving, found the restaurant and decided to dine there because we were in a rush. We were not disappointed. The second time which was 3/23/13 I was coming from a funeral and insisted that I visit for the Fries alone. \n\nIf that doesn't tell you something. I don't know what will.", "date": "2013-03-27 20:04:55", "user": {"name": "Yinka", "review_count": 13, "yelping_since": "2009-12-31 23:34:32", "elite": "", "average_stars": 3.77, "fans": 0}}
{"review_id": "lgHgA6Aze3Cm5bbPHJ4JKA", "user_id": "e5nZNky8H87io89mKOcN6g", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was good. Our waitress was nice. But when I asked what I thought was a manager where the restroom was, she gave me a face and directed me to the hostess and said \"it's their job, not mine\". I knew she worked there because she greeted me when we walked in and smiled. She was very cold and made it seem I was asking a very dumb question. I don't know her name but she was very Asian looking and was not very warm towards me. Besides that interaction it was fine. I do think this girl needs some more training in hospitality though.", "date": "2013-02-13 05:26:56", "user": {"name": "Matt", "review_count": 1, "yelping_since": "2013-02-13 05:18:24", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "sTlfOc6VIxJkFgRtR3XNlw", "user_id": "MpRMV1IlT8jzfLdI0fGr1w", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 5, "funny": 1, "cool": 0, "text": "all talk no walk\n\nWalking in, I was very impressed. We had a larger group reservation and they took us to their private back room dining room on the second floor. Walking through, I felt like royalty. It had strong lounge-feel vibes and the darker lighting and red decor theme gave me really high expectations. The dining room I believe is traditionally used for meetings because of the TV on the wall and board room-esque seating, but we were happy with the view.\n\nWe started the night with cocktails and also ordered a bottle of Chardonnay. This is where the night started to go downhill. The cocktails were not as good as people raved. My Ginger Kiss and my friends Comcastini tasted very watered-down and for lack of better words, cheap. Our stomachs started rumbling and we went right to ordering.\n\nI went with the pasta a la norma and got a large platter of antipasto misto for the table for appetizers. The wait time was noticeably long, about 25 minutes before we actually saw some food. I will say, the portions are huge. The pasta was sized like an entree and I was able to give multiple people at the table a good portion to taste. However, it was very simple, something I'm sure I could throw together in my own kitchen. The antipasto was also very pretty, but nothing special, just a bunch of meats and pickled veggies on a wooden platter.\n\nFor the second course, I got the wild black cod. This course was miserable. I still have no idea what it was, but there was something in the oil that the fish was fried in that gave it a very very undesirable aftertaste. It was similar to the effect of adding too much MSG, but my tongue wasn't tingling. It just felt like I was whiffing wafts of salty, spicy air. I couldn't take more than one bite a minute. The celery root puree was also strangely flavored. Both me and a friend noted it tasted very similar to cup noodle seasoning packets and it just wasn't impressive at all. The presentation was beautiful, but that's it.\n\nThe dessert was also not impressive. The flavor of the semifreddo was okay, but it was so frozen that it was hard to cut through and the berries in the middle were rock hard. Definitely not an ideal finish to the meal.\n\nAnother thing to note was the music. I noticed it right away as we were ordering drinks and all I could hear was, \"Girls Just Wanna Have Fun.\" The remainder of our night was accompanied with 70's and 80's pop music, which definitely wasn't fitting with the decor. \n\nFood was definitely not worth the price. Cocktails weren't amazing. Ambiance was awkward. I might come back for sips if I'm around, but that is about it. Not impressed.\n\nPros: beautiful decor, huge portions\nCons: watered-down cocktails, awkward music, food quality, price\n\nDishes to skip: wild black cod", "date": "2013-02-04 03:20:23", "user": {"name": "Ben", "review_count": 772, "yelping_since": "2011-02-12 06:30:08", "elite": "2012,2014,2015,2016,2017,2018,2019", "average_stars": 3.89, "fans": 91}}
{"review_id": "pP16-a_muqAPr4chd5s6Yw", "user_id": "PBJAY9jvUzcTAoI2oGDCwQ", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The good-\nThe anti-pasta appetizer was loaded with exotic cheeses and decent Italian meats. Steak was cooked perfect and tasted great. \nService was good. waiter was attentive and on point.\nEveryone I went with liked their dishes and I would say its a good spot for dinner.\n\nThe Bad-\nThe prices are more on par with Del-Frisco's or Union Trust but you don't get that ambiance or atmosphere. I'm not sure how to explain it but you just don't feel like your eating at a top spot but when the bill comes you def pay top price. \nEvery time the door opens, you get a huge gust of cold air that runs threw the place. So wear your jacket.", "date": "2012-12-17 21:22:25", "user": {"name": "Tony", "review_count": 30, "yelping_since": "2012-07-23 21:44:18", "elite": "", "average_stars": 4.13, "fans": 1}}
{"review_id": "zar2bOBx-9Bgx3U8miWxdQ", "user_id": "ojyWQJtQ_ESVDvqL-69tLA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "food was OK.  cocktails were GREAT.  even though the staff were very informed of what was vegan and what was not, and they were really very nice, the service was HORRIBLE. took 45 mins from us sitting down to getting our drinks.  also i asked them to bring my salad out during the appetizers and they said they didn't do that.  well i was hungry and didn't want an appetizer.  oh well.\n\ni went for a work thing and wasnt responsible for the bill.  i had a great time w/ my coworkers just wish the servers were more attentive.", "date": "2012-12-06 15:41:20", "user": {"name": "Lia", "review_count": 301, "yelping_since": "2011-02-11 16:41:35", "elite": "2013,2014,2015,2016", "average_stars": 4.03, "fans": 47}}
{"review_id": "i38QrpIFUxEwDCacRqrp_A", "user_id": "2myG_wthbdl6v9641BMx0g", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Table 31 for a family dinner last Saturday.  It was not a good experience from the food, to the drink, to the service.  My family went to able 31 about a year ago and everything was great. This place has since gone down hill.  The dip for the bread was rancid and the messed up the order with our appetizers.  They need to get their act together if the want to compete with the best restaurants in rittenhouse square, the place was also empty on a Saturday night.", "date": "2012-12-04 21:36:39", "user": {"name": "Joseph", "review_count": 15, "yelping_since": "2012-12-04 21:00:30", "elite": "", "average_stars": 3.81, "fans": 0}}
{"review_id": "cCNxjD2ddGQnbBa0QWxBGg", "user_id": "sh8uZxH6zUTUsfbKlhI5Cw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Interesting how my review no longer appears on Table 31's page...", "date": "2012-10-22 01:41:47", "user": {"name": "Mark", "review_count": 1, "yelping_since": "2012-10-12 00:47:24", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "8aENyopf0-uylDTvp5kkcw", "user_id": "VYuuNzTWju8D0rr8SvaZjA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Beautiful spot but I definitely need to check it out when it isn't sips to give an accurate review. This place is packed elbow to elbow during and it's no easy feat to get your hands on a drink.\n\nMy drink, when I was able to get my hands on it, was kind of watered down. I would chalk that up to Sips but I am a firm believer that if you are offering something (like low prices) to get people in the door, you need to deliver to get them to stay and perhaps even return.\n\nOverall, great location. I'll be back to give it another shot when it's less crowded but if they aren't up to par, it's unlikely I will return.", "date": "2012-10-20 19:43:51", "user": {"name": "Colleen", "review_count": 533, "yelping_since": "2010-01-28 20:52:54", "elite": "2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.69, "fans": 41}}
{"review_id": "C5i08sgy5qjR-uEF4Bi2XA", "user_id": "arsk282rNqIbJIhmc-I6Iw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 3, "funny": 0, "cool": 4, "text": "I have to be 100% honest...I yelp everywhere new I go and read some of the reviews before-hand and had a little bit of skepticism coming in.  It's always a great tool but with anything, it's all opinion based and this is absolutely one that I differ from the majority on.  \n\nTable 31 was amazing.  We were taken exceptional care of by Justin who not only kept the glasses full but described every part/ingredient in the meal and when asked for an opinion, led us generously in the right way.\n\nWe started with drinks which were priced very fairly, we tried the \"snail app\" which is apparently a not very well kept secret and loved it...although I am not a fan of snails, my date was pleasantly surprised and loved the sauce and accompaniments with the dish.\n\nFrom there we had House Made Cavatelli, the chef's specialty, and it was phenomenal.  We also sampled the lobster couscous and it was awesome. \n\nBy the time the main entree came, we were stuffed but the steak was so delicious that I worked it in anyway.  The house cut fries as the side were some of the best I've had.\n\nWe were a little bummed that although we didn't have room for dessert, the one we were going to get anyway had run out for the evening...we'll be back for that.  The music was a little loud for dinner (coming from the bar) but the conversation was good enough to drain it out.  The beer selection was pretty lackluster but the wine & cocktail list more than made up for it.  To have Yuengling, in Philly is really all you need, honestly.\n\nAll in all, I would without a doubt return and it was so good, I had to review it and save some of the yelp-ers that will see the middle of the pack review and maybe looks elsewhere....give it a shot, you'll be surprised.", "date": "2012-10-19 19:06:09", "user": {"name": "Jay", "review_count": 24, "yelping_since": "2011-08-17 16:19:13", "elite": "", "average_stars": 4.46, "fans": 1}}
{"review_id": "k-NAUJIqanLjq0t3ZtODGQ", "user_id": "ZwlyUe7_ilG-o3zGIzOppA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "I am sad that out of all the amazing restaurants in Philadelphia, we came here. The ambience is so alluring and trendy and we were starving after a long day at the Art Museum. Our waiter was very kind and really talked up the exclusivity and freshness of the menu. There was not much selection, so I ordered the house made cavatelli.\n\nI do not mind paying an exorbitant amount for great dining, but please make sure my pasta doesn't taste like hard, uncooked macaroni noodles with ragu red sauce if you are charging that much.\n\nTwo stars for everything being pretty to look at.", "date": "2012-10-12 16:33:48", "user": {"name": "Sunia", "review_count": 163, "yelping_since": "2012-04-30 22:53:05", "elite": "", "average_stars": 4.0, "fans": 8}}
{"review_id": "QF0xoOhe1bIUX7_YuxTE6g", "user_id": "sh8uZxH6zUTUsfbKlhI5Cw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Table 31 is a joke, and the punchline is that they took $150 from me.\n\nDO NOT GO HERE!!!!! EVER!!!!!!!\n\nMy wife and I have been here two times prior, and it had been good if not great.  Tonight, the food was laughably bad.  If you didn't laugh, you would cry because each course was somehow bad.  While eating my food, I thought to myself \"this food is on par with Chili's or TGIFriday's\".\n\nTable 31 reverse engineered restaurant week with the thought process of \"ok each person pays $35, how do we profit from that?\"\n\nFor our first courses, we ordered carpaccio and lasagna.  The lasagna was dry as it must have been sitting under a heat lamp for an hour or two.  It was on par with cafeteria lasagna.  As for the carpaccio, it was the coup de grace of the meal.  I would rate carpaccio as my top 10 favorite dishes.  In fact, my wife looked at all of the restaurant week participants and picked Table 31 as a surprise because she knows how much I love carpaccio!  I love the raw red meat, sliced so thinly that you can cut it with a fork.  \n\nThe waiter puts the carpaccio in front of me, and at first I thought that they forgot to put the carpaccio on my plate.  I realized that the carpaccio was white and blended into the plate.  It was plated with arugula, parmesan and a vinaigrette.  I am guessing it was pork, but honestly it tasted like turkey lunch meat.  The edge of the slices of meat were brown which meant to me that it was cooked somehow, and it tasted as if it was oven roasted.  The flavors did not blend well at all.  If someone gave me a plate of lunch meat and a salad, I may have preferred that over the carpaccio I had.\n\nNext, we ordered the oven roasted chicken, the eggplant parmesan and a side of meatballs.  My wife's chicken was actually pretty good.  My eggplant was piping hot.  I could not touch it for about 5 minutes.  After waiting for a while, I finally took a bite and it burned my mouth a little bit, so much so that it took me another 5 minutes to actually taste eggplant.  The meatballs had way too much garlic.\n\nFor the dessert, we had the chocolate creme brûlée and panna cotta.  The chocolate creme brulee stunk.  We didn't even finish it.  Who doesn't finish chocolate!  My wife actually said \"I mean, this doesn't taste good.  I feel like I am wasting calories by eating this.\"  With the panna cotta, it was ok not great.  The funniest thing about the whole meal was that on the panna cotta, they plated an assortment of fruits that were cut in half.  We got half a blueberry, not a full blueberry but a half a blueberry!  Who does that!  If the restaurant is too damn cheap to splurge on blueberries, then don't plate them!!!!!!  Oh and the blackberry was cut in half length wise, very weird.\n\nThis was probably the worst meal that I have eaten in Philadelphia in the 10 years that I have lived here.  And it cost me $150!  I am not that much of a foodie snob, but the meal was so bad that I was forced to create a yelp account to complain.\n\nPlease do not waste your time and money on Table 31.  There are so many great restaurants in Philly these days that are 1000x better than this place.\n\nIf you like:\n-Lunch meat and salads\n-Mouth burning food\n-Garlic\n-Wasted calories\n-Half of a blueberry\n\nThen by all means, don't let my review discourage you.", "date": "2012-10-12 01:17:07", "user": {"name": "Mark", "review_count": 1, "yelping_since": "2012-10-12 00:47:24", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "wmzYgWN3JkuhltwlcYvQUA", "user_id": "qb93lt68RXCsrmAc9AYJeQ", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 7, "funny": 2, "cool": 0, "text": "This place is such a joke. \n\nFirst of all, they are ridiculously overpriced. The quality of food varies from decent to well below average to being served cold black coffee. I think they're trying to cut a lot of corners lately and just ride out a previously well-earned reputation of being a nice Philly spot for fine dining, but that Table 31 is long gone and all that remains now is a very transparent attempt at being something they are clearly not.\n\nI thought the hostess up front was rather rude, first pointing out that a friend of mine wasn't dressed appropriately but that she would need to check with her manager to see if it was a forgivable offense. Is that the actual restaurant policy? Last I checked, when your business is sitting around completely empty, and five people who were decent enough to make a reservation show up, you seat them with a smile, not a stop sign, regardless of what color shoes or pants they're wearing. Luckily the manager has half a brain and motioned that it was totally cool, but the pretentious hostess still felt the need to educate us on how to dress at a fine dining establishment. Clearly, she needed a way to feel important. Glad we could help.\n\nThe food was unfortunately pretty inconsistent. We had some decent appetizers and that was about as far as we got. The entrees were all over the place, some being completely offensive, others being decent, and the rest just showing some laziness in preparation.\n\nWe continually had to ask the waitress to come back to help us since she was focused on pandering for her tip at a table of old rich people. \n\nLater we were handed serving spoons for eating our desserts, which in retrospect, I wish I hadn't ordered because it was forgettable at best.\n\n\nDefinitely will not come back, and will also mention to others that it's not worth going to.", "date": "2012-10-01 00:30:30", "user": {"name": "Rizwan", "review_count": 199, "yelping_since": "2011-06-18 11:57:49", "elite": "2011,2012,2013,2014,2015", "average_stars": 2.93, "fans": 13}}
{"review_id": "KxAmnJFUGicKnlZ4j1de2w", "user_id": "5G2IF0VIN3Brl-m45QDXsA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "No more Insalata Funghi? Boo!\n\nToo expensive to come here without anything awesome on the menu. Eh.", "date": "2012-09-25 18:26:25", "user": {"name": "Alie", "review_count": 327, "yelping_since": "2011-12-08 22:14:07", "elite": "2012,2013", "average_stars": 3.97, "fans": 45}}
{"review_id": "kQFZEhO_KEsD_4rfxilDDA", "user_id": "Zr4VzcOr8pRlxaRDIroEhw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 3, "funny": 1, "cool": 1, "text": "I wanted to like this place.  I somehow had gotten in my head that they were getting a bad rap, and that I was going to love it... but the service was just too horrible.  \n\nA group of 6 of us were there for a friend's birthday celebration.  It was on a Wednesday in the summer so we were there during Center City Sips, but were passing our time at the inside bar which doesn't do Sips before our dinner reservation in the Table 31 dining room. We had a lovely time at the bar, but everything went bad when we went to the hostess stand to be seated for dinner.\n\nThe hostess was condescending and rude.  She handed out the dinner menus while we were standing there to be seated as she stated that we would have to order from the dinner menu which is more expensive than the bar menu..  The implication seemed to be that we couldn't afford dinner..?  The waiter also got in on the poor service act stating us that he would need the table back in two hours.  I'm not sure what sort of establishment tries to hurry dinner guests along, but we should have left before we were seated as the evening would have gone better for everyone involved if we had never stepped into that dining room.  The waiter was ironically slow and despite our best efforts to eat and get the heck out of there, dinner still took an hour and a half.  Well below his two hour request, but we couldn't get out of there quick enough.  He was condescending throughout our dinner and unattentive and he should not be in a part of the food service industry that requires him to deal with customers. \n\nI don't understand what could have have happened to make these folks look down on our group of 30-something professionals, so I can only assume this is how they treat all their customers.  It is a shame because the food was good and the place was small but pretty nice.  Oh well.. I will definitely never return.", "date": "2012-08-22 15:25:53", "user": {"name": "Melissa", "review_count": 80, "yelping_since": "2010-11-16 12:51:10", "elite": "2012,2013", "average_stars": 4.0, "fans": 2}}
{"review_id": "xzKN7R-KVtBw4DbAElX_qg", "user_id": "it27xs8sb2jZ_LCPVzdcqw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 1, "funny": 1, "cool": 0, "text": "Blah... that's pretty much all I have to say about that.\n\nI enjoy the staff at Table 31, they've always been friendly so I give them 5 stars.  The low score comes from the atmosphere, specifically created by the crowds that frequent the restaurant.  \n\nFor whatever reason, I find that the city's pretentious folk like to go here.  Shame shame, because Table 31 has a great outdoor seating arrangement.  \n\nListsen, the drinks are fine as well as the food but sometimes the crowd just drains the enjoyment.  If you don't mind being around uppity douche-bagery, then you'll be fine.", "date": "2012-08-19 18:03:12", "user": {"name": "Brent", "review_count": 99, "yelping_since": "2010-09-20 01:59:13", "elite": "2012", "average_stars": 4.34, "fans": 4}}
{"review_id": "D4aPNTm7QFccpE1lGLUi6w", "user_id": "GevrFd8ojonAr4fEQB9WfA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 3, "funny": 18, "cool": 1, "text": "I wish I didn't have to rate this place because this is more a review about pointing certain people in the right direction and not about my experience.\n\nTable 31 is hilarious, especially for Center City Sips.  My office is 27 floors above Table 31 and I have always looked over the outdoor beer garden as the party gets started.  I never dared enter as I could tell from above, this place was not for me...but a friend invited me, so there I was.\n\nYou can tell very quickly that for a Wednesday night, this is the place to get it on and by get it on, I mean network like you never networked before.  Pocket squares, houndstooth, and cufflinks aplenty!  Everyone's eyes were roaming the outside beer garden as they tried to find a bigger and better conversation to get into.  My friend ordered me a punch from the bar that came out of some large cooler.  It is smart to not waste time mixing drinks - get these folks drunk faster!  The punch was just fine.\n\nWe didn't stay long, but I will always remember my time here.\n\nFor the young, beautiful and power hungry, this is where you have to go.  Your career and genitals will thank you for it.", "date": "2012-08-16 13:25:43", "user": {"name": "Callan", "review_count": 365, "yelping_since": "2008-03-06 03:30:59", "elite": "2009,2010,2011,2012,2013,2014,2015", "average_stars": 3.72, "fans": 44}}
{"review_id": "O5M2PWlVorcD2_fetbaWjA", "user_id": "0Ear9GEUEvSceG6uDsmyfg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 2, "text": "I must be missing something. Table 31 was great.  I read the reviews and went into it not expecting much.  After winning a work gift certificate we decided to make it a date night.... and boy were were pleasantly surprised. \n\nWe walked in on 5pm on a Saturday and were the only table there for most of our meal (by the end there were 3 other tables). \n\nWe ordered \nCHILLED SHELLFISH TIMBALLO (Shrimp, bay scallops, scungilli, red peppers, citrus vinaigrette) - This was a perfect tower of freshness. \nCRAB AND CORN TORTA (Fresh corn, blue crab,  tomatoes, house made  burrata, salsa verde) - The homemade burrata alone makes this dish a hit.  Burrata like that is rare to find. SO GOOD!\n\nZuppa De Pesce - clams, mussels with a white fish.  The broth was some of the best broth I've had.  It was a perfect bread dipping broth... we were both floored by how great it was. \nFillet Oscar - great cut of meat with a generous portion of crab, a whole roasted garlic and asparagus. \n\nDrinks were ok.  Servers were extremely knowledgeable.\n\nTable 31 was a hit for us. A pricey for sure. Food is great.  I'm not sure why they weren't packed... but sometimes it's nice having the place (almost) to yourself.", "date": "2012-07-29 16:19:20", "user": {"name": "Meredith", "review_count": 199, "yelping_since": "2011-11-06 18:11:45", "elite": "2012,2013,2014,2015", "average_stars": 3.87, "fans": 23}}
{"review_id": "3xNoI6dUJYf0xmP1DXffYQ", "user_id": "kO30XR2WeF6bla6dK1ZZLw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "Table 31 ... oh how you broke my heart.\n\nWell not really ... but it was still a disappointment for the GF and I.\n\nWe met after work for an early dinner. The space is beautiful. \n\nOur waiter was great - the self-professed best bartender in Philly. \n\nWe started with the massive antipasto platter for two - was decent. Wish we had gone for the cheese plate instead though. Had a good variety nonetheless. \n\nI had the ribeye - I had read previous reviews and wasn't expecting USDA Prime. However, with a price point above $30 ... you'd think the quality would be decent. \n\nHad absolutely sub-par marbling ... and the kicker ... did not realize it would be sambuca flambe style (light a glass of sambuca with a match and douse it on the meat). It's apparent why this is done - to have the alcohol drown out the quality of the meat. \n\nThe GF had the lemon pasta - was merely passable. Left unfinished - but I figured I could probably spice it up at home myself. (On another note ... we experienced torrential downpours as we were leaving ... and the leftovers were lost in the rain ... perhaps it was for the best). \n\nSeverely disappointed. I had high hopes to return ... I would only come back to try the outdoor lounge and a pizza.", "date": "2012-07-26 14:50:34", "user": {"name": "John", "review_count": 582, "yelping_since": "2011-08-11 15:46:40", "elite": "2012,2013,2014,2015,2016,2017,2018", "average_stars": 4.14, "fans": 99}}
{"review_id": "hji2X_E3EeRoNS9n51zr8Q", "user_id": "OhgN_d2-iOZjdArT0sLm4w", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "A colleague and I took a client to lunch at the outside dining area of Table 31. I can't remmeber being that dissapoited in a meal in a long time. It was terrible. I ordered their garden salad and added grilled chicken. It was the same exact salad one would get when purchasing a prepackaged salad at WAWA. At least at WAWA it is $3.99. The salad was prepackaed Dole spring mix greens, 2 cherry tomatoes, and the fake chicken cubes that you get in salads from 7 eleven or WAWA. Yes I did say fake chicken cubes. When the chicken ( I use the word chicken loosely because I am not sure it was actually real food) was added the cost was $16. Save your money and get a prepackaged salad or sandwich from 7 elaven. It's much cheaper and may even taste better.", "date": "2012-07-25 18:51:21", "user": {"name": "Damon", "review_count": 4, "yelping_since": "2012-07-25 18:49:53", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "ZM0JkB-a3Br5dHGR3PcgRw", "user_id": "mxZfJDk8_cOO19c7xiMffQ", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to Table 31 for a number of business lunches. I've always enjoyed my food, usually they have a unique and delicious soup of the day as well as some interesting salad and sandwich options. Unfortunately the last time I visited they had taken my favorite mushroom salad off the menu, so I was forced to get the arugula salad with fried goat cheese. It was almost as good, but I'm still crossing my fingers that the Insalata Funghi comes back to the menu... \n\nThe atmosphere is nice inside, and the waitstaff is always attentive. I would say that they take their time with the service which can lead to long lunches, so it's not the place to come if you're in any kind of hurry.", "date": "2012-07-10 13:43:00", "user": {"name": "Marissa", "review_count": 179, "yelping_since": "2009-09-11 17:04:21", "elite": "2010,2011,2012,2013,2014,2015", "average_stars": 3.95, "fans": 17}}
{"review_id": "-qDwC-VSuNf0_P7YMiKB3Q", "user_id": "Z2BMCXaVGqikH9Ad0DW8bg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 4, "funny": 2, "cool": 2, "text": "The moment I walk in I am called out for wearing sandals, shorts, and a button down shirt with a tie. I made a reservation but without any warning about their fascist dress code. So I apologized about my dress code and I didn't know about it. The host then proceeded to tell me that is policy of all fine dinning establishments. HAH! Did they ever live up to that...\n\nPros:\n- good desserts\n\nCons:\n- terrible wait staff and rude hostess\n- inconsistent food, the good food was great but the bad food was unreal. They can't cook duck or serve coffee hot, they don't know when you want more drinks and don't listen. \n- chipped appetizer plate on the table that we had to ask to be replaced was switched with a saucer dish\n- we were told they had run out of silverware and we were given serving spoons to eat dessert \n\nI was a bit more picky with the place than usual, had it been applebees I would have cared less. The fact that, upon entering this place, they told me they were 'fine dining' I expected them to live up to their standards...they failed to meet them. \n\nI don't care for this place and they are over priced!!!", "date": "2012-06-17 20:47:54", "user": {"name": "Omar", "review_count": 77, "yelping_since": "2012-03-23 00:44:39", "elite": "2013", "average_stars": 3.35, "fans": 2}}
{"review_id": "jKGlvZfgNW8c82dTAJ8bug", "user_id": "Cvi8nZTwDVaQkqmmgQwQMw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 1, "funny": 1, "cool": 1, "text": "This place was sooo crowded at Sips this week. Of course, that's something I expect when I go to a bar with Sips specials, but the awkward thing about Table 31 is that they just have a bunch of standing space on the Comcast Center plaza. That means that there are hundreds of people just standing around in little circles, with nowhere to sit! It feels like a summer graduation party with a lack of chairs, and your mom invited an extra 300 people.", "date": "2012-06-15 19:17:40", "user": {"name": "Diana", "review_count": 320, "yelping_since": "2010-11-04 15:16:49", "elite": "2012,2013,2014,2015,2016,2017", "average_stars": 4.05, "fans": 28}}
{"review_id": "czK0jSnLSGDIJfsBu7SkoQ", "user_id": "OZR8LkzaVYU4L7fT4BKHOw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "They were fine. the mixed drink I had was good, but the pasta was quite oily. Granted, it was pesto, but still.", "date": "2012-06-11 03:09:21", "user": {"name": "Michael", "review_count": 77, "yelping_since": "2012-01-09 03:52:24", "elite": "", "average_stars": 3.94, "fans": 3}}
{"review_id": "p48sGyzEv72hM9kuW_I35Q", "user_id": "l1gF3Y9bdVkXO6C-fgveZQ", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "This was my second trip to Philadelphia and my second time to enjoy cocktails at Table 31-Plaza Cafe.\n\nI love the bright setup they have outside!!  I haven't tried the food and the drinks are good, but honestly, I enjoy it for the ambiance.  The seats are very relaxing and on a beautiful day, I could easily drink myself into a nap!  If you are visiting Philly or live there, make sure to check it out when the weather is beautiful!!", "date": "2012-06-09 11:59:18", "user": {"name": "Caleigh", "review_count": 372, "yelping_since": "2012-01-21 02:05:33", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.99, "fans": 46}}
{"review_id": "_ZQmw1I8bCb2mKACp1kw8w", "user_id": "NrosrFhTo7Qi6WSW9O14EA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "We went there on a whim and on a Saturday night. No reservation - no wait?!? We walked in and walked directly to the dining area.  We were seated in the very center of the restaurant.  Atmosphere is typical of fine dining with nothing too spectacular. If you're on a first date and would like some quiet time-I suggest you go elsewhere. \n\nFood was good...service was...good...overall experience was good minus the mishap on our wine.\n\nAs we were seated at our table. My husband goes directly to the wine list as he always enjoys a bottle with dinner. Their \"Jr. Sommelier\" had mentioned that the restaurant was doing a special- 20% on all of their bottled wines.  My husband had decided and went for a $95 bottle. \nThe waiter came to us stating that the bottle that we had selected was no longer available and that he would substitute it with a very nice $150 bottle instead for the same amount plus the additional \n20%. \n\nThat didn't happen... At the end of our meal we had to request for the check to be adjusted and it was however not with the additional 20%. Just a bit baffled that we even had to ask-especially when it was offered to us. \n \n1 star deduction-\n\nPlease... Table 31 do yourself a favor. Have an \"efficient\" open line of communication between your waitstaff and your sommelier.  If your serving $40 steaks.... there  shouldn't be an excuse.", "date": "2012-04-27 17:50:04", "user": {"name": "Liz", "review_count": 84, "yelping_since": "2010-06-03 14:33:34", "elite": "", "average_stars": 3.36, "fans": 1}}
{"review_id": "bY9PSVMBbkc4_nME98FXTA", "user_id": "v-y1Lj13d2FUTtfDKoJWbw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "First off, I'm surprised that Table 31 has below a 3-star rating. It really wasn't that bad for me. The first time I went was a few years ago and then again in 2010. I'm just really bored right now, so I decided to write a review of my both experiences about 2  years later. So back then the service was great, the ambiance appropriate to the type of establishment. I will say, though, that they need to rebrand. They don't seem to have a niche. There is no reason for me to go back to Table 31. The food is good but not to die for.\n\nThe food was very good on both occassions. I actually had probably the juiciest piece of salmon ever there and a really tasty order of sauteed mushrooms. I guess it was my lucky night.", "date": "2012-04-08 19:56:06", "user": {"name": "Ayana", "review_count": 191, "yelping_since": "2010-09-30 20:22:12", "elite": "2012,2013,2014,2015,2016,2017", "average_stars": 3.68, "fans": 25}}
{"review_id": "og0H1McKGd-YfAWl7u7UKQ", "user_id": "XB5JXzLrUOAuwudFI2wnYg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere and location. Terrific service. The bread and olive oil is wonderful. I ordered the chopped salad which, I was told was the most popular item on the menu, but was a tad underwhelmed.", "date": "2012-03-27 14:45:36", "user": {"name": "Chris", "review_count": 10, "yelping_since": "2010-09-01 11:39:32", "elite": "", "average_stars": 4.5, "fans": 1}}
{"review_id": "XXktcwWdCHK5WCIcMNtbEg", "user_id": "6kjKZGUQ-hwTbHjhNp2Jjg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Happy hour was underwhelming.  Overpriced with chipped plastic cups.  There are cheaper and nicer options nearby.", "date": "2012-03-18 03:37:04", "user": {"name": "Emily", "review_count": 48, "yelping_since": "2011-10-17 00:37:10", "elite": "", "average_stars": 2.53, "fans": 0}}
{"review_id": "h_Wgc_YzHHW02B7cqF_YOw", "user_id": "aEHO6VeU84w45eNTBLCEzw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "I am surprised at the below 3 stars rating because I've eaten here twice and everything is very well prepared, nicely served, and delicious. However with that said, the young waiter we had seemed a little too anxious in increasing our bill with with drinks and an expensive bottle of Pelligrino that could have been drank by about 5 people. There were only two of us. We sent it back . When will center city restaurants stop gouging it's customers by serving huge bottles of expensive sparkling water? We just want a nice personal bottle of Perrier sometimes. The place is definitely worth a 3 star for sure", "date": "2012-03-13 20:39:56", "user": {"name": "Tom", "review_count": 22, "yelping_since": "2010-08-12 02:45:56", "elite": "", "average_stars": 3.5, "fans": 4}}
{"review_id": "Ip_P9qVzgoQ6mNmje8QRLQ", "user_id": "5G2IF0VIN3Brl-m45QDXsA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 2, "funny": 0, "cool": 2, "text": "Why, oh why does this place have bad ratings? Loved it.  Came here for a biz lunch and I can't wait to come back in the spring when their outdoor space is open for dining and drinking.  They bring out bread and an amazing red pepper and oil spread to start you off.  I ordered the Insalata Funghi..delicious salad that comes with a black truffle vinaigarette that is absolutely to DIE for..tomatoes, mushrooms, mixed greens and shaved parm.  In. L.O.V.E.  My dining partners got the Cobb Salad (it looked decent) and the sirloin burger with cheddar cheese and carmelized onions.  I almost climbed across the table to get a bite, but of course that's not appropriate in any case. So I refrained.  I will be back so so so soon! Only reason why this place gets 4 stars and not 5 is that it's pricey..$70+ for a 3 person lunch..plus tip.  Either way, great scene for business and/or personal dining.", "date": "2012-03-07 22:31:46", "user": {"name": "Alie", "review_count": 327, "yelping_since": "2011-12-08 22:14:07", "elite": "2012,2013", "average_stars": 3.97, "fans": 45}}
{"review_id": "1tML7iMpxNpHfGrgk5JiQQ", "user_id": "JJk49Bp27Def-IIYIwHSkw", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "My 2nd spot for dinner during restaurant week. The food was okay; my appetizer of artichoke ravioli was delicious and the homemade cookie plate was just the right amount of sweet. For my entree I chose the wild striped bass; the fish was cooked perfectly but the potatoes and asparagus could have left off the plate. I probably would not go back for dinner but I think I would check this spot out in the spring for happy hour.", "date": "2012-02-02 14:39:44", "user": {"name": "christina", "review_count": 263, "yelping_since": "2010-03-12 21:59:33", "elite": "", "average_stars": 3.44, "fans": 10}}
{"review_id": "Hvtgew_37meHy5KlHVPCRQ", "user_id": "AJ_JUiLHfk3J7sTD3wN4Qg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place was decent for lunch in town. Honestly I expected a little better, but now I know. Atmosphere was fine, although our service suffered because of how busy it was. Food was alright but nothing to write home about. Definitely better options if you're downtown.", "date": "2012-02-01 20:39:51", "user": {"name": "george", "review_count": 10, "yelping_since": "2011-10-24 12:38:48", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "5NM1Mbe4oqkMtEQOwmvtSg", "user_id": "tYe3wHZB77lCG4ThTJ3gRQ", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Plain Awful!!!! I would never come back here AGAIN!!! I had high hopes for this place because the reviews were mixed and I wanted to give this place a chance...it was a terrible experience and for the amount of money we spent this was truly and insult..Here is the run down:\n1.)  Waited 20 mins for our server, asked about the menu selection 'he responds and says 'this is an Italian restaurant\n2.)  The waiter left us and did not take our order and did not inform us that he was busy and was going to switch us to another waiter\n3.) Our new waiter came 20 mins later\n4.) Ordered our main course and it tool 40 mins for the main dishes to come\n5.) The main dishes were cold and then we called over the manager\n6.)  The manager offered to warm the food up instead of cooking us a fresh meal (We had: 2 beefs and tilapia)\n7.) We had to tell the manager we wanted fresh food, I really think the manager was drinking the alcohol at the bar\n8.) The old server was kissing our buts when we reported them\n9.) Our bill was not comped in anyway for the bad service and food we received\n10.) We requested the bill and it took is 20 mins to get the check\n11.) After we were ready to pay again the waiter was no where to be found!!!\n12.)  So we put our clothes on and proceeded downstairs, to pay (I felt like I was at an all- you- can buffet paying for my check!)\n13.) Finally was we were heading downstairs our second waiter came and cashed us out\nI will never come back!!!! This place left a bad taste in my mouth!!!", "date": "2012-01-30 15:24:24", "user": {"name": "Christina", "review_count": 256, "yelping_since": "2012-01-27 16:15:57", "elite": "2015,2016", "average_stars": 3.65, "fans": 11}}
{"review_id": "-HALNYzPQgtabgtbeL2_WQ", "user_id": "FgX-L-iA-vu6zXdcsoz6eg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went with a large group during restaurant week. The food was great for the price. I enjoyed it all. I got the salmon app (but I substituted the potato salad for just regular salad), the seared salmon, and the budino. I tried the hazelnut cake too. My main criticism is that EVERYTHING IS TOOOO OILY,BUTTERY, AND SUGARY! It is really tasty food, but I think anytime you add that much oil, butter, and sugar food HAS to be good. I actually had a coating inside my mouth I think from all the excess. That being said, I really did think my food was well cooked, especially the salmon main dish, which I would never normally get, but I wanted the barlotto and didn't want to be \"that girl\" that keeps switching the menu around. The hazelnut cake was more of a ganache on a hazelnut crust which was quite tasty. My friend's risotto was waaay to creamy and almost soup like, but again very good. I would also like to say the wait staff was very nice and I enjoyed the ambiance. We were upstairs and it was not too loud.", "date": "2012-01-28 13:06:55", "user": {"name": "Axl", "review_count": 187, "yelping_since": "2011-01-26 19:48:52", "elite": "", "average_stars": 3.43, "fans": 3}}
{"review_id": "u2O4rQJTh2-3Ils_Z364BA", "user_id": "scnmkG3c32N15HXtkAvH-Q", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Come here at night, in the dining room.  This place has an outdoor area and lounge, but the best food and service can be found right where and when it should be.\n\nUnique French dishes, staff was attentive, and the ambiance was quiet and romantic.they don't go all out on desert like some french places,but their technique with their dishes makes up for it, putting them just behind some of the high scale restaurants in Philly.  It's also not an investment of a meal.\n\nGreat food, good price, bring a date, and you'll be a happy diner.", "date": "2012-01-08 03:01:33", "user": {"name": "John", "review_count": 20, "yelping_since": "2009-02-15 14:50:06", "elite": "", "average_stars": 3.57, "fans": 2}}
{"review_id": "KLOMicZul9g3do8OYV8HWw", "user_id": "TyCZDhjgP5eNSFLnKxc86w", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Had a business dinner here last week and Table 31 was suggested for us.  After reading the reviews of other Yelpers, I was slightly concerned...but found room to joke with my boss about the \"cougar\" reputation.  We arrived and were seated right away.  First server was initially attentive and seemed to think quite a bit about himself.  He was mildly offensive as I ordered wine.  He felt the need to try to correct me on what I ordered.  I used the winery name and he told me it was different.  Little did he know I've actually been to the winery in Napa Valley and I felt pretty confident in what I was ordering.  Anyway, I had mussels for an app in white wine cream sauce that were pretty darn good.  Also had the braised beef short ribs for dinner and they were done well, tender and full of flavor.  Could have done without the dry, crispy garnish.  There was way too much and added very little to the appearance, nothing to the flavor of the dish.  Throughout the night another waitress would stop by and tend to our needs.  Very confusing as to who we were dealing with.  They had no communication as they would both come by and ask the same questions.  One good server is better than two average ones.  Overall food was pretty good, service was average at best.", "date": "2011-12-10 13:51:24", "user": {"name": "Eric", "review_count": 98, "yelping_since": "2011-03-11 16:43:22", "elite": "2012,2013", "average_stars": 3.01, "fans": 4}}
{"review_id": "OMcyN1UeepcLuGKnR3ER1g", "user_id": "sOq_0o7ybhTJH9RuX87_lg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Surprisingly good food; great happy hour prices; ridiculously loud and dark when it gets busy.", "date": "2011-12-09 02:04:28", "user": {"name": "Paul", "review_count": 528, "yelping_since": "2010-02-23 23:54:58", "elite": "2012,2013,2014,2016,2017,2018,2019,20,20,2021", "average_stars": 3.91, "fans": 22}}
{"review_id": "4EoaVa8h-3CWZ5xTN6fmYQ", "user_id": "bjaRDRmJs0cg545YHMb60g", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "On a business trip to Philly, was brought here by a local.\n\nPlace was nice, comfortable and clean.  Good start.  Hardly anyone in dining room on Thursday night at 7PM.  uh oh.\n\nMy fears were put to rest.  By the time we left they were on a wait.  Had a great beet salad and some fantastic pasta.  Tried a buddy's scallopini..pretty good.  Pretty good at that.\n\nA few desserts and a couple beers completed the trip.  Had Sly Fox on draft, along with the usual junk.  Kudos to them for realizing (sort of) that craft beer is the only segment of the market that is growing.\n\nChef came around and said hello, the sommelier was fantastic, the server was smart, quick and funny.  I didn't have to pay.\n\nNothing really wrong with this visit, other than some disrepair in the restroom.  I would definitely go back.  Saw a few seafood items go out that looked great.  Hopefully I can find someone to pay again!", "date": "2011-11-15 08:58:47", "user": {"name": "Michael", "review_count": 55, "yelping_since": "2010-08-22 22:18:20", "elite": "", "average_stars": 3.55, "fans": 1}}
{"review_id": "DYf81B4OH77gVyL7QKLRUQ", "user_id": "yayyLPZg83Zj9BWOLfMU5Q", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was there with a lady friend for a mid week lunch during the rain. \nNo one offered to take our coats or umbrellas, however all the subsequent tables after us (mostly mens) coats were removed as well as umbrellas and bags, for the money we paid, the service was poor.   The places is masculine and geared towards men!", "date": "2011-10-12 21:22:26", "user": {"name": "M.", "review_count": 5, "yelping_since": "2011-01-20 22:55:24", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "IU07zOvbGaQDqK0sbypIsw", "user_id": "quF5ORcDanGUIR5P3AsRQA", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "We went to Table 31 for drinks and some small plates on a Friday afternoon...\n\nDrinks: 3.5 stars\nThe drink menu is pretty good and cocktails are alright.  My EL FUTURO was very weak initially but the bartender made the next couple alot stiffer after they asked how I like (or disliked) the drink.  I'm not sure if the last couple were Patron as advertised because my hangover was a WELL TEQUILLA Hangover not a Patron Hangover.\n\nService: 3.0 stars\nStandard.  Nothing excellent\n\nAmbiance: 4.5 stars\nI love being able to sit outside in Downtown and people watch.  The decor is nice and the chairs are pretty comfortable.  Definitely one of the more enjoyable venues in Center City.\n\nLocation: 4.0 stars\nRight outside of the Comcast Center is a pretty great location.\n\nPrice: 3.5 stars\nFor the quality of food and drinks, Table 31 is way overpriced.  I paid more for drinks and no food at Table 31 than I did for a full 3 course meal for two at dinner. (see Valanni Review)\n\n\nOverall: 3.0 stars\nGood location and ambiance but overpriced and potentially shady on their drinks/alcohol used.  I'm not sure if the ambiance is enough to draw me back to Table 31.", "date": "2011-09-18 02:45:08", "user": {"name": "Sean", "review_count": 146, "yelping_since": "2010-01-18 02:40:58", "elite": "", "average_stars": 3.72, "fans": 4}}
{"review_id": "750gihZf20MZKBkLTaD2aQ", "user_id": "4-NM3_l9woeajDthJtZNxg", "business_id": "2BRbu3cBbH2bCgzN3DVc8w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This review is for the hostest named Zeeba. I didn't eat there! I had drinks on sips day. Despite the busied time and crowded people, she took her time and showed me where the sips was taken place. Very good service!!\n\nAdrianna Kim P.", "date": "2011-08-26 16:32:41", "user": {"name": "Kim", "review_count": 21, "yelping_since": "2011-03-11 17:58:50", "elite": "", "average_stars": 3.38, "fans": 1}}
