{"business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "name": "Two Eagles Cafe", "address": "1401 S 20th St", "city": "Philadelphia", "state": "PA", "postal_code": "19146", "latitude": 39.9340562738, "longitude": -75.1773206199, "stars": 4.5, "review_count": 60, "is_open": 1, "attributes": {"BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "BusinessAcceptsCreditCards": "True", "OutdoorSeating": "True", "WheelchairAccessible": "True", "HasTV": "True", "RestaurantsTableService": "True", "Ambience": "{u'divey': None, u'hipster': None, u'casual': None, u'touristy': None, u'trendy': True, u'intimate': None, u'romantic': None, u'classy': None, u'upscale': None}", "Alcohol": "u'none'", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': False, 'brunch': False, 'breakfast': False}", "RestaurantsTakeOut": "True", "RestaurantsDelivery": "True", "WiFi": "u'free'", "HappyHour": "False", "RestaurantsReservations": "False"}, "categories": "Breakfast & Brunch, Italian, Food, Mediterranean, Coffee & Tea, Restaurants, Cafes", "hours": {"Tuesday": "7:0-20:0", "Wednesday": "7:0-20:0", "Thursday": "7:0-20:0", "Friday": "7:0-20:0", "Saturday": "7:0-20:0", "Sunday": "7:0-20:0"}, "category_list": ["Breakfast & Brunch", "Italian", "Food", "Mediterranean", "Coffee & Tea", "Restaurants", "Cafes"], "stratification_tag": "Italian"}
{"review_id": "_42vBYstF74kA3M-2FXr0g", "user_id": "kkoCxmKyqhEPmFxny4DHrQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "Had a lovely evening as our local cafe reopened for business. Delicious chicken, with a lovely arugula salad. The salmon skin was crisped to perfection! Unpictured also would recommend the creamy chicken soup. Will definitely be back!", "date": "2021-12-04 03:19:46", "user": {"name": "Ashley", "review_count": 9, "yelping_since": "2019-03-28 15:39:08", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "zG1EYimWphN2AAtNmAa9sw", "user_id": "_V4g0SAkIcfC5vL-rrlx7g", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "Love love the Albanian shakshuka (fergese). Reminds me of home. Delicious espresso as well.", "date": "2021-11-21 18:27:57", "user": {"name": "Yona", "review_count": 61, "yelping_since": "2014-01-13 20:40:21", "elite": "", "average_stars": 4.16, "fans": 0}}
{"review_id": "IjXCqzwfQ6F80qOlJ5HKPA", "user_id": "4SeK35hInbJjO52w7gLpwQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "I love being able to walk to local spots. I passed two eagles cafe many times and decided to check it out one day. I was pleasantly surprised that they have a back area that is dog friendly, too. The service was awesome. Their coffee is good and their breakfast sandwiches may sincerely be my favorite I have ever had.", "date": "2021-09-07 16:45:33", "user": {"name": "Andrew", "review_count": 8, "yelping_since": "2021-06-01 17:55:38", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "SopepEFwlJ3BtTP3dW1PfA", "user_id": "MbSGQYmAgb5M_UF0xkosfw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 3, "cool": 4, "text": "Incredible neighborhood cafe with breakfast and lunch, and soon dinner! Owners are very nice.\n\nThey serve all the standard breakfast dishes, but also have smoothies and avocado toast. However a hidden must is the spinach and feta pie. \n\nThe back patio is well lit and covered! Super cute.", "date": "2021-09-01 12:30:57", "user": {"name": "Nancy", "review_count": 96, "yelping_since": "2011-02-06 04:30:42", "elite": "2019,20,20,2021", "average_stars": 4.49, "fans": 6}}
{"review_id": "o2t63EJCs21H07mPT8oC3Q", "user_id": "AYAYoJ1HXfk62DnCDe7ueQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 3, "cool": 3, "text": "Two Eagles can be found in a quieter section of Point Breeze, not found along any major roadways. So, make it a point to go over there - it's worth every second.\n\nI like the aesthetic of the location: it's small, quiet, but still has a decent amount of seating for the space it occupies. It's decorated nicely, and I enjoy staring at everything on the walls. I stopped in, ordered some avocado toast and a latte and some other small items, and was very pleased with my total cost at the end. I feel like I've made similar orders at cafes only to pay much more for what I paid for here.\n\nI've been there a few times now, and I've been greeted by a different person each time, and they're all incredibly warm and friendly. This also makes Two Eagles that much more appealing.\n\nHighly recommend.", "date": "2021-07-30 14:19:01", "user": {"name": "Mike", "review_count": 145, "yelping_since": "2015-07-23 04:37:14", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.3, "fans": 7}}
{"review_id": "9EljXWJFy6Uy00Nu7qFzzQ", "user_id": "yn0EUMUNDZGgsIS3g-l7jw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "This family-run cafe NEVER disappoints. We arrived early afternoon and were greeted with friendly smiles and great service! We sat down and was immediately offered coffee and water. The menu has so much variety with some Albanian dishes as well! I started off with a Nutella croissant (not pictured). It was flakey, warm, and fresh. The freshly baked croissant was filled with gooey Nutella and warmed up so the outer later was nice and crisp. \n\nI got the Albanian Shakshuka (pictured). It was so comforting, especially on a rainy day like today. The owner came by and offered more fresh bread for this hearty dish. The tomato stew was creamy and rich, and the fresh bread accompanying it is unbeatable. My friend got the Grilled Chicken BLT. The chicken was juicy and tender. The tomatoes and avocado were so fresh along with the brioche bun. The fries were also very crispy and flavorful. To share, we got the Two Eagles Crepe. It was a classic French crepe filled with fresh bananas, strawberries, and chocolate sauce. \n\nOverall, Two Eagles Cafe deserve more than 5 stars. If you're ever visiting Philadelphia, please visit Two Eagles Cafe for that Philly love, friendly environment, and AMAZING food!!", "date": "2021-07-03 17:06:54", "user": {"name": "Winnie", "review_count": 13, "yelping_since": "2014-07-04 02:39:11", "elite": "", "average_stars": 4.21, "fans": 1}}
{"review_id": "PNl_aIAUhtzb_s_gPMHW3Q", "user_id": "oRCYGVVt0yjTd-vvTyChhA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have ordered waffles 3x via GrubHub. \n\nEach time, the waffles have been undercooked, doughy, and cold.  \n\nI should have stopped ordering from here after the second bad experience, but I wanted to give them the benefit of the doubt.   They failed to deliver the third time, so it's three strikes and they are out.  \n\nHow hard can it be to make waffles properly?  \n\nBig disappointment.", "date": "2021-06-16 12:07:13", "user": {"name": "Warren", "review_count": 16, "yelping_since": "2012-01-12 19:44:54", "elite": "", "average_stars": 3.31, "fans": 0}}
{"review_id": "nWk7Uwr9LrRphNEvAznx0Q", "user_id": "oN_3pMGXz9xprDgFyghsrQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 2, "cool": 2, "text": "Added a great little outdoor patio area for seating! It was a lovely experience. The food was great as expected. The owners work very hard to keep their customers happy. It was pretty busy on a sunny spring Sunday morning but we weren't in a rush to go anywhere. There did seem to be some issues with the payment machine--we couldn't tip our waitress with our card receipt, but we promised her we would come back for her. Some customers seemed to get a tad agitated, but we were unbothered--this is Philly, I've seen people get mad over a lot less! \n\nI also order delivery from here when I'm feeling extra lazy (I think on Postmates). The breakfast sandwiches are simple and delightful.", "date": "2021-05-03 15:04:28", "user": {"name": "Allyson", "review_count": 68, "yelping_since": "2011-08-01 17:56:11", "elite": "2016,2017", "average_stars": 4.21, "fans": 7}}
{"review_id": "clZlYXs_M_9uqfN6SQDk_g", "user_id": "0NaHy4zIGPTtOCqAxeZlfg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 2, "cool": 2, "text": "I'm sort of a breakfast sandwich connoisseur (self-proclaimed). So it is a difficult decision for me whenever I decide to order a breakfast sandwich. My go to is a plain bagel with bacon, egg and white cheddar cheese. Let me tell you, I was NOT disappointed!!! This sandwich was delicious!!! Their coffee was also on point!!! I will be going back to this place and trying out more things in the future! My wife got a crepe and it was also delicious!", "date": "2021-03-30 17:06:40", "user": {"name": "Matt", "review_count": 39, "yelping_since": "2013-08-20 21:25:33", "elite": "2021", "average_stars": 4.08, "fans": 0}}
{"review_id": "G-zLM5r5FtPNIqM3ikAo8g", "user_id": "NKbi7deTYgLs_nENGNKk5Q", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Used to be better.I order the same thing, the polish omelette, and it was really small, very sloppily put together and super greasy. I also ordered the cinnamon bun, which they've posted looking big and delicious. Well, it's small with a dollop of icing like you would do a dollop of sour cream. Just doesn't seem like whoever is cooking cares at all about the food.", "date": "2021-02-23 14:53:41", "user": {"name": "Anyia", "review_count": 1, "yelping_since": "2019-07-07 03:28:44", "elite": "", "average_stars": 1.5, "fans": 0}}
{"review_id": "UvRyOfRaRLHLvAtFP23FIA", "user_id": "nCjfqHGabFZ9qFtwjV-JKw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 3, "text": "I ordered from here around lunch time - I ordered a farmers omelette and 2 avocado toast platters. I had to call because my friend is expecting and I had to make sure the eggs were cooked through for her. When I received my order, we got this little bag! It honestly made our day!! Thank you so much!", "date": "2021-02-07 19:03:22", "user": {"name": "Taylor", "review_count": 1, "yelping_since": "2021-02-07 18:37:48", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "ieTRqq_BHPPcXQWJ2wslyA", "user_id": "eLBZxhUYkURyIO3I73_wWg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Made an order via grub hub. Two orders  of chicken and waffles. Both waffles were burnt and salty from the butter or non stick spray Im guessing. Chicken was just a basic chicken tender. Also ordered a cinnamon bun. Orders looked good on yelp but the food is extremely basic. Could've made a better waffle myself.  Maybe dinner is better.", "date": "2021-01-30 17:13:08", "user": {"name": "Vanessa", "review_count": 8, "yelping_since": "2017-04-02 15:43:26", "elite": "", "average_stars": 3.75, "fans": 0}}
{"review_id": "liXcbwY7lrgY4yRCTBc5Ng", "user_id": "vxhHY3CxGFu2_hr63-dPMw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 3, "text": "Two Eagles is my go-to spot for morning coffee. Family run business with kind and attentive staff. I really like their breakfast sandwich but they also have more elaborate, bigger meals. Always feels welcoming. They also stock to-go items if you're in a hurry.", "date": "2020-12-04 00:42:17", "user": {"name": "Sonia", "review_count": 9, "yelping_since": "2013-11-27 17:18:37", "elite": "", "average_stars": 4.82, "fans": 0}}
{"review_id": "RaEWN_fuCrMYNE6_Uz1xhg", "user_id": "oRCYGVVt0yjTd-vvTyChhA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have ordered from Two Eagles Cafe 3x, all via GrubHub. \n\nEach time, I ordered waffles. \n\nFor whatever reason, they can't seem to do their waffles correctly. \n\nWaffles are easy to make, yet mine were always doughy and undercooked each time.  I have always asked for extra syrup, which they never include.  Come on, folks.  This is an easy one.  \n\nI never like to write a negative review based upon one bad experience, but after giving them a chance 3x, and they botched each time, I will find another place.", "date": "2020-11-11 13:06:29", "user": {"name": "Warren", "review_count": 16, "yelping_since": "2012-01-12 19:44:54", "elite": "", "average_stars": 3.31, "fans": 0}}
{"review_id": "KZhpIN0e-d1eIFp46qejDA", "user_id": "Y_PEkVJ4Rutlzr9-tBXqzQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 4, "funny": 4, "cool": 2, "text": "Like any city on the food up and up, the art of a perfect french toast, made with great bread, dipped in fresh egg and milk, grilled to perfection with a light dusting of powdered sugar, has all been replaced with \"hipster\" or \"craft\" creations. \n\nI'm not looking down at the stuffed, decorated and decked out french toast joints in Philly (especially bc I'm a sucker for all of them!). Two Eagles, however, excels in that beautifully simple french toast. With a side of the platonically ideal bacon (crisped on the griddle), this breakfast will remind you of a simpler time. \n\nOh and everything else on the menu is fucking fantastic as well. That's all!", "date": "2020-10-30 00:28:10", "user": {"name": "Hee", "review_count": 68, "yelping_since": "2010-11-10 23:19:08", "elite": "", "average_stars": 3.83, "fans": 16}}
{"review_id": "GkB9XXi49l3c4iditI7lVg", "user_id": "693jtVYzvhwbATcoGxTgaw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 4, "funny": 3, "cool": 3, "text": "Had to update my review, because it feels like we have been trying breakfast sandwiches from ALL over Philly (and elsewhere!), and NOTHING compares to Two Eagles! Order the egg, cheese & sausage on a croissant (with french fries on the side if you are super hungry), and you will not be disappointed. Every single ingredient is perfect - the eggs are fluffy, croissant is fresh, sausage is tasty... and their fries are YUMMY. We usually get two breakfasts out of a single sandwich (plus, we can't forego their fries!). Delivery is fast and they offer it through lots of sites.", "date": "2020-10-22 15:47:51", "user": {"name": "Cat", "review_count": 208, "yelping_since": "2010-11-04 01:28:08", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.95, "fans": 14}}
{"review_id": "l81YJLRL7ajWvTV_WoUyXA", "user_id": "pCngvlhGPn55KqksAjUjnA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 4, "funny": 2, "cool": 3, "text": "Very friendly service! Visiting from NY and really enjoyed our breakfast. I loved how the spinach and feta pie was flaky and doughy at the same time. Our crepe was exceptional as well!", "date": "2020-10-12 00:31:15", "user": {"name": "Gianna", "review_count": 16, "yelping_since": "2017-11-26 00:10:52", "elite": "", "average_stars": 4.81, "fans": 0}}
{"review_id": "29k2cyyYT35Ov7mUb_qd9w", "user_id": "VSnYKFLUVITzQZMnKoysjQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 1, "text": "I have never written a review before, let alone a bad one. I received my meal and after two bites I thought I chipped my tooth. It was BROKEN GLASS. Glass was in my crepes and I broke it in my mouth. Called the manager who apologized. Said it came from some machine in the kitchen??!!! Offered me a refund. She did that but only for one item. I called back to ask for a refund for the entire bill since I didn't eat anything since their kitchen is apparently unsafe. She said she would call me back. Never did. Will not be going back.", "date": "2020-10-08 22:48:25", "user": {"name": "Devon", "review_count": 1, "yelping_since": "2020-08-23 15:54:08", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "matzcWV6URCqEcyrcaX03Q", "user_id": "XB89RBxXvC_oLUln9wb_8A", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Today I picked up two specials for my wife and I: the Monte cristo sandwich and the tuna melt. Both sandwiches were out of this world! Two Eagles never disappoints. I would highly recommend this gem to anyone.", "date": "2020-09-15 16:38:20", "user": {"name": "Dave", "review_count": 3, "yelping_since": "2014-01-31 01:22:46", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "fCqFOoPcP7gLvKXA1uMVfQ", "user_id": "XsmB7dnwCNyQRslBEo4tQw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "I live down the street and this is MY SPOT. I refer to the owner as \"my lady\" when referring to my friends. I stop by numerous times a week to pick of coffee! EVERY option on the breakfast/lunch menu is delicious! Glad I can finally sit outside for dinner!", "date": "2020-06-19 23:09:29", "user": {"name": "Lacey", "review_count": 8, "yelping_since": "2019-09-05 03:07:46", "elite": "", "average_stars": 3.88, "fans": 0}}
{"review_id": "Pnz5TZ-rs5G6UHGjbelnYA", "user_id": "3_4Y3BFXlhFiCiCJZTUV2g", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 2, "cool": 2, "text": "Just picked up for lunch we got the spinach/feta cheese pie, qofte, and pulled pork over polenta.  It was delicious.  The cheese pie was crispy with warm cheesy/spinach inside.  The qofte was so tasty, meat was juicy in a marinara type sauce with mixed veggies.  Very tasty - fries were crispy and thin.  The pulled pork was well seasoned over perfectly cheesy and smooth polenta.  With a runny egg in the middle to provide a little extra flavor.  Price is super affordable and my wife and I will be adding two Eagles cafe to our restaurant list that we will visit frequently.  Can't wait to have their brunch sometime soon!  \n\nIf in point breeze stop by and check it out!", "date": "2020-06-19 18:01:40", "user": {"name": "Benjamin", "review_count": 33, "yelping_since": "2011-07-21 18:42:45", "elite": "", "average_stars": 4.42, "fans": 1}}
{"review_id": "93fJj9aNFG5umujId5EFaw", "user_id": "3_7PZNaitzannZ9B_BwWaA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 2, "cool": 3, "text": "So we're visiting from out of town and the girls wanted to get some brunch.... this place was sooo good! I got a breakfast sandwich with fries and the portion was such a nice portion. I'm taking the rest for lunch. If I lived around here, I'd def come back more often!", "date": "2020-02-22 16:59:55", "user": {"name": "Michelle", "review_count": 3, "yelping_since": "2016-02-14 20:02:13", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "Dqz0yBxgIf27qYT-ByuGNA", "user_id": "dT1uIEWvKRxBWlcWlpgwPg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "I am not from Philly, but when I am in town I stay at my friend Milk and Ron Swanson's house. They are conveniently located just 2 blocks away from this hidden gem in south philly. When I'm in town, dinner is already a given, it's sush night. But breakfast is always two eagles. The first time I had Two Eagles we got breakfast sandwiches and potatoes cooked just right. I am trying to show my 2 friends that there menu does not end at breakfast, but one of them stick's to milk based products for survival. The other friend sticks to foods that can be put in a blender, he always says if I can't blend it - forget it. I highly recommend 2 eagles when in south philly.", "date": "2020-01-29 13:34:57", "user": {"name": "Gerard", "review_count": 1, "yelping_since": "2019-10-07 22:49:16", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "9XDUJKA-d15SrAdRw68alg", "user_id": "4pyRgTN6CzMWl2oUa3hJyA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "Awesome spot.  Unassuming on outside very nice atmosphere inside.  Avocado toast was on point.  Excellent service, definitely coming back!!!", "date": "2019-11-17 17:57:19", "user": {"name": "Drew", "review_count": 6, "yelping_since": "2016-10-02 06:40:54", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "KptCLrqmzN9rOBSR2BAOWA", "user_id": "4_058WGoK5N8g6xxOcpufw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "My friends and I came here in a group of 10 for brunch and were so impressed by the quality of the food and service. The staff was incredibly welcoming and made us feel at home. Would recommend to anyone!", "date": "2019-10-05 16:39:45", "user": {"name": "Christina", "review_count": 1, "yelping_since": "2015-07-21 12:30:04", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Ru2XYCjZYow4zFnY9a1O1A", "user_id": "693jtVYzvhwbATcoGxTgaw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 2, "text": "When you move to a new neighborhood, you can't hope for much more than finding a local cafe that serves good food at decent prices with a friendly staff. Two Eagles is that place for us! We've gotten take out coffee and breakfast sandwiches a number of times (their croissant, bacon or sausage, egg & cheese are the best!), and I recently picked up an omelette to go. The omelette was perfectly cooked, plenty of fillings, and the fries are DELICIOUS. We are really looking forward to trying their Albanian dishes, too. Plus, the hostess (owner?) is THE friendliest - we always leave smiling.", "date": "2019-08-18 19:04:23", "user": {"name": "Cat", "review_count": 208, "yelping_since": "2010-11-04 01:28:08", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.95, "fans": 14}}
{"review_id": "OLoRcwk1ef_J3IIrTKl8TQ", "user_id": "vxhHY3CxGFu2_hr63-dPMw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Two eagles cafe is the neighborhood spot Point Breeze needs. With a menu that can cater to locals and bring in people from different neighborhoods, this place is great. Run by a husband wife team, it has a family vibe while still being spacious and modern. Coffee is great, reliable breakfast sandwich, and omelettes are divine. Surprisingly, it also has a full lunch menu that could pass for linner, but I have yet to stay those items. Five-stars in my book!", "date": "2019-07-23 15:40:35", "user": {"name": "Sonia", "review_count": 9, "yelping_since": "2013-11-27 17:18:37", "elite": "", "average_stars": 4.82, "fans": 0}}
{"review_id": "BqdIWirhmrpd3toNjvPTFw", "user_id": "Oxa18NucUK_yjdND3u7jug", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "First time here with the lady. We had (1) pulled pork and polenta and (2) Fergese. Portions sizes were perfect for the price and food came out quickly (~12 min).\n\nThe staff is incredibly nice and attentive. \n\nNext time we'll have to try the pastries. They looked quite good.", "date": "2019-07-22 00:11:54", "user": {"name": "Horatio", "review_count": 13, "yelping_since": "2014-05-06 00:56:51", "elite": "", "average_stars": 4.85, "fans": 0}}
{"review_id": "7omcuZ80Lhj5wSyQHl1EtQ", "user_id": "oN_3pMGXz9xprDgFyghsrQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "This is a great little cafe that I hope will have a long stay. My husband and I came here to do a little administrative work. The WiFi wasn't so great, but can you really complain about a service you aren't paying for? \nWe ordered hot lattes at the counter and they were perfect. I also had a grab and go sandwich from the warmer. Customers came in and out throughout our visit. Some folks ordered breakfast, which looked phenomenal. I believe there is a bus stop just outside, so it's a great place to pop in for coffee and grab a breakfast sandwich while you wait for the bus. \nIn all, it is everything a cafe should be: inviting enough to stay for a bit, but no consequences if you have to rush in and out.", "date": "2019-07-17 14:49:28", "user": {"name": "Allyson", "review_count": 68, "yelping_since": "2011-08-01 17:56:11", "elite": "2016,2017", "average_stars": 4.21, "fans": 7}}
{"review_id": "ZJJCDoKv5-pgsGvL0GBblA", "user_id": "BGV-NTKrpMDhsWCWJWXWJQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "My favorite breakfast spot in South Philly to do homework on chill mornings and the coffee is so good. The prices are so affordable and I would eat here everyday if I could.", "date": "2019-07-10 16:53:05", "user": {"name": "Neta", "review_count": 2, "yelping_since": "2017-03-17 19:05:16", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "-HCUcWmu0_eVrZy1pfnmVQ", "user_id": "4C4rXT1W6KUciwknzQl-Lg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 2, "text": "Two Eagles provides the best service of any cafe I've been to in Philadelphia and the food is always amazing! Today I had the breakfast burrito on special and it was phenomenal! Crispy bacon and potatoes with scrambled eggs in a wheat tortilla with avocado on the side. I can only hope that it becomes a regular menu item! Any food you get at Two Eagles will certainly be delicious. I highly recommend making a stop here if you're in the neighborhood!", "date": "2019-07-06 16:50:10", "user": {"name": "Maryann", "review_count": 3, "yelping_since": "2018-09-05 00:19:22", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "PcGSMoV2wysOEpmXTwnyYw", "user_id": "cMEt11P8N1nnpy9wdyeCcA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "We love coming to Two Eagles Cafe! Wonderful food, fantastic lattes and the owners are always so welcoming! Also, the layout and interior are so beautifully designed. They also have a large outdoor patio to relax on. Perfect addition to the Point Breeze neighborhood!", "date": "2019-06-28 11:52:06", "user": {"name": "Lindsey", "review_count": 17, "yelping_since": "2017-02-20 21:51:52", "elite": "", "average_stars": 4.11, "fans": 1}}
{"review_id": "Pu6R8dDrZzwLgsZP7-bVXQ", "user_id": "1YOZZe2ZqMoe1bi-nzN12A", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Great neighborhood breakfast/lunch place!! Beautiful interior, friendly staff, fresh clean tasty food, very reasonably priced run by an Albanian family! They make sure to do everything to perfection!! Must check it out!!", "date": "2019-05-06 00:20:19", "user": {"name": "Jenny", "review_count": 9, "yelping_since": "2015-03-05 01:10:29", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "GZHVtLsPWjvt7oK5kXSgzQ", "user_id": "n3tVqolWKiry6257xAxjBw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "This is a great place for breakfast and lunch. The food is so good and the owners are super friendly. It's nice to go to place that's not a chain and supports the local community.", "date": "2019-04-29 14:28:01", "user": {"name": "Hayley", "review_count": 6, "yelping_since": "2012-05-24 01:19:27", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "w5bMiVHLZa8xtK0L1gdmtQ", "user_id": "-uMz4Oh6diI5PKf69_NKiQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "A wonderful little cafe! Great food, great coffee, and amazing service. The atmosphere is welcoming with a touch of personality :-) affordable and quality.", "date": "2019-03-19 16:03:23", "user": {"name": "Isabelle", "review_count": 1, "yelping_since": "2019-03-19 16:03:20", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "MXDeiWdSzB5I4b-SGj7DLg", "user_id": "3QnoTcrxuafMCoTzW_AH7A", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 4.0, "useful": 25, "funny": 13, "cool": 26, "text": "I really enjoyed our recent big family brunch at Two Eagles, the newest casual breakfast and lunch spot in Point Breeze. \n\nHubs and I decided to share one of their signature Albanian dishes, the fergese, which is very similar to shashuka. It was perfectly smokey, filled with generous amounts of diced peppers and topped classically with large cheese shavings and a fried egg. It had really great flavor and was accompanied with toast to soak up that deep tomato sauce that was really so delicious! A winning dish for sure! I enjoyed experiencing another region of the world's take on a plate I enjoy so much in places like Israel and Morocco! \n\nThe rest of the fam indulged in breakfast Sammies, creating their own omelets with a variety of fresh ingredients, sweet delicate crepes filled with Nutella, bananas and strawberries, sides of crispy fried potatoes and tender sausage. \n\nWe picked up some fresh OJ and Perrier from the self-serve fridge case, along with ordering various simple cafe offerings like teas (a fruity herbal and English Breakfast black) and Americanos.\n\n Everything was really well liked by all and the prices were astonishing low! MAJOR points for being able to reserved a table for brunch in the city, too! Unheard of these days and I highly recommend doing so if you'll have a larger party like we did, as the corner place is on the smaller side. \n\nThe issue we had here was the wait for our food, which I believe was only for the laborious egg dish from their culture. Next time I would definitely ask for items to be brought out as they're ready and safely assumed I'll be waiting longer when ordering the fregese. You should too, as I noticed others around us who also ordered that dish were waiting. \n\nI would definitely hit up this uber casual spot again, keeping in mind the wait for the fergese, but it was pretty memorable and in my opinion, worth it! \n\nUnmetered street parking.", "date": "2019-03-16 12:22:35", "user": {"name": "Sari Marissa", "review_count": 1403, "yelping_since": "2009-09-01 22:27:07", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.37, "fans": 646}}
{"review_id": "IuGb7VsaYDRgZW00nDIulA", "user_id": "5gl1TD3iMWzXVf_aJ56l_w", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 2, "text": "Love this place.  The food and coffee are excellent, the atmosphere is relaxing and clean, and the servers are always friendly.  This is my go-to place for when I eat breakfast in the neighborhood.", "date": "2019-03-07 16:44:22", "user": {"name": "Hitplay", "review_count": 30, "yelping_since": "2011-06-09 15:06:56", "elite": "", "average_stars": 3.87, "fans": 0}}
{"review_id": "J0ib_T4lgTlj42RO7PJTyA", "user_id": "RI_qRD77il5L5erVwbaR2g", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Such a great neighborhood find! Both lunch and breakfast dishes are great, very fresh ingredients, and cooked to perfection. I've never had Albanian food before and this was a great first try. I had the Fergese and it was AMAZING! Also had one of their coffee drinks (Americano) and it was on par with Starbucks. Can't wait to go back and so happy to have somewhere that rivals Green Eggs Cafe (with an Albanian twist!) so close :)", "date": "2019-03-07 00:23:56", "user": {"name": "David", "review_count": 4, "yelping_since": "2011-11-22 15:31:52", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "Mulqg_u8Z6M73V4jVoqT_w", "user_id": "DNCDgtsmHyELnXA2pe7IeQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "One of my new favorite spots in the neighborhood! The french fries are easily the best around and the meatballs are extremely good! The owners are really nice and I'm so excited about the outdoor seating!", "date": "2019-02-22 19:50:41", "user": {"name": "James", "review_count": 24, "yelping_since": "2012-06-25 00:17:52", "elite": "", "average_stars": 4.37, "fans": 1}}
{"review_id": "pBHV2Mu1xNvarsJyP7REtg", "user_id": "CahquWaZCfxu7HSB6DLdNg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "It's right around the corner from my sisters place! Service is always good! Owners are super nice! The Lady Owner knows my order now Love everything I've tried so far!! 5 stars wish I could give more! Never have to wait very long for my food! Definitely Recommend it! Food Sounds so good right now!", "date": "2019-02-20 15:47:06", "user": {"name": "Sydney", "review_count": 11, "yelping_since": "2018-05-04 13:35:07", "elite": "", "average_stars": 4.58, "fans": 0}}
{"review_id": "KDWVxmLom9gXwtPt1yd-rg", "user_id": "WzhoLpHMXI59ETuQ2sRVeQ", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 3.0, "useful": 7, "funny": 3, "cool": 3, "text": "The prices are right, the atmosphere is great and access to Publix transportation is readily available. Before I get to the food this is a well designed café nicely thought out, very clean and neat. The neighborhood patrons are very friendly, I had a very nice and long discussion while sharing a table with the writer 'J', he was rather interesting. While will we talked the owners wife came to each table to ensure we were enjoying our meal, if we needed anything additional.\n\nThe food is sold at a great price it's fairly decent just not great it's good enough especially for the price and the portions you receive. Cubed potatoes are not home fries and the bacon was slightly undercooked but it was very meaty. Another drawback is when you order pancakes they are already served with syrup poured over them, with no additional syrup on the table. Additionally this syrup did not remotely attempt to have the taste of maple this was pure fructose syrup. I mean no flavor at all just slightly a sticky feel.\n\nI really wanted to love this place but 'kinda like' will have to do.", "date": "2019-02-18 02:55:34", "user": {"name": "Leah", "review_count": 638, "yelping_since": "2011-09-25 03:13:03", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.48, "fans": 66}}
{"review_id": "ysmVHX2xIlZnZ8xWp1uYPg", "user_id": "F_VYQN_woZfnWQwuK-eNNg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "I like the cozy home-y ambience of this place. It appears to be a family run business. That being said, I deducted a star since the service could have been more expedient and fluid. Espresso drinks are okay, not exceptional, nothing bad. I would try the pulled pork over the polenta if you're looking for a unique dish you can't get anywhere. The overall ambience is relaxing and delightful, with mostly wooden furniture and accents. Music is upbeat but at a moderate, enjoyable level.", "date": "2019-01-26 18:03:42", "user": {"name": "Felise", "review_count": 8, "yelping_since": "2016-09-10 16:44:11", "elite": "", "average_stars": 4.63, "fans": 0}}
{"review_id": "dSaRGJW5N-yIeTGB7CdnyQ", "user_id": "dOFrTw_un5lk3P6P3xevJA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "This place is a gem, and I'm beyond delighted to have them in the neighborhood. I stopped by today for the first time and ordered their pulled pork over polenta to go, expecting it to be solid but nothing out of the ordinary, especially considering the low price-point (just $9). It was honestly some of the best polenta I've ever had... not at all heavy, perfectly seasoned, and with just a slight tang from what I assume was goat cheese. The pulled pork was great too, but I'd bathe in that polenta. I can't recommend it highly enough, and I'm looking forward to going back and exploring their menu more. \n\nOn top of that, the folks at the counter were friendly, welcoming, and gave me a free sample of some really moist and delicious cake. Welcome to the neighborhood, Two Eagles!", "date": "2019-01-18 18:37:29", "user": {"name": "Elowyn", "review_count": 14, "yelping_since": "2014-07-13 02:49:02", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "HHRuDQrgPz65PC-5QkcC5Q", "user_id": "8EMU7d4pCkdqUnvlIW40CA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 12, "funny": 6, "cool": 10, "text": "Well the eagle has landed - actually Two Eagles have landed.  This Albanian-American café is one of the newest additions to the Point Breeze eatery scene.  It serves all the standards for a good American breakfast or brunch.  Plus it has a couple Albanian dishes.  My only wish is that it had more Albanian offerings but the very friendly owners told me they were working on that.  I did enjoy a very tasty Albanian Fregese egg dish although I would have liked a little hot sauce to spice it up.  I didn't see any hot sauce on the condiment table.  I'm still rounding up to five stars because it's cool to have an Albanian restaurant in town ... and I hope someday they might offer Tave Kosi or some other tasty Albanian meals!", "date": "2018-12-17 14:40:27", "user": {"name": "Jeff", "review_count": 1387, "yelping_since": "2012-03-15 04:01:57", "elite": "2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.31, "fans": 124}}
{"review_id": "Ykt6GlhaJ_piXhje9p1Z2A", "user_id": "q--RuuHQSPxSV0JrSrCDSw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "This cafe is a very welcome addition to Point Breeze. I've enjoyed their sweet and savory crepes, and soup of the day, a hearty Albanian chicken gumbo. Good lattes, too. And very friendly owner and chef who lives in the same building. The Two Eagles isn't about sports team (although you choose to believe that, sports fans) but because the eagle is the symbol of the owner's native Albania and her adopted country, the USA. Cool, eh?", "date": "2018-12-13 00:32:12", "user": {"name": "Cathryn", "review_count": 11, "yelping_since": "2011-05-25 00:06:15", "elite": "", "average_stars": 4.17, "fans": 0}}
{"review_id": "bY3O4T3Kw7Y4QyxZ-QP_Sw", "user_id": "bdSDXHQF0LoUweNdsI9IAg", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "This is a Point Breeze gem. My first order was a customized omelette which was both delicious and affordable. Today, I came to do a little afternoon work and enjoy a Florentine crepe. The flavors were great and the ambiance is peaceful! I hesitated to write this because it might fill up more, but I would hate to see them go out of business because not enough people know how great they are! It's just down the street from OCF and has a friendly, family-oriented staff. If you want to support local business, this is your spot.", "date": "2018-12-01 20:21:15", "user": {"name": "Whitney", "review_count": 14, "yelping_since": "2013-03-05 02:15:26", "elite": "", "average_stars": 4.64, "fans": 2}}
{"review_id": "JDSiTqBoW-HioLCPR7iA-A", "user_id": "vjiKIIeIotef3JAwdHbcFA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Two Eagles is excellent.  The people are awesome. The owner came by to make sure we were enjoying our experience.  She was kind and friendly. The food's delish. I got a breakfast sandwich, and my friends got a burger, Caesar salad, and crepe.  Everyone loved it.  And the atmosphere is sweet.  The decor was modern and simple.", "date": "2018-11-20 03:12:40", "user": {"name": "Krissy", "review_count": 1, "yelping_since": "2018-11-20 03:12:38", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "frSqEvkPB9UHQFXBB5LIjw", "user_id": "y2WPFSGKgR2aY36nMvVxKA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "We just ate there for the first time this morning- highly recommend!! The food was amazing and everyone there was so friendly and accommodating. Wonderful addition to the neighborhood. We will be back often!", "date": "2018-11-10 19:53:01", "user": {"name": "Erika", "review_count": 5, "yelping_since": "2010-09-17 21:42:41", "elite": "", "average_stars": 4.4, "fans": 0}}
{"review_id": "GMxTpXFLJsS3hBljk_6Vbw", "user_id": "LObJkwrrS482Yquw2gySUA", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "This is a great place.\nGood food good service.\nYou must try it out..\nBrand new business. \nThey need a support.", "date": "2018-11-08 21:03:33", "user": {"name": "Ruzhdi", "review_count": 1, "yelping_since": "2018-10-06 21:47:14", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "CzpBBXop1DPvHHWAWBe5TA", "user_id": "A5YThZ6xVSEW97bEOAtLHw", "business_id": "zDSZ1o-FYC2U7rrBg_kH7w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Loveddd the fact that I was greeted with all smiles and hellos as soon as I walked into the place! Super convenient for the on the go... the grab-N-go's were fully stocked and I was in kind of a rush so I quick grabbed a parfait and a water. Took literally less then 3 minutes for that all to happen, definitely will be returning!", "date": "2018-11-02 11:15:41", "user": {"name": "Jessica", "review_count": 13, "yelping_since": "2016-01-24 21:14:48", "elite": "", "average_stars": 4.31, "fans": 1}}
