{"business_id": "JtDZvV3HddxFnNdrwrWh7g", "name": "Ristorante Aroma", "address": "1245 3rd St", "city": "Philadelphia", "state": "PA", "postal_code": "19147", "latitude": 39.9318715007, "longitude": -75.1495001459, "stars": 4.5, "review_count": 137, "is_open": 1, "attributes": {"RestaurantsAttire": "u'dressy'", "HasTV": "False", "NoiseLevel": "u'average'", "BusinessAcceptsCreditCards": "True", "RestaurantsTableService": "True", "RestaurantsPriceRange2": "3", "RestaurantsTakeOut": "True", "Alcohol": "u'none'", "RestaurantsGoodForGroups": "True", "RestaurantsReservations": "True", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': True, 'brunch': False, 'breakfast': False}", "WiFi": "u'free'", "OutdoorSeating": "True", "GoodForKids": "False", "BikeParking": "False", "BusinessParking": "{u'valet': False, u'garage': None, u'street': True, u'lot': None, u'validated': None}", "Caters": "True", "ByAppointmentOnly": "False", "Ambience": "{u'divey': False, u'hipster': False, u'casual': None, u'touristy': False, u'trendy': True, u'intimate': None, u'romantic': None, u'classy': True, u'upscale': None}", "RestaurantsDelivery": "None"}, "categories": "Italian, Restaurants", "hours": {"Tuesday": "17:0-22:0", "Wednesday": "17:0-22:0", "Thursday": "17:0-22:0", "Friday": "17:0-23:0", "Saturday": "17:0-23:0", "Sunday": "17:0-22:0"}, "category_list": ["Italian", "Restaurants"], "stratification_tag": "Italian"}
{"review_id": "CfiKcNa0W6TRoKrMn5cufA", "user_id": "D7tKvZrrXV6u0IMPxLE01A", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Don't pass this one by! Quaint, quiet, foodie spot with personality. Premier service and dedication to the craft of providing you with a taste not to be forgotten. We will be back and often!", "date": "2021-12-15 04:22:04", "user": {"name": "Michael", "review_count": 13, "yelping_since": "2012-01-25 03:59:23", "elite": "", "average_stars": 4.69, "fans": 0}}
{"review_id": "hN7VDDam7-0dqrnJk2PcuQ", "user_id": "i8kLw9NZv7l-Iyz1Y4VMbg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Our party of 4 had dinner reservations at 6:00pm and were promptly seated when we arrived. The place was already buzzing with activity with most of the tables filled with dinner guests. The service was impeccable with our BYOB wine being uncorked, water glasses filled and a basket of fresh crusty Italian bread with dipping olive oil arriving at our table within minutes of being seated. The menu is extensive with many interesting Italian specialties. Only a seasoned chef can handle so many wonderful dishes on a daily basis! In most eateries a couple of these dishes would be offered only as the dinner special. So, we started with Polipo Fantasia which is grilled octopus with capers, puréed ceci beans and sun dried tomatoes, finished with olive oil and balsamic glaze. The octopus was grilled to perfection and the puréed chick beans was fabulous. Not a humus but a delicious dipping sauce. A second appetizer plate was Calamari Fritti which is traditional fried calamari but these were served in a sweet and spicy chili sauce. A really great mixtures of flavor between the sweet & spicy but adding to the explosion of flavor were the fried calamari. The calamari were crisp, tender and not chewy or greasy! The final appetizer plate was Antipasto which is Chef Tony's selection of an assortment of Italian specialty meats, cheese, and vegetables that included thinly sliced soppressata, salami, prosciutto, provolone, pecorino and mozzarella cheeses, pickled eggplant, roasted peppers, fresh and sundried tomatoes...yep another culinary delight! Some in our party had eaten here before and knew their go to pasta dish was Fettuccine Pugliese that's squid ink fettuccine with shrimp and crab meat, served in a cheese bowl with white wine sauce. I tried Gnocchi Mascarpone con Aragosta which is mascarpone gnocchi sautéed with lobster and typically finished with a touch of tomato and cream, but I skipped the tomato and cream and the Chef accommodated my request for an arrabiata sauce. Each gnocchi was stuffed with a dab of mascarpone and cooked to perfection! For my taste the lobster in arrabiata sauce was heaven! All four pasta plates were sparkling clean from our \"scarpetta.\" The dinner was topped off with espressos and orders of strawberry and hazelnut gelatos! This is a must discover place for the foodies of Philadelphia!", "date": "2021-11-06 12:27:37", "user": {"name": "Tony", "review_count": 59, "yelping_since": "2011-11-30 16:33:35", "elite": "", "average_stars": 3.25, "fans": 0}}
{"review_id": "EmHpPu3qaW7OgXCnwrST9w", "user_id": "qzATXHI4B34WVBRhovr8lg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "$115 of pure disappointment. We ordered the caprese salad to start, which was their special of the night. The mozzarella and tomato were flavorless. If you've ever had fresh mozzarella, and I'm talking FRESH, the taste is a creamy melt in your mouth goodness. This was not it. We ordered another special of the night that was even worse than our starter; the veal was gray, slathered with a white gelatinous sauce--a texture that suggested the sauce might have been canned. We also ordered the Antonio pizza, which is topped with prosciutto, arugula, and oil. It was the driest pizza I've ever eaten. Giving them one last shot, we ordered the pistachio cake for dessert. The pistachio cake seemed to be an angel-like cake with cannoli filling. On brand with the rest of our meal, the pistachio cake left more to be desired; it simply lacked flavor. The only thing we enjoyed was the wine we brought with us.", "date": "2021-10-17 20:32:24", "user": {"name": "Sabrina", "review_count": 13, "yelping_since": "2015-01-10 06:23:34", "elite": "", "average_stars": 3.92, "fans": 0}}
{"review_id": "yQ_-hF_ApTgkUHVWJRloKA", "user_id": "dhGD0Km7yI62bPYrCGVbSg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "We loved this place when it was on Pine. Fantastic food, perfect service, and great ambience. \nNow? Meh. The food is still good, but the decor in the new place is sub-par, and there is zero atmosphere. The service was good, considering how busy they were on a recent Friday night. \nThe biggest issue? The NOISE. I'm not one to usually complain about the noise level in a bust restaurant, but this was OFF the charts. So noisy that I fear for the hearing of the wait staff. This place needs to pay some serious attention to noise mitigation measures. It's that bad.", "date": "2021-10-10 14:16:11", "user": {"name": "Susan", "review_count": 27, "yelping_since": "2014-11-09 19:20:19", "elite": "", "average_stars": 3.85, "fans": 0}}
{"review_id": "hA9leCxifblOOXJ9Qv-zOg", "user_id": "Lb-0y35-vafOkfd9YBWXLA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 5, "funny": 1, "cool": 8, "text": "The new location of this phenomenal Italian restaurant. Fresh pasta, brick oven specialties, and so much more! The service is outstanding. Nico is fantastic as a waiter. Chef Tony brings his talents to every dish. Nothing is bad, and to make it better...BYOB!!!", "date": "2021-10-10 00:14:22", "user": {"name": "Steve", "review_count": 467, "yelping_since": "2013-03-30 22:07:05", "elite": "", "average_stars": 3.96, "fans": 39}}
{"review_id": "k24Lg4Sfonk9CoB82Cl2fw", "user_id": "vFkPaed50YdcgYdBbtRfbA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Rude servers, small portions, over priced, extra charge to use cc, if that is what you like, go here. Otherwise, many much better options in Philly .", "date": "2021-08-01 02:23:19", "user": {"name": "Ed", "review_count": 1, "yelping_since": "2019-02-23 00:49:37", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "_5D34ecSHTpaBIkywnPnfg", "user_id": "-sqSE7B2LoPNRW2PEJ0nlw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing meal last night at aroma. I'd passed this restaurant a bunch of times on my commute but it wasn't until an act of kindness occurred between myself and the staff that I was lured in.\nThe food is really out of this world. Def my favorite place in Philadelphia for Italian. The flavors are unbelievable. \nAnd don't skip on dessert. I don't care how full I am, I am absolutely going to get their espresso chocolate pastry with ice cream. Idk what the actual name is but it is sooooo worth feeling uncomfortably full every time. :)", "date": "2021-07-14 17:11:33", "user": {"name": "Jane", "review_count": 16, "yelping_since": "2015-06-18 23:09:31", "elite": "", "average_stars": 2.72, "fans": 0}}
{"review_id": "h1f5bfNG4ZIxsn_VV9aNJw", "user_id": "2s4NXgu_edC7jXa_Kyl21A", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Our group went here during restaurant week and had a really wonderful experience! The waiter was fun and engaging and the food was great! Also love that it is BYOB. Definitely will return to check out their regular menu!", "date": "2021-07-02 16:51:33", "user": {"name": "Megan", "review_count": 186, "yelping_since": "2017-02-19 20:46:50", "elite": "2019,20,20,2021", "average_stars": 3.66, "fans": 2}}
{"review_id": "vdAFjZ17z90563FXJdnYIQ", "user_id": "mJ6yNAm5x5-lyW7mkHmNFg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 3.0, "useful": 1, "funny": 1, "cool": 1, "text": "This place used to be delicious, but I'm not sure if there's a new chef, but I went this weekend and it was such a disappointment. The eggplant was burnt, the salad didn't taste fresh and the bread was on the stale side. I don't know if the night I went something was off, but it was definitely a huge difference from how I remember the food being.", "date": "2021-06-07 01:28:42", "user": {"name": "Abby", "review_count": 204, "yelping_since": "2010-10-16 17:49:11", "elite": "20,20,2021", "average_stars": 3.72, "fans": 0}}
{"review_id": "_lAM1w-OxCuuB7pKrX-3eg", "user_id": "ToF1FkCN5kFo4nS4XT6TLg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wonderful and consistent sumptuous dishes come out of this kitchen. We had a wonderful night of appetizers and entrees, perfectly seasoned and unique enough to make this restaurant stand out. Top caliber.", "date": "2021-05-19 01:23:30", "user": {"name": "Henry", "review_count": 17, "yelping_since": "2009-09-21 00:34:01", "elite": "", "average_stars": 4.47, "fans": 1}}
{"review_id": "hW-9QI05P_91HAd78VQrOw", "user_id": "UGSk96H0yyKas_IXjf2eQA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this spot and our waiter Julio is always hilarious, makes the meal incredibly fun and the food is perfect every time. The melanzane involtini is to die for I highly recommend it as an appetizer.", "date": "2021-04-25 00:27:23", "user": {"name": "Jenny", "review_count": 3, "yelping_since": "2016-08-04 21:05:57", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "UlalJRBO-ibvcrOtFOXY-Q", "user_id": "KHkSPz6gsV8cKAOJnhArVQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "Found this little treasure on a walk around the Italian market district of Philly!  In time for an early dinner and they were able to\nSeat a big group! Dominic the waiter= amazing! The best customer service ever!  You can't go\nWrong with the pasta and sauce (or gravy) as they call it! Garlic bread so delicious! I think we ordered everything on the menu! Old style homemade goodness!  And the Balls- the meatballs- as big as your head! So gooood!!", "date": "2021-04-22 19:47:22", "user": {"name": "Leeza", "review_count": 59, "yelping_since": "2013-12-01 20:41:15", "elite": "20,20,2021", "average_stars": 4.1, "fans": 3}}
{"review_id": "jBJN7d2dsawy6EePSFk4pA", "user_id": "Q-Q2RYv-dVH_qGFHjKGmFg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Delicious food and great service! The staff was so friendly and the ambiance was fabulous", "date": "2021-04-17 14:07:48", "user": {"name": "Stephanie", "review_count": 6, "yelping_since": "2017-05-20 19:21:17", "elite": "", "average_stars": 3.86, "fans": 0}}
{"review_id": "TYC-AgJaV-gDN6p3WhHKlg", "user_id": "FP11ku7OguY5tJsebFBc5w", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Tony, it's been awhile since my wife and I dined at your restaurant, wow we've really been missing out, we will be back much more often. Our dinners the Gnocchi and the Vitello Abbruzzese were EXCELLENT!!! Besides from the large portions, the taste was incredible. Thank you for stopping over to say hello. it's always a pleasure to see you and talk. \nLooking forward to our next meal there, soon!!!\nBest Regards and Stay Healthy,\nNeal and Maryann Rubin", "date": "2021-03-07 22:38:48", "user": {"name": "n", "review_count": 7, "yelping_since": "2011-09-21 00:16:32", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Nll-WS_yW1U0jsSPWl6XIw", "user_id": "lU9v6r4bo6nh1i5z4Z-BDg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 2, "funny": 0, "cool": 2, "text": "Very cute little place for date nights. Food was absolutely delicious. Portions for apps are a little small but that's ok. It's BYOB and I love BYOB. I would definitely come back again.", "date": "2021-02-24 13:52:40", "user": {"name": "Rula", "review_count": 420, "yelping_since": "2013-06-19 04:08:03", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.24, "fans": 37}}
{"review_id": "Z51-bwevCkFQlxtXS1sCMA", "user_id": "MSLrX_y9ghd1gGGyKuRXPw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been coming here for almost a year now and they never disappoint. From Devon to Chef Tony, the experience received every time is like the first time over again. In fact, I just called and asked for the dessert options for this evening, and I have never EVER had a man talk to me about desserts the way they did. If you haven't been here, you haven't lived. The quality of the service is unparalleled, as is the food!!!!!!", "date": "2020-11-21 22:18:07", "user": {"name": "Jordan", "review_count": 1, "yelping_since": "2020-11-21 22:18:05", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "xOZdXcZiPcdphSV3-79Juw", "user_id": "OTgf_lu0FMK68YUR3X_3jg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great place.   Small and intimate with an amazing staff.   I've gotten take out twice and I love Italian food and they make it right.     Great fish.", "date": "2020-11-17 03:11:44", "user": {"name": "Barbra", "review_count": 23, "yelping_since": "2020-07-15 04:35:43", "elite": "", "average_stars": 4.74, "fans": 0}}
{"review_id": "jiS7qyI3YxVAIv8scJSMMw", "user_id": "_bhygbIGZz51CPzUzKT2bA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely delicious! The food was so good I forgot to take pictures! Their red sauce is to die for, we also got a seafood pasta with squid ink lingo I with crab and shrimp that was incredible. I had a craving for veal parm and even though it wasn't on the menu they made one for me and it did not disappoint! So tender it literally fell off the bone, it cut with a butter knife. The outdoor set up was so sweet and the service was top notch! The staff made us (and my dog) feel so welcome. Amazing experience all around, will absolutely be coming back and you should 100% eat dinner here", "date": "2020-11-07 01:12:46", "user": {"name": "Mara", "review_count": 10, "yelping_since": "2016-09-21 16:21:04", "elite": "", "average_stars": 4.2, "fans": 0}}
{"review_id": "rnFLaF-Zqa3t9xPVWfB5lQ", "user_id": "yS0qfZmG3VXzOgdj-Kh6iA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Beautiful place. We were late at night almost at the closing hour but nonetheless, they invited us in. The Calamari Fritti was really good. The Tortelloni al Tartufo was delicious and although I would have liked a little bit more of a punch of flavor they were really good. The service was professional, friendly, and prompt. July 2019.", "date": "2020-10-27 03:26:16", "user": {"name": "Sandra", "review_count": 5, "yelping_since": "2018-09-17 16:53:32", "elite": "", "average_stars": 3.2, "fans": 0}}
{"review_id": "tuIksX3lM2rvIB05JnqGuw", "user_id": "a_bI4YSG4i-XlcVT1yhvdw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We are very hesitant about outdoor dining these days but decided to try Aroma because the tables looked safe and pleasant. We were very comfortable, the food was delicious, and the service was pleasant. The waiters didn't hover which is better in this environment, we felt safe and really enjoyed our night out. It is bring your own which we prefer. I highly recommend and we will go back if there is another warm enough evening.", "date": "2020-10-08 12:39:58", "user": {"name": "Louise", "review_count": 14, "yelping_since": "2015-01-11 20:01:40", "elite": "", "average_stars": 3.57, "fans": 0}}
{"review_id": "Wa8oqAy9gVoVdnKFYFsgsg", "user_id": "4nQBFlejXxqod7_VRGaXjw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Took our family to Aroma to celebrate our daughter's birthday and what a good choice we made!  Everything was wonderful from start to finish. We started with some appetizers, myself getting the special Calabrese. It was perfect.  I can not go there without getting the Cioppino, so delicious every single time. Never disappoints. Service was outstanding, especially under the current conditions. Thank you Aroma for a wonderful night!", "date": "2020-10-08 12:06:39", "user": {"name": "Donna", "review_count": 4, "yelping_since": "2019-12-15 23:57:12", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "WTfHE3pgQDVSEf-QhKBfDg", "user_id": "gGhPz-dKeT251FEExxBY7w", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I could say so many amazing things about this place! We went last week for restaurant week, and it was delicious. I am still thinking about the chocolate cake I got for dessert... Also, our waiter, Julio was the best!! Despite current circumstances, he offered us a safe and wonderful experience. We will definitely be returning!!", "date": "2020-09-23 19:58:07", "user": {"name": "Sammie", "review_count": 2, "yelping_since": "2020-01-15 20:41:29", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Un8bXABcyVJAGtZm_njJiw", "user_id": "UybCJn2ijZu59Mp3Zxrm1Q", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food. Julio was a pleasure and we felt super safe outdoor dining. Will come back!", "date": "2020-09-23 00:44:12", "user": {"name": "Sloane", "review_count": 1, "yelping_since": "2014-06-26 12:22:35", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "VjzDKpwb2067NLbmgT_rWg", "user_id": "bnLYF7_lu1pfcD623L-BRQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Julio was an absolute delight and the food was delicious. The staff was extremely accommodating and pleasant, and the establishment felt safe and clean. I can't wait to come back again!", "date": "2020-09-23 00:43:19", "user": {"name": "Brittany", "review_count": 6, "yelping_since": "2015-08-24 02:25:43", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "BCbLNScDG3QvfkPOiY7J9g", "user_id": "anA_ZREYbGYDIh1cyexXyg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing place! Loved the food and service. Very accommodating to the new Covid world too. Couldn't recommend moreZ", "date": "2020-09-04 01:17:09", "user": {"name": "Maddie", "review_count": 7, "yelping_since": "2012-09-08 19:06:56", "elite": "", "average_stars": 4.14, "fans": 0}}
{"review_id": "NRXCPAcdMC4BFKMNen6PpQ", "user_id": "zGLOqw97kcJh2-LZoa4zbQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We went to this spot for outdoor dining during COVID.  We had the caprese salad, octopus appetizer, broccoli rabe and sausage appetizer, branzino special, truffle pasta and the espresso bar dessert.  The food was amazing, and the service was phenomenal.  We will definitely be back.", "date": "2020-08-29 19:03:30", "user": {"name": "Maggie", "review_count": 6, "yelping_since": "2016-01-30 01:02:55", "elite": "", "average_stars": 4.17, "fans": 0}}
{"review_id": "NpFPunEWbpDiQICkEgDpbA", "user_id": "yBQ1VOFV6LTRzSdTJYU0Hw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am not a dessert person (or try not to be) but the lemon cake in the summer is hands down one of the best that I have ever had!!! If dining outside-the grilled octopus is a new fave and of course the caprese salad and gnocchi!", "date": "2020-08-20 11:45:03", "user": {"name": "Leyla", "review_count": 3, "yelping_since": "2018-09-24 22:42:55", "elite": "", "average_stars": 3.75, "fans": 0}}
{"review_id": "2WJn3PTRvT3L6EJ8o1FQ_Q", "user_id": "-edtYchmqsWXcatl_NjuKw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wonderful little Italian BYOB. The staff was very friendly and genuine. The food was delivered quickly and was so delicious it was devoured almost as fast. First time at Ristorante Aroma and will not be the last; definitely going to be added to the rotation and will spread the word. The food was that good. You can't beat the quality of the food for the price and a BYOB to boot. Low key one of the best Italian spots in the city.", "date": "2020-02-15 00:53:17", "user": {"name": "Michael", "review_count": 13, "yelping_since": "2013-06-17 23:29:44", "elite": "", "average_stars": 4.54, "fans": 0}}
{"review_id": "ZwtcIS2xFbNmxMgFG47u1g", "user_id": "NxI3Xy5Lj94g3CdhGL9SeQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love this place! This is my go to Italian spot in the city. The service is 5 stars, Giulio is an incredible server who is knowledgeable, attentive, and always makes dinner more enjoyable with his witticisms. I have never felt rushed here but have also never waited for my dish. Though I've tried many items on the menu and never left disappointed, I now have my favorites (app: prosciutto, meal: gnocchi marscapone, dessert: hot and cold). It's also a BYOB so you really can't beat it. I enjoy coming here for intimate meals, date nights, with friends, and have even thrown a birthday party here. They do it all and have always made sure it was an incredible experience. I can't rave about this place more. If you haven't tried this place out yet, make sure you do! It is well worth it.", "date": "2020-02-06 13:04:35", "user": {"name": "Lauren", "review_count": 11, "yelping_since": "2017-03-03 19:01:23", "elite": "", "average_stars": 3.92, "fans": 0}}
{"review_id": "-WPWNF7eJ3xq0YONFKkWvA", "user_id": "w-SQkxtXDZ48mxOC6hFnAg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The BEST Italian in Philly. A hidden gem! Giulio is knowledge, friendly and attentive. The branzino was delicious and the presentation was amazing. Do not sleep on this place!!!", "date": "2020-01-17 01:56:01", "user": {"name": "Jennifer", "review_count": 3, "yelping_since": "2015-10-17 23:44:38", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "_E4EVn6q6VoyyHnHDWoA-w", "user_id": "V0BpQWRsBKasV288vayqbA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "At Ristorante Aroma, I didn't just get a meal; I got an experience. It's rare to find a restaurant with both authentic, incredible food AND fantastic, thoughtful service. I was the first to arrive out of my party. My two friends were running 30 minutes later than our reservation, so I was nervous that, because the restaurant is pretty small, we would lose the reservation. But the host chatted with me and kept my wine glass full until they arrived. Our waiter, Julio, was so charismatic and provided great recommendations. The Melanzane Involtini (the eggplant appetizer) was absolutely delicious, and we ended up all splitting a dessert (I wish I remembered what it was called - some sort of cookie/brookie type of thing with gelato on top. I died and went to heaven). We stayed in the restaurant just chatting with the waitstaff for literally four hours. They were so kind, friendly, and genuinely just wanted us to enjoy our dinner to the max. It probably helped that one of my friends spoke Italian. This was one of my favorite, most heart-warming experiences at a restaurant to date. And for a BYOB in Philly, HIGHLY recommend. I hope to come back one day soon.", "date": "2020-01-16 16:46:03", "user": {"name": "Kristen", "review_count": 1, "yelping_since": "2020-01-16 16:45:52", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "KMOzaeTzyL36BmmyRdtjcA", "user_id": "VD7zLU349znfTsOQtIjVYw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "FANTASTIC.  That sums it up.   I'm a South Philly Italian born and raised and a hard marker when it comes to Italian restaurants.  We went there this past Saturday and it was truly a wonderful experience. The atmosphere was very cozy and intimate and the service and food were excellent.   Julio, our waiter, was great - engaging, funny, knowledgeable.  Devin, the host, was attentive and friendly.  And it's BYOB!!!  We will definitely be heading back soon.", "date": "2020-01-12 20:41:01", "user": {"name": "Ilene", "review_count": 3, "yelping_since": "2016-05-07 17:34:15", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "hxCi6AmBztx5JZQBavHTQQ", "user_id": "ws5xN4JuudHqRLYleWw_1g", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Fantastic food in a really cute atmosphere, and the fact that it's BYO is a huge plus. The gnocchi were outstanding and unlike any ive ever had (they're huge). The grilled squid was also excellent. Highly recommend coming here - it's tiny and intimate so makes for a perfect date night spot!", "date": "2019-12-02 20:39:08", "user": {"name": "Jacklin", "review_count": 236, "yelping_since": "2014-09-21 15:04:11", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.19, "fans": 30}}
{"review_id": "QRYRf2_4CEbTTv9_NQajnQ", "user_id": "_raphVZJb2s51GPw5vIDmA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing espresso cookie a la mode dessert. The wait staff calls it \"hot & cold\" dessert.  It's a must have. \"Nonna's Sunday Dinner\" is just like she used to make. This restaurant is high class all arou", "date": "2019-10-29 22:17:05", "user": {"name": "Denis", "review_count": 21, "yelping_since": "2012-12-12 20:50:01", "elite": "", "average_stars": 2.79, "fans": 1}}
{"review_id": "lMdZ0rlIQELKLcOFIziTcQ", "user_id": "89w_jo0YTnlf4dfGmRMbJg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came to Ristorante Aroma for dinner on 10/18. We had reservations for 8 pm and arrived 10 minutes early. We were seated immediately and greeted graciously at the door. We were a little skeptical how our experience would be due to the size of the restaurant, and the tight space, however at first bite of our appetizer, all doubt was gone. The calamari was delicious. Big, and plenty to share. For dinner I had the Tortelloni pasta with Mushrooms and it was delicious. Very much a comfort food because every bite was better than the first. My better half had the Gnocchi with lobster in a tomato cream and that was a close second to my pasta dish because it was equally as delicious. For dessert I had the Tiramisu and without a doubt it was one of the best I've had in Philly! Light, filling without being overwhelming and delicious. He had the Chocolate cake and ate every last bite of it, which is not common, so it must have been good. This place has us extremely impressed, and we are already planning our next date night back. I have not one bad thing to say, because from start to finish, this restaurant was on point across the board. Thanks Ristorante Aroma, we will be back soon!", "date": "2019-10-20 15:52:05", "user": {"name": "Stacie", "review_count": 2, "yelping_since": "2019-10-20 15:52:03", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "XGFKzUxfgTBmGyeQk2iSYg", "user_id": "i9pHdGTNsm-Uh8dHDwKATw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was in a wedding in August and they had their rehearsal dinner here! It was the perfect spot. They shut down the restaurant for our party. We had cocktail hour outside in the little alley way next to the restaurant and the wait staff came around with apps - cheese and rice balls! Everything was delicious. \n\nFor dinner it was like 4 courses. We had a salad and 3 different kinds of pasta, an entree, and dessert! So tasty. I loved everything.\n\nThe staff was so attentive and the service was impeccable. Very cute aesthetic. It's small and cozy. \n\nI recommend this spot for an event and I can't wait to come back try it for dinner!", "date": "2019-10-14 02:44:07", "user": {"name": "Stephanie", "review_count": 321, "yelping_since": "2015-04-21 16:07:01", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.84, "fans": 26}}
{"review_id": "67DSr9WvfRGSqQ2vJl8NYA", "user_id": "BkrymGHiC4UgJgZ3-q0wUQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Honestly, If I could give this place more than five stars, I could. Probably one of the best Italian joints in all of Philly. For any travel buffs craving Italian food, this is the place. Would definitely recommend it.", "date": "2019-10-11 22:04:25", "user": {"name": "Jeffrey", "review_count": 17, "yelping_since": "2016-06-18 00:03:05", "elite": "", "average_stars": 4.22, "fans": 0}}
{"review_id": "DSM7vTwIosR_82Plm4owpg", "user_id": "fb9eDPNW21CSbYyOfnnwIQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "Hurt a Little by Expectations\n\nCame here as a party of three. Service was great. It's obvious servers are top notch and well trained. \n\nI had heard wonderful things about this place and, after reading the reviews, I decided to give this place a shot to show off my city to an out of town friend. The food was really good but if I had to pick a handful of restaurants to show off Philly as a foodie city, I don't think this would fall into that bunch. Suffice it to say, it didn't quite blow me away. \n\nI love the BYOB, as always, and you likely won't be disappointed if you go here and, perhaps, I went on an off night, but just taper expectations a little bit upon your visit.", "date": "2019-09-29 15:33:48", "user": {"name": "Dave", "review_count": 244, "yelping_since": "2016-03-02 14:07:19", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.82, "fans": 20}}
{"review_id": "-xBV9kKxavgcX7ZAmJE0mg", "user_id": "Gfpt2PppV0m7ISq3O9FkBA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Such a cute byob! I went here with a whole group of  friends and they did a great job handling the crowd. We shared some appetizers, and the Caprese salad I had was made with fresh local tomatoes. My pasta dish was so good, but the best part was dessert--we had lemon cake and something that was a chocolate brownie-type dish that was incredible. It was a good time!", "date": "2019-09-23 17:15:51", "user": {"name": "Leah", "review_count": 225, "yelping_since": "2017-07-28 14:47:15", "elite": "2018,2019,20,20,2021", "average_stars": 4.11, "fans": 8}}
{"review_id": "HXfnPiorGysOhRcyMMYFYg", "user_id": "aFyEZ0Iv8ZaNHNULMPgOsw", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "I enjoyed my dinner at Ristorante Aroma.  The food we ordered was great!  I had the lobster gnocchi and it was amazing. The gnocchi just melted like butter in your mouth. We also ordered some appetizers and dessert.  They had an appetizer that came in a fried Parmesan cheese bowl, which was delicious.  The \"chocolate bomb\" dessert we ordered was also absolutely amazing.  I have had better tiramisu at other italian BYOB's in the city, but this chocolate dessert was one of the best things I had here.  \n\nMy only complaint was that the restaurant was actually too quiet.  It was virtually empty when we were eating there, so every time we talked it seemed like we were being extremely loud. Maybe it was because of the particular day and time we went, but it was extremely quiet. I would be interested in sitting outside here, too.", "date": "2019-09-17 20:24:05", "user": {"name": "Gloria", "review_count": 360, "yelping_since": "2011-07-24 17:12:30", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.33, "fans": 22}}
{"review_id": "PPc5RTGIjiOi_KWIcGZD6A", "user_id": "UPZuq_8dfF3RglJPVu0lvg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time here and couldn't have been more of a pleasure. Our server Giulio was warm and welcoming, and very knowledgeable about the menu, letting us know how specific dishes are made. The appetizers and pasta were delicately crafted and delicious. At Julio's recommendation, we order the baked chocolate treat (ask Giulio for the real name!), probably the best dessert I've had in Philly.", "date": "2019-09-14 02:51:15", "user": {"name": "Evan", "review_count": 2, "yelping_since": "2014-08-07 03:06:42", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "5X6irqhGf5shKx5sad8BPg", "user_id": "s5foWHnYOOOXJbX5NZhxGA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "What a fantastic experience, came in on a relatively quite night for the first time. Giulio went above and beyond to provide a wonderful experience, his warm personality made us friends by the end of dinner. The food was just delicious and really couldn't go wrong with anything on the menu as most of it is house made. Highly recommend the gnocchi with lobster and the chocolate bar dessert.  They also topped off our experience with home made limoncello on the house.", "date": "2019-09-14 02:50:24", "user": {"name": "Andrew", "review_count": 5, "yelping_since": "2019-03-02 21:54:49", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "18-fEKAsDyIqqEpkpCoLxA", "user_id": "Lb-0y35-vafOkfd9YBWXLA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Another trip to Aroma, and this time it was better than the last. The outdoor seating sent the evening and dinner over the top. The gnocchi is fabulous as well as the lamb chops, seafood, fettuccine, grilled octopus and calamari. The homemade desserts are off the charts. Plus...BYOB", "date": "2019-09-08 02:41:07", "user": {"name": "Steve", "review_count": 467, "yelping_since": "2013-03-30 22:07:05", "elite": "", "average_stars": 3.96, "fans": 39}}
{"review_id": "OF12J7ob1VJBCA2p0v03pA", "user_id": "NL0vW1RLDQoZDIvzYjhqOA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic Italian food, romantic environment, great service by Gulio, everything was perfect!!! You will not be disappointed at all!!", "date": "2019-07-24 00:49:33", "user": {"name": "Jair", "review_count": 4, "yelping_since": "2015-08-24 20:00:51", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "6ZSaK93HUAC-Kq-b969ErA", "user_id": "onNvW7aWMqxsiEBulgv1ZQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I strongly recommend having dinner at Ristorante Aroma.   The Bronzino was absolutely delicious!", "date": "2019-07-12 22:48:29", "user": {"name": "Maureen", "review_count": 2, "yelping_since": "2019-07-12 22:48:27", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "m40PO7Ub3yqvh7oAgRLY3A", "user_id": "1QvWJtLJlruX-9cYYArTGA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Incredible. Definitely expensive for pasta but this is a great cozy spot for special occasions. Literally everything is good. Bread is homemade and stellar. The gnocchi is some of the best I've had.", "date": "2019-07-08 00:49:47", "user": {"name": "Stephen", "review_count": 14, "yelping_since": "2015-06-20 20:27:14", "elite": "", "average_stars": 2.81, "fans": 0}}
{"review_id": "p8_1Nnl1gPebVuYdwF4JOA", "user_id": "Rti3kqiQj_UkKhnZ2CuVAg", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Totally BYOB, but the best BYOB place I have ever been to!  The restaurant itself is tiny, but the staff does a fantastic job of making the atmosphere feel much larger.  Everyone was courteous and offered good insight on their preferred dishes.  The appetizers and entrees are freshly made and delicious.", "date": "2019-06-27 18:12:12", "user": {"name": "Garrett", "review_count": 8, "yelping_since": "2019-06-19 21:46:08", "elite": "", "average_stars": 4.63, "fans": 0}}
{"review_id": "sh8PGxSsFe68Pn6kJ_fw1g", "user_id": "_eJ9pXiPKoObEWpI2MmlqA", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 3.0, "useful": 1, "funny": 1, "cool": 1, "text": "Atmosphere was nice. Food was ok. My wife liked her pasta with crab. The salad she ordered (I forget the name) was rather boring- lettuce and tomato and two tiny pieces of garlic bread. I loved the grilled romaine salad minus the meat but it was pricy for a small portion. The artichoke appetizer really paled in comparison to Misi in Brooklyn and, of course, the Jewish Ghetto in Rome. The eggplant appetizer had a very tasty sauce but was a bit heavy handed on the cheese.", "date": "2019-06-22 21:22:14", "user": {"name": "Marco", "review_count": 1161, "yelping_since": "2006-06-23 07:01:05", "elite": "2009,2015,2016,2017,2018,2019,20,20", "average_stars": 3.91, "fans": 45}}
{"review_id": "3tHrZpHqlBxRgY-vK9Th0w", "user_id": "e48cHbpv9uaDnt5C2PIN8w", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wow, this place is incredible! I have no idea how I've never tried this restaurant before since I've lived around the corner for years. It's the best Italian food we've had in Philly. The restaurant itself is cozy and charming, looking out onto picturesque Pine street.  Not only was the food and atmosphere A+ but the people were very friendly and made the experience great. You have to get the \"hot-cold\" dessert... it was delicious!", "date": "2019-05-11 13:59:55", "user": {"name": "Lindsay", "review_count": 5, "yelping_since": "2012-01-20 14:48:12", "elite": "", "average_stars": 3.8, "fans": 0}}
{"review_id": "0U3-RvT8KfXb5LUtqj8s-Q", "user_id": "2ISW-jNobGhASx1NgNLMHQ", "business_id": "JtDZvV3HddxFnNdrwrWh7g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Ate dinner here on Sat evening after a great day walking around the city.  5 of us had dinner and sat outside.  The ambience was phenomenal, such a quaint and cute little place.  We had Pino as our server and he was great!!  Knew the menu inside and out and answered all of our questions and gave some very good recommendations.  I had the pesto shrimp fettuccine special and was more than satisfied and other people in our party thoroughly enjoyed the gnocchi and other pasta dishes!!!  \n\nAll in all this place is a great, hidden gem in Philadelphia...we will definitely return for seconds!!", "date": "2019-04-30 18:21:24", "user": {"name": "Joe", "review_count": 10, "yelping_since": "2013-10-12 17:31:56", "elite": "", "average_stars": 4.64, "fans": 0}}
