{"business_id": "nmeGoVi_U-bbnojJsi52Aw", "name": "The Angelo Pizza", "address": "229 Market St", "city": "Philadelphia", "state": "PA", "postal_code": "19106", "latitude": 39.9502888, "longitude": -75.1446988, "stars": 4.5, "review_count": 66, "is_open": 1, "attributes": {"Ambience": "{'touristy': False, 'hipster': False, 'romantic': False, 'divey': False, 'intimate': False, 'trendy': False, 'upscale': False, 'classy': True, 'casual': False}", "RestaurantsTakeOut": "True", "OutdoorSeating": "True", "BusinessAcceptsCreditCards": "True"}, "categories": "Restaurants, Italian, Pizza", "hours": {"Wednesday": "12:0-20:0", "Thursday": "12:0-20:0", "Friday": "12:0-21:0", "Saturday": "12:0-21:0", "Sunday": "12:0-20:0"}, "category_list": ["Restaurants", "Italian", "Pizza"], "stratification_tag": "Italian"}
{"review_id": "UDkXBZCx2dQ6Q4VG84seTg", "user_id": "xBYp7tru2hAdiGAbhl2wPw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went there last week with my boyfriend. Pizza was over cooked and not very tasty. Service wasn't super friendly considering the popularity of the place. Much better pizza shops to visit in the area.", "date": "2021-12-28 04:12:28", "user": {"name": "Leanne", "review_count": 27, "yelping_since": "2020-09-06 22:17:28", "elite": "", "average_stars": 4.31, "fans": 0}}
{"review_id": "lixxkAv-i-rFTLX91-EdWg", "user_id": "szygh-WWjqe3oEsU-jVSCA", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "This is the best pizza I've ever had. I got the Big Ang. The sauce, crust, and overall flavor was out of this world. The pecorino-Romano sprinkled on top added a delicious note to each and every bite. Thanks Angelo.", "date": "2021-12-20 22:19:52", "user": {"name": "Tony", "review_count": 1, "yelping_since": "2019-06-14 23:41:52", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "sx40ZU2vOSxpoNzKEKYPoQ", "user_id": "ecKq_tO6cSuiaUw8ToLatw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a first class pizza shop.  All fresh ingredients prepared to order.  I had the Paulie - savory sauce and delicious homemade meatballs!  Great service and warm vibe.", "date": "2021-12-18 19:47:17", "user": {"name": "Tressa", "review_count": 2, "yelping_since": "2021-12-18 19:47:15", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "W28O2nxo-VGq9PtZguIawQ", "user_id": "AoH699D58jRtxKbaNw89sg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 1.0, "useful": 7, "funny": 0, "cool": 0, "text": "Every time I've tried to order there is an issue. Today took the cake. We ordered 4 pies. The charge went through and I started driving from my destination. Unbeknownst to me I received an email a few minutes later canceling my order. By the time I got there and found parking it was about 1/2 an hour. When I went inside to pick it up I was told he canceled the order. When I looked at the email it stated the order was canceled because they were too busy. The place was empty. He wasn't the least bit apologetic. I don't know how he'll stay in business treating customers this way. I will not be back.", "date": "2021-12-18 00:09:33", "user": {"name": "Liz", "review_count": 7, "yelping_since": "2012-07-24 22:55:52", "elite": "", "average_stars": 3.29, "fans": 0}}
{"review_id": "iFzwYnqq3i8wDKzKdGZzVQ", "user_id": "2ib3If5mzM_hl2gaQTRBrA", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Place is awesome. The pizza (we got the Angelo)  is solid for two people. It doesn't make you full but just enough to get a desert afterwards! There's no flap in the pizza and it only gets better after the first slice!! There's a good balance between the crunchiness and the cheese as I was satisfied with it overall. \n\nThe customer service was great and the owner knows how to run an operation. Definitely recommend for anyone from out of town or travelers who want someone more local! Can't wait to come back whenever I'm in old city.", "date": "2021-11-28 00:14:03", "user": {"name": "Jake", "review_count": 18, "yelping_since": "2021-02-16 17:59:45", "elite": "", "average_stars": 4.72, "fans": 0}}
{"review_id": "NQpFR6av_qun9KszM1KPEQ", "user_id": "QucZn5G1YS3evtICJ7GYyg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Probably close to one of the best I've had in the city.I'm a bit of a pizza snob,I can't just eat any pizza.I read reviews about this place and was walking up Market when I happy to stumble upon it. So glad I did,now I didn't get a pie with red sauce this time but it was delicious. Perfect crust.", "date": "2021-11-07 02:08:10", "user": {"name": "Joann", "review_count": 45, "yelping_since": "2017-10-20 23:16:42", "elite": "", "average_stars": 4.22, "fans": 0}}
{"review_id": "WM--EiC_qGFq53O02gnXDA", "user_id": "86Sy0lj1Cxdv3MjT0NSfmQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This pizza was tremendous. What's more, it probably had the best sauce I've ever tasted on a pie. As for the crust and cheese, the former was was thin and crispy, while the latter was fresh and plentiful. Bottom line - this pizza is straight up Fuego . Get here ASAP.", "date": "2021-10-31 15:44:31", "user": {"name": "Adam", "review_count": 72, "yelping_since": "2013-01-31 16:25:14", "elite": "", "average_stars": 4.47, "fans": 3}}
{"review_id": "w-EYZgG5IwnmxwZXKxRPrg", "user_id": "xg6DZWRwhedPYfziD0-wyw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Had high expectations coming in, definitely hit the mark. Plain cheese pizza was a great and so was the sausage. Definitely the best option around old city and worth traveling to try.", "date": "2021-10-24 22:03:52", "user": {"name": "Del", "review_count": 12, "yelping_since": "2013-10-04 18:04:02", "elite": "", "average_stars": 4.83, "fans": 0}}
{"review_id": "-cOYyYUw8ziDi7zZj7B5pA", "user_id": "FRFB9X6hEnZXkPTpbW1pcg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "The Angelo pizza is definitely a much try but I had high expectations going in to try the pizza and unfortunately it didn't live up to the hype. The regular pizza was fabulous but I just found it salty. The sauce was definitely holding it down for the pizza. I will say the ingredients were very fresh and the people were nice.", "date": "2021-10-07 21:15:19", "user": {"name": "Bharbhur", "review_count": 23, "yelping_since": "2015-06-16 18:40:00", "elite": "2021", "average_stars": 3.39, "fans": 0}}
{"review_id": "RPww-yOg6zUfATFb0VALCQ", "user_id": "WwIlbO62OBmxBCO76fKD6w", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This pizza is the best of the best and definitely recommend!! We really loved the cheese pizza and the 'not pepperoni pizza\". So good!", "date": "2021-10-04 20:01:19", "user": {"name": "Bethany", "review_count": 10, "yelping_since": "2018-12-15 02:59:05", "elite": "", "average_stars": 3.09, "fans": 0}}
{"review_id": "SJ-HhGgHTm0OlLXyX1sznQ", "user_id": "eFRUrnzN06LRwVCWtl-XnA", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Approved by New Yorkers!!! My wife is from New York and according to her, New Yorkers have high standards for their pizza. Pretty much at least 98% of Philly's pizza joints have disappointed her. Angelos is her top 3 in Philly because of their quality and affordability.", "date": "2021-10-03 01:48:56", "user": {"name": "Benson", "review_count": 13, "yelping_since": "2013-06-09 16:13:33", "elite": "", "average_stars": 3.79, "fans": 0}}
{"review_id": "i-Q3D2uv8k1F8NcRX3uHiA", "user_id": "mX3jJTgS0o5Z0iMOREZjZQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The first time I was here was when they first opened and I loved it then. So now I'm in the area again and thought.. let's check them out again to see if they've changed. Nope!! Not at all!! Wow! This is seriously incredible pizza. I have to say, it lives up to the hype. The crust is crisp. The sauce is tangy. The ratio is perfected. I tried the Angelo (the original cheese), the Paulie (meatball and fresh mozzarella) and the Aunt Rosie (white with mortadella and a pesto swirl). Each one was better than the last. Honestly could not pick a favorite. Next time I'm in Philly, I've got to try the rest.", "date": "2021-09-15 18:26:39", "user": {"name": "Jason", "review_count": 309, "yelping_since": "2010-05-18 13:55:29", "elite": "2019,20,20,2021", "average_stars": 3.77, "fans": 7}}
{"review_id": "wKwjPKoqKUxuyhGxvfZSyQ", "user_id": "sOKF6ofQa7miehGXrsu-nQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We got The Angelo. Excellent cheese pizza. Super thin and crispy. We would definitely go back.", "date": "2021-09-10 13:17:44", "user": {"name": "Nancy", "review_count": 15, "yelping_since": "2015-08-03 00:41:05", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "gSiUkGeSC1m-SyAI5fLREQ", "user_id": "97df14NGk20E-vuz7EmtKQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you love soft and doughy tomato pie don't get the Philly Pizza because you won't enjoy it. Every slice was a constant reminder I was eating Pizza without cheese.  A good tomato pie doesn't cause those feelings. \n\nHowever I will return and order the Angelo Pizza! I also like the pepper that is provided  on the side.", "date": "2021-09-03 02:39:01", "user": {"name": "Kira", "review_count": 4, "yelping_since": "2015-10-28 02:14:11", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "viIKY9IypTSB2op7qTw_Tg", "user_id": "6ojG12g0aqCsA1cPLs-4gw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love the pizza, but when I needed pizza sauce this evening for homemade pizza, I tried the recently released homemade sauce. As my pizzas cooked at home, the most heavily smell began to fill my apartment! I could not believe the wonderful difference of this sauce compared to my usual quick red sauce. I hope The Angelo Pizza continues to jar their sauce! I only wanted to avoid one extra set of dishes to clean, and what I was give was the most delicious dinner!", "date": "2021-08-27 00:59:20", "user": {"name": "Sarah", "review_count": 4, "yelping_since": "2019-02-21 15:35:21", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "DBLXFD0dBjaT1_XZvHF9XQ", "user_id": "h8dJ-6jCcobe2HMcES6TCQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "This pizza has become my number 1 quickly. I came in a couple of weeks ago and had the Not Pepperoni pizza and it was amazing. The freshness of it all is what does it. From the sauce to the fresh mozzarella it is hands down the best pizza pie! It's all made fresh while you wait.", "date": "2021-08-12 18:48:12", "user": {"name": "Temar", "review_count": 21, "yelping_since": "2015-02-06 22:56:29", "elite": "", "average_stars": 4.14, "fans": 0}}
{"review_id": "d_j8QCtysZn4CiJHSClI6A", "user_id": "I67ewZwmJ984m0t-VHV5Ng", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Reeeeeallly good! Love the names of the pizza lol. We HAD to have the cheese and the sausage. I can't say it's THE best but very good contenders. Great staff as well.", "date": "2021-07-25 21:12:39", "user": {"name": "Stefanie", "review_count": 68, "yelping_since": "2012-04-30 13:28:05", "elite": "", "average_stars": 4.01, "fans": 2}}
{"review_id": "uLRK1j8deij05pfmO5NRTQ", "user_id": "YeBYyWH5Zvp7GaRKsDe5dQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "My wife and I were in the City to go to the American Revolutionary War Museum. I had been wanting to try this place since I heard about his pizza on One Bite Pizza Reviews. He started making pizza at home for friends and was shipping them out in the mail during Covid. He opened a brick and mortar store in November 2020 but I hadn't gotten Dowtown until today. After snagging a coveted spot on 3rd street, we made our way to the shop. The location is across from Sonny's on Market. The decor and signage is great and features what you came for ......Pizza! Not just any pizza, excellent pizza!\nAngelo Pizza (Yeah, that is the owner's name) is creating artisan pies that are incredible and as advertised.\nMeeting Angelo himself, at the register, was a treat. You can tell how passionate he is about what he does in the quality of the product and how personable he is to his customers. We went with two selections...The Angelo Pizza and The Not Pepperoni Pizza. My wife is more of a purist so the Angelo was her pick. It was fantastic! Great blend of cheese, the right amount of sauce and thin, crispy crust. It is a spectacular straight up cheese pizza that will have you eating slice after slice until it is all gone! For my choice, The Not Pepperoni, there was no doubt you would never go back to pepperoni again. It was covered with soppressata and roasted red peppers. Both combine on an already perfect pie to create the right amount of spice with the cheese blend. It really is an epiphany if you have never had sopressata before on your pizza! The dough and it's perfect crust are really the flavor base that have you eating slice after slice.  One other touch with each pizza is a whole, hot cherry pepper. These add a great flavor note to the pizza as well!\nSorry if I did not take any pizza pictures! We were too busy eating it. \nDo yourself a favor, go and get this pizza. You will not be disappointed!!", "date": "2021-07-23 04:03:36", "user": {"name": "Thad", "review_count": 19, "yelping_since": "2013-06-13 18:24:32", "elite": "", "average_stars": 3.95, "fans": 1}}
{"review_id": "S8zr-Ld27-76GCzWT2MqxA", "user_id": "IofAX0OBv6bL8QmvvdIJog", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 3, "funny": 1, "cool": 0, "text": "Love The Angelo! Their social media is on point which is how I found out about this gem in Old City. They also opened during the pandemic, so extra props bc that was a brave move. Finally visited last week and have been tempted every day since to go back. My friends and I split The Angelo and the Aunt Rosie (without the meat). So delicious! Thin, crispy crust. The sauce is fresh and tangy, great sauce-to-cheese ratio. And the owner, Angelo Pizza, is awesome! Super nice, even gave us some ice pops when we were done bc it was a hot day, and ice cream recommendations nearby. Will definitely be back soon! (Honestly tempted to walk a mile and get some right now)", "date": "2021-07-08 19:15:30", "user": {"name": "Sheila", "review_count": 15, "yelping_since": "2013-04-26 00:11:58", "elite": "", "average_stars": 4.44, "fans": 1}}
{"review_id": "UdCzB8u80WXQ4CKK2XeJxQ", "user_id": "FoACrS_xWqFrvB_XfOzZ7g", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I'm new to Philly and have been in search of good pizza my first few weeks here. Angelo Pizza has been the best by far. I tried the Angelo Pizza and the Philly, the former being a plain cheese pizza and the latter being a cheese less tomato sauce pizza. They were both fantastic!\n\nFor context, I called in a to go order. Service was prompt and the food was ready just slightly earlier than I was told over the phone. All in and all a very good experience both flavor and service wise.\n\nDo yourself a favor and give this spot a try!", "date": "2021-07-07 23:15:49", "user": {"name": "Brynner", "review_count": 1, "yelping_since": "2016-06-28 17:32:43", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "CRUArYBGxQfhJdU7dPGwlQ", "user_id": "iJE3RnVcfHM3jsM4I6WFCw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 8, "funny": 1, "cool": 7, "text": "I was excited to see this new pizza place open near me. The other area pizza joints are OK, but there is room for improvement. I ordered The Paulie and the Aunt Rosie. The Paulie is a meatball pizza. The meatballs are sliced really thin. The meatball is good and the fresh mozzarella is good, but there is not enough of either. You don't taste enough of either ingredient, as compared to the sauce. The Aunt Rosie was the much better choice. It has thinly sliced mortadella, homemade pesto and fresh mozzarella. There is plenty of cheese and the mortadella is a very tasty sausage.  I will definitely go back and get it again next time.  The dough on both pizzas was outstanding. It's crisp and flop free.", "date": "2021-06-28 22:09:40", "user": {"name": "Ade", "review_count": 429, "yelping_since": "2011-04-19 20:17:24", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.76, "fans": 45}}
{"review_id": "cVvCgzTu57wc9EV7HAXPpw", "user_id": "Jz76qTC3ABltQhckezqeUg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "We stopped by at the recommendation of our walking tour guide and we were so happy we did.  For us it's all about the crust, and it was delicious. We would highly recommend.", "date": "2021-06-24 17:47:27", "user": {"name": "Diane", "review_count": 8, "yelping_since": "2015-08-31 15:16:52", "elite": "", "average_stars": 4.56, "fans": 0}}
{"review_id": "pQoLuBgh1DAxTsON_GZjUA", "user_id": "WKcKZiLYo1hRF54g5rH36w", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "Just amazing! I just moved around the corner in Old City and my boyfriend and I stopped in today for our first time and got the Paulie. We are both Italians and know our pizza (and meatballs lol) and this place really exceeded our expectations! We are so excited to be regulars since we are dangerously close and this pizza is dangerously good.\n\nAlso, when the owner saw that we were sitting outside, he ran out with some plates for us. As I've worked with small businesses before, it was awesome to sense his pride and dedication to his business-it definitely shows. So cool to see his story on Instagram and see how far his business has come in so short a time! Keep up the good work! We will be back", "date": "2021-06-17 02:41:26", "user": {"name": "Gabriella", "review_count": 15, "yelping_since": "2018-07-27 07:36:29", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "RjF0cxv8RPH5SEocMh7pJQ", "user_id": "Zuqd7dVI7WYeISj2JLAiGw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "By far the best pizza in Philadelphia! Tastes great - it's true Italian pizza. I would recommend this pizzeria to anyone visiting the area or anyone who currently lives in the area and has yet to try it out. Angelo makes you feel welcomed, and the restaurant is clean and modern.", "date": "2021-06-17 01:14:49", "user": {"name": "Chase", "review_count": 6, "yelping_since": "2016-11-25 19:51:11", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "uTx4jj8uWIlO7tGNz0rYRw", "user_id": "02wjQrfSeaj5RGm01Wgr9w", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "This place has the best pizza in the city, and  I've tried them all! Angelo the owner makes the place feel like home and you'll want to come back every night. I can't tell you what my favorite pizza is because they're all different and amazing. You can't go wrong with this choice.", "date": "2021-06-12 00:11:45", "user": {"name": "Scott", "review_count": 11, "yelping_since": "2014-12-29 16:25:18", "elite": "", "average_stars": 4.17, "fans": 0}}
{"review_id": "9agX_fsv220wHy9djotrcg", "user_id": "3ePdm81n-85NX1rux3boTQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "We are visiting from out of town and ordered the cheese pizza and the meatball pizza (I can't remember their names), but they were thin crusted and delicious. My kids have them 2 thumbs up! Both Angelo and his dad were friendly and helpful. There are a couple of tables outside and if you linger long enough, Angelo might even pop out and offer you a fizzie I think he called it? We west coasters call them otter pops. :)", "date": "2021-06-02 22:32:50", "user": {"name": "Callie", "review_count": 7, "yelping_since": "2011-06-20 21:17:38", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "xC_EqSWq5IjUJ3q1pMMY1Q", "user_id": "gfQqQYI5_hCAGEHlHXIz2Q", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 5, "funny": 1, "cool": 4, "text": "I'll admit it--we were sucked in by the marketing. Their website and Instagram game are good. We were headed out of the city to visit my mom, so we ordered four \"personal\" pies and drove to the burbs with the pizzas fresh out of the oven, piping hot.\n\nI didn't have high expectations, as I was worried they might be all flash and style without delicious pizza substance, but I was wrong. Even after the pizzas had cooled a bit on our drive out to mom's house, they were pretty darn tasty. \n\nWhen I told Mom I was bringing pizza, she said, \"I can't eat all that cheese!\" I told her there was a tomato pie in the mix, and she said, \"No cheese? That can't taste good!\" But Angelo proved her wrong. The tomato pie had a fresh tomato sauce that was bright and flavorful. (Mom also ate a cheese slice anyway and deemed it tasty.)\n\nThe Charlie Bananas, with banana peppers, was fun. Husband loved the meatball pizza, with slices of meatball to make it easy to enjoy the meat and not have the pie disintegrate under the weight of a round meatball.  We had plenty left over after four of us ate our fill. Since I love a pizza breakfast, that was fine by me. \n\nCrust was quality thin crust, just a bit crispy. We agreed that it would probably be even better fresh out of the oven and not 1/2 hour later. We'll return soon to test that theory.", "date": "2021-05-28 14:31:17", "user": {"name": "Cherie", "review_count": 2113, "yelping_since": "2005-10-02 00:49:15", "elite": "2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.81, "fans": 212}}
{"review_id": "M36oKeU2OZzFGpSB1tiSuQ", "user_id": "3AqoIequcJPA0mhZ2k4K2g", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I got the Angelo pizza (plain cheese). The sauce was delicious, the cheese to sauce ratio was great, and the crust was nice & crunchy! The pepper it was served with was a spicy and tart addition to each bite of pizza. I'm coming back ASAP!", "date": "2021-04-28 22:28:40", "user": {"name": "Jenny", "review_count": 8, "yelping_since": "2017-02-03 02:19:10", "elite": "", "average_stars": 5.0, "fans": 1}}
{"review_id": "fm2119V7BWhcpWppgGRl6Q", "user_id": "t-YONe0qg0fA3EK2chuWtQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "My friend and I split the Angelo and the Paulie and both were incredible. They both came with hot peppers which I was out on but my friend tried it and she kinda regretted it LOL. The weather was nice enough to sit outside so we brought roadies to enjoy as well (not sure if they were serious about the BYOB part but they didn't say no). To top it off, they gave us free freeze pops before we headed to the bar across the street. I'll definitely be coming back!", "date": "2021-04-28 22:09:34", "user": {"name": "Sam", "review_count": 66, "yelping_since": "2016-12-17 22:00:33", "elite": "2019,20,20,2021", "average_stars": 4.36, "fans": 4}}
{"review_id": "dQi2SiFKub1QqaW1am3dGg", "user_id": "oMcmerArbeL0OOEZVPMeuQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "So 1st things 1st the owners last name is literally Pizza! Ordered the Paulie! Pizza came out quick despite it being busy. Pizza was crisp and thin, sauce had that perfect Tang, perfect portions of cheese & meatball, place def has a few more different pizzas I can't wait to try, has outdoor and indoor seating, staff was very friendly!", "date": "2021-04-22 05:32:51", "user": {"name": "John", "review_count": 76, "yelping_since": "2012-01-17 18:27:21", "elite": "", "average_stars": 3.89, "fans": 2}}
{"review_id": "N2O96qPTF4tHqXcVv8_yfQ", "user_id": "cgB6y2F5aemLQ2LqVqgFSg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Newcomer on the block serving solely pizza. Straight out of Little Italy in Baltimore. Thus far I've had The Angelo Pizza (cheese), The Charlie Bananas (banana peppers and provolone), and The Paulie (meatball). Tasty. I would probably order one per person to be safe but could split one pie for a lighter meal or lunch. Overall, definitely a solid choice, but not the most elite in the city. I'll certainly be back.", "date": "2021-03-25 17:03:34", "user": {"name": "Gregory", "review_count": 62, "yelping_since": "2012-02-14 19:03:37", "elite": "2021", "average_stars": 4.17, "fans": 3}}
{"review_id": "UiurFXksSHrZFukD5s6BtA", "user_id": "hQSYK6SLvQyLEFbkr6PBKg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "New to the Philly pizza scene, this spot opened during the pandemic and it seems to be doing really well - and it's easy to see why.\n\nTheir pies are amazing!\n\nThe Angelo Pizza (cheese pie) - It's so heavenly, seriously! It's all in the sauce and the dough. So about the sauce - There's the tiniest hint of (heat) spice to it that is just so perfect. The crust is thin, but also soft and doughy with the right amount of crisp to it. During the week of St. Patrick's Day, they're offering a pesto drizzle on any of their pizzas which really is exquisite. I wish they made this a permanent option on their menu. \n\nThe Philly (tomato pie) is also really great and easily one of the best tomato pies I've ever had. See above comments on sauce and dough - same applies. So good! \n\nService was really awesome as well. I will definitely be back again soon!", "date": "2021-03-19 00:03:20", "user": {"name": "Sara", "review_count": 55, "yelping_since": "2018-01-05 18:02:44", "elite": "20,20,2021", "average_stars": 4.12, "fans": 6}}
{"review_id": "2zUa40uFHM5lK-FN-U6PAQ", "user_id": "dgke9NcWU6YosAMx9CAzjw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "My boyfriend and I were excited to try this place after all the great reviews and social media hype, but it didn't really live up to our expectations. We got the Angelo and the Philly (tomato pizza). The flavor was pretty good but the crust was just very floppy. Maybe it was because we called close to closing time. Great price for 2 pizzas tho.", "date": "2021-03-16 21:39:42", "user": {"name": "Selena", "review_count": 20, "yelping_since": "2019-09-08 21:18:01", "elite": "", "average_stars": 4.38, "fans": 2}}
{"review_id": "oq2UP8Ku4ovwfPXvSmmagg", "user_id": "WrLe80KxpEoV9aiZMR5fvA", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "One of the best pizza I have ever had, also meet the owner and his father both very kind and nice and the pizza is amazing you have to stop by", "date": "2021-03-05 18:12:21", "user": {"name": "Jonathan", "review_count": 52, "yelping_since": "2011-06-13 23:37:58", "elite": "", "average_stars": 4.33, "fans": 1}}
{"review_id": "u1dfKXuutaMA2_aGNCcQFA", "user_id": "_RZlbhVdOZ9cWtWf3f_leQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The menu is small and because of that the pie's are amazing!! Top notch ingredients. Well worth the trip from NJ for myself. Pizza sauce is great as is the perfection of the crust. It's only been around for a few months but hopefully it will be here forever. #dinersdriveinnsanddives", "date": "2021-03-01 21:52:34", "user": {"name": "Rob", "review_count": 10, "yelping_since": "2016-05-15 18:19:30", "elite": "", "average_stars": 4.1, "fans": 0}}
{"review_id": "YVdsNfIXAj8_Y6pJcJJpYQ", "user_id": "XD_SGGnLRR-NmdI_jjobZg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 5, "funny": 0, "cool": 4, "text": "It's nice to try a new pizza place! The Angelo Pizza hit the spot on a cool Friday in February.\n\nI came here with my coworker after reading about the opening a few weeks ago and had wanted to try them out. They only have a limited number of pizzas a day.\n\nTheir straight to the point menu has the descriptions of each pizza offered, and there's no substitutions allowed. They also only sell the pizza and drinks - nothing else. The pizzas are pretty much a personal size 12\" cut into six pieces.\n\nOur Angelo (plain cheese) and Carson (white with mushroom and onion) hit the spot. Super crunchy crust would have been better if we were allowed to eat in the small facility, but the flavors of the sauce (had some bite) and cheese were excellent. Not our favorite, but definitely not the worst. It'd be worth another trip to try some of the meat pizzas.\n\nI'm more than happy to support our local non-chain businesses.\n\nAbout $29 for the two pizzas.", "date": "2021-02-26 18:16:48", "user": {"name": "Michael", "review_count": 607, "yelping_since": "2011-10-26 12:55:21", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.0, "fans": 36}}
{"review_id": "RX_Qmkb-18D75x2PSgFUMw", "user_id": "tsrvmbkKNnuHrEdgO9nt9g", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 4, "funny": 0, "cool": 3, "text": "I have never looked forward to writing a review more than this one. I first met Angelo many years ago in the Little Italy district of Baltimore.  My wife and I got to know Angelo and his family very well. They are individuals that believe in community, family, and helping out those less fortunate. We were very excited to see the Portnoy review of Angelo's homemade pizzas, and we were equally excited to see him following his dream.\n\nWe bought about 10 frozen pizzas right after the Barstool review and could not have been happier. When we picked them up in Baltimore, Angelo made us a special pie which we shared on the street. It was, and is a great memory. So we were very happy when Angelo got the opportunity to open up his own shop in Philadelphia. Living in Boston, we really looked forward to making the trip to Philly to support our friend.\n\nWe finally had an opportunity to try Angelo's Pizza the Saturday before the Super Bowl. Though all the pizzas looked great I had to order the Pauli's, as I was really looking forward to trying the meatballs. We did order the larger size pie which was available just for the weekend. When the pizza arrived at our table, we were blown away by not only how perfectly it was cooked, but also the amazing smell. This truly was a piece of art. I could go into a great detail about all of the individual ingredients, however I will just say that the pizza was extraordinary. Every aspect was spot on and I particularly enjoyed the basil placed underneath the cheese, actually part of the sauce. I did not think Angelo could make a better pizza. It truly was on a par with some of my absolute favorites such as Di Fara, Mozza, Scarr's, and being a Boston guy, Santarpio's. Each one of those has it's own unique style, and The Angelo's Pizza, more than any of them, seems to be a reflection of Angelo himself. It was very evident that the pizza really was developed with a certain person and feeling in mind. It was almost as if each pizza is a personalized letter from Angelo.\n\nI talk about each pizza because before we left we ordered three more pizzas to take home.  After careful consideration, we ordered the Noni, the Not Pepperoni, and the Saint Antney's. These were not pizzas with just a bunch of toppings on them, rather they were pizzas developed to send a certain message and reflect something meaningful in Angelo's life. At least that was my take.  I loved each and every one of them and I could not even pick a favorite.\n\nKeep in mind, we ordered the regular size pizzas for the ones we took home. I highly recommend sticking with the smaller or regular size pizza as Angelo has fine-tuned the recipe to ensure that the smaller pizza is absolutely optimal.\n\nI don't need to go into great details on each of the pizzas, as others clearly have done that. Angelo will not create custom pies but he will remove items from each individual pie off of the original recipe. Take my advice, and have the pizzas as they were intended, they are all absolutely outstanding.\n\nThe Noni is a white pie with the sausage and broccoli rabe.  Every pizza is cooked to perfection so there is no need to go into details in that area. However the toppings,  crust, and sauce were just incredible. I absolutely loved this pizza.\n\nI am not a big sausage, pepper, and onion guy, so I did not think the Saint Antney's was going to be a real hit with me. Boy was I wrong! The entire pizza is incredibly well crafted, and just the right amount of each ingredient is put on to ensure that no one flavor dominates the pizza. It was truly outstanding.\n\nThe Not Pepperoni pizza includes soppressata and red pepper.  This is just simply a step up and elevates the pizza to another level. It is not a simple pepperoni pizza. Again the preparation, quality of the ingredients, and attention to detail adds an element that really cannot be adequately described in words.\n\nWe took these three pizzas home to Boston. Over the next three days, my wife and I finished off the three pizzas. We did share one pie with a couple friends who were just blown away by the quality of the pizza and immediately checked how long it would take to drive to Philly to get one themselves.\n\nI will be 100% transparent, I have never rooted for someone more or wanted to post a positive review more than I did for Angelo. However, I would never post something on Yelp that was not 100% true. As I stated, I would put this pizza right up there with my all-time favorites. So while I am very happy to write this review, Angelo has certainly earned it and I'm sure that he will continue to build his business and become a major success. If you want to have a pizza that truly reflects the owner and provides a personal experience, I strongly suggest you go to The  Angelo's Pizza. you will not be disappointed.", "date": "2021-02-15 03:29:27", "user": {"name": "Mark", "review_count": 158, "yelping_since": "2010-12-28 16:33:19", "elite": "2016,2017,2021", "average_stars": 4.3, "fans": 2}}
{"review_id": "CrmzXBo-qbgyY4fM5_6dLA", "user_id": "M5QAuzQB9ee0ntf9RKkx7Q", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 5, "funny": 0, "cool": 2, "text": "Recently moved nearby and walked passed here several times before finally caving in to the temptation. I got the St. Antney's, which has sausage, peppers and onions. This was made fresh upon order and arguably one of the best pizzas I've had. It's not overly greasy or heavy on the dough, yet has all the flavor. The thinner crust let's me feel slightly less guilt eating an entire pie. Will def be back to try the rest of the menu for research.", "date": "2021-02-14 21:23:43", "user": {"name": "Andrew", "review_count": 113, "yelping_since": "2014-04-02 22:38:52", "elite": "2018,2019,20,20,2021", "average_stars": 4.63, "fans": 11}}
{"review_id": "X7WyAKzdXiPRiRhreiUwjw", "user_id": "6C8Ne6yRu6TzBLbhfhdduw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 6, "funny": 0, "cool": 2, "text": "tl;dr the flavor on these personal pies is outstanding -- it very nearly outweighs the price, if not for a floppy crust in the center\n\n\"His last name is fxcking Pizza.\" With a name like that, if would seem that Angelo was destined to sling pies. At 2nd and Market, Angelo Pizza sports a slick spot on a swank street. The deep, narrow room is outfitted with black-and-white family portraits and a punk-style mural of the menu.\n\nTuesday through Thursday, Angelo offers phone-in orders. I ordered ahead, but still waited nearly 20 minutes beyond the time. But I was happy to have my piping hot pie handed to me by the Angelo Pizza, himself. I noticed that a lot of folks came in asking for a slice or to make substitutions on the pies. At Angelo, personal pies only, without additions or substitutions (although they will exclude any ingredients if you ask).\n\nI opted for The Pauli -- a pie topped with \"real nice\" meatballs. For something so simple, the pizza was also polarizing! The crust was limp in the middle, and the first few bites of each slice sagged depressingly. However, closer to the edges, the crust was surprisingly crisp and tasty. Moreover, the taste of each topping was spot on. The slightly tart sauce and herby meatball transported me back to pasta dinners of my childhood.\n\nAt $16 dollars for a 12\" pie (marginally larger than a personal pie), my wallet felt noticeably lighter after my visit. I think that the price could have been doable if Angelo had the best pizza I'd tried in Philly, but admittedly, this might not even crack my top 3. Nonetheless, I think that this is an absolutely solid addition to the pizza scene, and among the better restaurants in Old City. Next time, I'm hoping to have a crisper center to my crust, so I can bump this review up to a 5.", "date": "2021-02-10 14:57:48", "user": {"name": "Austin", "review_count": 211, "yelping_since": "2016-12-30 22:23:33", "elite": "2019,20,20,2021", "average_stars": 4.08, "fans": 25}}
{"review_id": "8FeLeBr8LDTGzu-19Jgj3A", "user_id": "sT2TPO6s6ag5UZrepnwHqg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 4, "funny": 0, "cool": 2, "text": "Let me start by saying I'm a NY Pizza Snob. I grew up eating the best NY Styled Neapolitan Pizzas from Northern NJ and the Five Boroughs.\n\nThis review is NOT about that kind of pizza - it's about something both similar and unique to my experience; this is about a tasty, texturally wonderful hybrid Neapolitan pizza made with love and skill.  This is about one of the best pizzas I've had in Philly... a pizza with character that you can't help but want to eat. I told the owner (as the world now knows, his name is literally \"Angelo Pizza\") that I was judging his pizza against not only Philly pizza but my experience tasting pizza all over the world. (I also told him if I thought it sucked, I'd tell him privately but I'd definitely tell him.)\n\nHe not only met the challenge, but he did it with the pride I'd expect from an, \"established in 1945,\" kind of place - rather than the new shop he just opened.  The sauce (made fresh daily with San Marzano tomatoes), the crust (also fresh dough) and fresh ingredients all make for a seriously good tasting, well made pizza.\n\nTry it and you'll definitely taste the difference.", "date": "2021-02-04 18:57:18", "user": {"name": "Carlos", "review_count": 12, "yelping_since": "2011-10-19 11:52:25", "elite": "", "average_stars": 4.67, "fans": 1}}
{"review_id": "h-PGjDRzc_JalraxfzDSmw", "user_id": "S1Ca1FZ5AynAgKd7nPCY1Q", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ordered the Noni. The website provides very clear instructions on how to order. When I came in the pizza was ready. Cashier was pleasant. Workers were socially distant inside. I ate a lot of sausage and broccoli rabe growing up, so eating the pizza brought back lovely childhood memories. I enjoyed the texture of the crust, and the pepper was a nice touch. If I hadn't grown up in the metro NYC area, I would have given the place 5 stars.", "date": "2021-01-23 23:36:56", "user": {"name": "Caitlin", "review_count": 13, "yelping_since": "2017-10-07 23:12:41", "elite": "", "average_stars": 4.38, "fans": 0}}
{"review_id": "wQstL4cVEmiDmlKcShkLiw", "user_id": "_pzPGi1g2hCP_dVvS0OsvQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Waited over 40 minutes for the pizza, when they told others the wait was 20 minutes. We waited in the store and ordered ONE pizza. Had to ask for our order, only for it to be on top of the oven ready to be given out. No apologies given. Not to play the racism card, however, caucasian individuals were handed their pizza, as well as asked if they wanted napkins and plates. Unacceptable. Will not return. The pizza is good, though over priced based on size.", "date": "2021-01-16 20:02:20", "user": {"name": "Christie", "review_count": 3, "yelping_since": "2016-03-26 16:26:25", "elite": "", "average_stars": 2.67, "fans": 0}}
{"review_id": "c8sW1DfdI63pJj4D4vEILA", "user_id": "Tp7OOIKbG-tYsKUKHfVHCw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Wonderful pizza spot in old city! The location is great, and the pizza is even better. My cousin and I got the Paulie and the Angelo, I would definitely say i liked the Paulie better but both were really good. I look forward to trying more!!", "date": "2021-01-07 18:51:46", "user": {"name": "CJ", "review_count": 5, "yelping_since": "2014-12-27 23:28:11", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "jj9Yzv8IftyEEc8hNcsZ7w", "user_id": "KcJyrtxdVLJnyrm4dYydwQ", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Delicious pizza! Was flavorful, nicely thin and the perfect treat for a cold January day. Really friendly staff, too!", "date": "2021-01-03 02:34:56", "user": {"name": "Tiana", "review_count": 30, "yelping_since": "2020-10-21 17:41:06", "elite": "2021", "average_stars": 4.33, "fans": 1}}
{"review_id": "UeNT_ArsficZw59JOWFGNw", "user_id": "3QnoTcrxuafMCoTzW_AH7A", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 47, "funny": 23, "cool": 39, "text": "I'm a big fan of 24 year old, Angelo Pizza (yes, that's his name! He showed me his license!) and his new pizza spot over on Market in Old City! We went in for pizza and got so much more....\n\nAngelo is a youngin' but no stranger to pizza. He grew up slinging pies in his father's  shop in Baltimore. (Yes, he's a Raven's fan, but a secondary Eagles fan so don't crucify him. He even has a lie named 'The Carson'). He came to Philly to attend St Joe's and never left. Recently, during the pandemic, he opened his fun little simple shop. The prime real estate was surprisingly very affordable because of covid.\n\nAngelo & I chatted quite a bit. We talked sports, and Portnoy, obviously. He told me where to get the best pizza in Baltimore and we bonded over both of our favorite pizza in the world (besides his), Frank Pepe's in New Haven. He's adorable, knowledgeable of his craft, and super friendly. Felt good to support him. \n\nThe traffic was steady on football Sunday and I was afraid because of their \"12 pies, strict no substitutions\" policy it would be insane to grab a pie. You know how all the best places in the city nowadays you have to jump through hoops to secure your pizza, but luckily it wasn't bad. At all! A little wait, but the convo made the time fly. \n\nWe ordered a plain that claims to be \"the best f*ckong cheese pizza\" and the 'Charlie Bananas' which \" like Charlie, (a guy from the old neighborhood as Angelo told me) this one is a hit with the ladies\". Banana peppers and sharp provolone...give me! They were both excellent! The peppers packed just the amount of punch and the sharp provolone was such an unexpected twist! The added pepper to box was a sweet touch. The sauce was a perfect balance of sweet and acidity, and although I'm not a crust gal, this was thin and very crispy! Yum!! Absolutely delish! \n\nAll and all we were very satisfied with our stop and will be back again for sure. \n\nWe would definitely recommend grabbing some! 'The Pauli' (meatball) is Angelo's favorite and I definitely want to try the white pie with mushrooms, 'The Carson' next time! \nThey ship frozen pies too.\nBest of luck, Ang! See you soon!", "date": "2020-12-29 13:05:51", "user": {"name": "Sari Marissa", "review_count": 1403, "yelping_since": "2009-09-01 22:27:07", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.37, "fans": 646}}
{"review_id": "8013aWxgyhoCPoeO_x0wLQ", "user_id": "-A7wqNBMClbU6Y8NNLdMvw", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 3, "funny": 0, "cool": 2, "text": "When I stepped into this mini pizza joint I immediately smelled pizza permeating the room. We wanted to see what the hype of this place was and of course support this newly opened establishment. We tried calling ahead so we could just pick our food up, but we noticed on their website that they do not take phone orders from Friday-Sunday. They only do walk-ins on those days. We got the Angelo, the Paulie, and the Noni. All pizzas come in one size (slightly larger than a personal pie). The guy who took our order mentioned that they can subtract things from the pizza, but they don't do additions or substitutions. Mr. Angelo Pizza (yes, his last name really is Pizza) handed us our food. \n\nSince we had to walk back in the windy weather our pizzas were lukewarm by the time we got home. I would personally rate the pizzas a 3.5, but my boyfriend really liked it and would give them a solid 4. Our favorite was the Paulie. The homemade meatballs were really good. I think the pizzas would be much better if we ate it pipping hot. One of my favorite things were the pickled hot peppers that came with each pizza. It was acidic and super spicy. It added the perfect touch to the pizza. Highly recommend taking a bite of hot pepper and then a bite of pizza.", "date": "2020-12-27 05:10:23", "user": {"name": "Jennifer", "review_count": 312, "yelping_since": "2015-01-16 05:30:52", "elite": "2018,2019,20,20,2021", "average_stars": 4.06, "fans": 31}}
{"review_id": "kuRcHw7k3h8htiCEt-nXsA", "user_id": "0dxR_Q8PCOOWNkfpvI4t3w", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Great new addition to the philly pizza scene. Credit to them for opening right in the heart of the 2nd wave of covid. So logistics...la taconellis they only make a certain amount of pizzas everyday and for now, you have to go there in person to place your order except on tues-thurs. I've never seen a line, but definitely expect to wait 30 minutes or so. They don't have a system to call or text you so you either wait or do your best to show up close to the time. Note that there is a chance if you are late, they will give away your pizza (insistence on it being hot) so be punctual.\nNow for the pizza, I got a plain(the angelo) and it was solid. Definitely sauce forward and the sauce is really good, not too sweet, actually a bit on spicy side but very enjoyable. The whole thing kind of melds together (sauce, cheese, crust) really nicely but taste definitely leads with sauce. 1 pizza is easily consumed by a person of respectable hunger, so bear in mind you may need to allocate at least a half pie per person if not a full. I still give the nod to taconellis as the best in phila, but this is definitely in the convo along with beddia, angelo south philly, and pizza brain.", "date": "2020-12-27 02:34:16", "user": {"name": "Joshua", "review_count": 437, "yelping_since": "2012-06-30 18:56:10", "elite": "2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.31, "fans": 12}}
{"review_id": "P6XLXgk3C69EpI7W9tG1Fw", "user_id": "-2cKJFFNJ9XVyWBt62mWvA", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 3, "text": "As a senior, I have been staying at home since March... during the pandemic. Today I ordered a take out pizza from Angelo Pizza. And I'm happy to report they bake an excellent pizza. I had the basic tomato pie \"The Angelo\". The crust was crispy and not too thick and doughy. The tomato pizza sauce was very fresh... with the right balance of basil and oregano. The cheese blend was a perfect match to the sauce. The size is plenty for one person with a large appetite or two people with a more modest appetite. At $12 for the basic pie... it's a good deal. They take phone orders for pick up.", "date": "2020-12-23 21:51:11", "user": {"name": "Richard", "review_count": 94, "yelping_since": "2015-10-03 14:04:41", "elite": "2019,20,20,2021", "average_stars": 4.52, "fans": 5}}
{"review_id": "7Za80XH1HZLYeRKSTlKA2Q", "user_id": "u7lGgwVTmPaILJ0C1CwnHg", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Stopped in to grab a slice however, this is not your grab a big ass slice kinda place at all. It's more of a personal shove the whole pie in your face kinda place. The serving size is slightly larger than a personal pie so yes, you could eat a whole one yourself. This should have been a 4 star review. Had the complimentary cherry pepper been edible rather than there for show, and if the crust had held up in the middle, it would have been a solid 4. That wasn't the case so it became wasted garnish and droopy, soggy tip. (That's what she said) you know that first bite is everything\n\nHe's the new the kid on the block, perched on the less traveled side of Market st in Old City, yet creating quite the social media buzz and walk-in / pickup business . Could The Angelo Pizza become a destination for Philly Pizza? I totally think so especially if this is just the beginning of their journey into the food scene. Social media and marketing prowess aside, it's about the pizza.\n\ncheese to sauce ration was good\ntaste and chew of outer crust was delish\n Quality cheese - nice melt\n Meatballs were outstanding\nAll homemade from scratch\n\nThe meatball pie will bring me back for another round. Wish Yelp had half stars! Will update my review if the droopy tip was a one off.\n\nPs. The owner's last name is Pizza, that alone sets the bar high. Marketing capability alone.\n\nUpdate: I originally wanted to give a 3.5 but sadly Yelp does not have half ratings. After some thinking I think everyone agrees that opening a restaurant during a pandemic takes balls and I'm sure they will work out the kinks as time goes on.", "date": "2020-12-23 12:06:16", "user": {"name": "Chingi", "review_count": 155, "yelping_since": "2013-04-11 02:15:47", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.74, "fans": 28}}
{"review_id": "zhtQN1BWGw5uD3lLdxDmcQ", "user_id": "hbfzcWgyZxyqz6ZadhZQ7Q", "business_id": "nmeGoVi_U-bbnojJsi52Aw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "This place was really good! I was waking by it one Saturday and I think they had just done a soft opening. Last Friday, I figured I'd check it out, and even though it was around an hour to get my pizza, it was sooo good! Newest pizza spot in Old City, and everyone should stop by!", "date": "2020-12-19 04:02:26", "user": {"name": "Jesse", "review_count": 6, "yelping_since": "2015-06-24 11:57:02", "elite": "", "average_stars": 5.0, "fans": 0}}
