{"business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "name": "Saloon Restaurant", "address": "750 S 7th St", "city": "Philadelphia", "state": "PA", "postal_code": "19147", "latitude": 39.9398664, "longitude": -75.1545609, "stars": 4.5, "review_count": 190, "is_open": 1, "attributes": {"RestaurantsAttire": "'casual'", "NoiseLevel": "u'average'", "Alcohol": "u'full_bar'", "RestaurantsGoodForGroups": "True", "Ambience": "{'romantic': False, 'intimate': False, 'touristy': False, 'hipster': False, 'divey': False, 'classy': True, 'trendy': False, 'upscale': False, 'casual': False}", "GoodForKids": "False", "RestaurantsReservations": "True", "BusinessAcceptsCreditCards": "True", "RestaurantsPriceRange2": "3", "WiFi": "'free'", "DogsAllowed": "False", "BikeParking": "True", "RestaurantsTableService": "True", "Caters": "False", "BusinessParking": "{'garage': False, 'street': True, 'validated': True, 'lot': True, 'valet': True}", "RestaurantsTakeOut": "True", "HasTV": "False", "BusinessAcceptsBitcoin": "False", "GoodForMeal": "{'dessert': None, 'latenight': False, 'lunch': False, 'dinner': True, 'brunch': False, 'breakfast': False}", "OutdoorSeating": "True", "BYOB": "False", "RestaurantsDelivery": "True", "HappyHour": "False"}, "categories": "Restaurants, Chinese, Italian", "hours": {"Monday": "17:0-21:15", "Tuesday": "17:0-21:15", "Wednesday": "17:0-21:15", "Thursday": "17:0-21:15", "Friday": "17:0-21:15", "Saturday": "17:0-21:15", "Sunday": "15:0-19:30"}, "category_list": ["Restaurants", "Chinese", "Italian"], "stratification_tag": "Italian"}
{"review_id": "LQgOGTXb8gWjR-9HSK-MSg", "user_id": "fqs16FLYK0DSWC2qmUHE2Q", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "just wow all i have to say!\nno complaints!\nfood is absolutely delicious and the service is amazing been going for years and it's just amazing everytime.", "date": "2022-01-09 06:49:33", "user": {"name": "Damien", "review_count": 5, "yelping_since": "2021-08-06 00:16:56", "elite": "", "average_stars": 4.2, "fans": 0}}
{"review_id": "8MIbnbiYLoIxm9VKzl1UTg", "user_id": "pqOIHP6NHYlqskHn9a9-7w", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "would rate this place a -400 stars if i could. nothing to do with food or atmosphere but the male staff and management towards the female servers. been here only once and i overheard the male manager degrade one of the female servers using sexual derogatory words. absolutely disgusting. have heard from close friends having the same experience observing similar treatment. these women just trying to make ends meat but have to endure a hostile work environment. cant believe this issue still exists in our world but alas we are here. these women may not take it to the next level but hopefully my review puts a spotlight on this huge repulsive issue. get it together pigs", "date": "2021-12-27 20:37:08", "user": {"name": "Kristen", "review_count": 2, "yelping_since": "2012-06-29 14:38:43", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "0cs4OAeyaYmC0aOOAI6PBQ", "user_id": "hRz-qBm7Nnl6TAZNfC0-nA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Amazing meal! Great service and excellent food. Loved the atmosphere. Faves were the pasta and mussels but everything was delicious. Will definitely be back!", "date": "2021-12-03 05:17:25", "user": {"name": "Alessandra", "review_count": 27, "yelping_since": "2019-01-17 23:49:15", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "WeCdLoAGK6PWEKuKURPqIA", "user_id": "4ON5vnotC-D5mLwwqkYK6w", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Amazing food, service, and a very cool environment. The Langostino, lobster, and filet were amazing!", "date": "2021-11-11 11:34:44", "user": {"name": "Jordan", "review_count": 10, "yelping_since": "2014-05-16 21:27:43", "elite": "", "average_stars": 4.9, "fans": 1}}
{"review_id": "B8OOcic9CAXiHj_gCYrZRw", "user_id": "emH4pDc54pEe3jRGKrTpTQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I walked in and immediately loved the atmosphere.Then the food came and I can't remember eating anything so good in so long. Phenomenal service as well, all around the best!", "date": "2021-11-11 01:04:03", "user": {"name": "M", "review_count": 13, "yelping_since": "2014-04-25 02:07:50", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "G49KkKbAGJlMdo8VkUgM5Q", "user_id": "yRiPqBvFXOTN7C6BXu0i_w", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "One of the best Italian restaurants in Philadelphia. Super convenient with free parking. Try the filet!!", "date": "2021-11-03 19:20:30", "user": {"name": "Robert", "review_count": 5, "yelping_since": "2021-10-31 13:07:30", "elite": "", "average_stars": 3.8, "fans": 0}}
{"review_id": "LC-ht3b8ILWcI8Qf5o6Pjg", "user_id": "c0K9ON2zP3ORSK-t1K7Vmw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "Food is decent, but definitely not worth the price and feeling rushed to eat. Staff was friendly, but so attentive and pushy, we couldn't help but feel like they wanted us out ASAP. We ordered our entrees and they arrived in roughly 10 minutes.  Our dessert was delicious, but it was hard to enjoy when the check was placed on the table just 2 bites into it. We had planned on staying for an after dinner drink at the bar to sample their wonderful cocktail list, but decided not to so that we wouldn't be a further inconvenience to them. If you like spending $200 on a dinner for 2 that lasts for 45 minutes, this is the place for you. We won't be back.", "date": "2021-10-31 15:24:35", "user": {"name": "Tom", "review_count": 20, "yelping_since": "2014-06-15 21:39:00", "elite": "", "average_stars": 2.8, "fans": 2}}
{"review_id": "1ABg4racuY2N3ebdr0HRrw", "user_id": "Y2ShLn_gdJrpV3LD-ln_nw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 4, "funny": 1, "cool": 5, "text": "These dinner devours come from the golden oldie @saloonphilly . This south philly restaurant is 57 years old and have been around since 1964. The establishment has a parking lot and two floors . It's fill with antics and a great staff. It's a traditional restaurant with a lot of older folk. Bathrooms were really clean  and made of nothing but ivory . While here i was seated at the bar and my wonder dope bartender/server Gigi aka Giana. She was very easy to talk to and she walked me through the menu. I ordered the salmon  fruitti di mare with crab meat, topped with lemon capers and fresh tomato. The menu has changed so i was unable to be the mussels, clams, and shrimp. I was very disappointed in this but it was after i devoured the delicious fish! The salmon was excellent and the crab meat was phenomenal! If your ever in south philly and want some great veal or seafood please check out  @saloonphilly and ask for gigi and tell her Mr. Julian sent you!!!  #philly #philadelphia #food #foodphotography #foodpics #foodporn #foodie #fish #salmon #crab #lemon #capers #butter #garlic #water #shrimp #mussels", "date": "2021-10-27 00:29:11", "user": {"name": "Julian", "review_count": 103, "yelping_since": "2014-10-14 04:39:04", "elite": "2019,20,20,2021", "average_stars": 4.25, "fans": 10}}
{"review_id": "yNQXN6MeER-wf0p1HOKchA", "user_id": "qkd6LJK7HIdzagRLQpxW5A", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "Frank. If we didn't love the restaurant so much we would come just for him. He truly makes this more than just a restaurant, it is a complete experience. The food is always great, the hospitality is one of a kind and we bring every visitor who comes into town to \"our spot.\" My only apprehension in leaving five stars is that now everyone will come. We want Frank all to ourselves.", "date": "2021-10-22 23:40:21", "user": {"name": "Melissa", "review_count": 17, "yelping_since": "2013-03-14 17:54:56", "elite": "", "average_stars": 4.88, "fans": 0}}
{"review_id": "PzklpgMnIqa2DwU38_aGXQ", "user_id": "qSile_HpfR-LIrFgjRJ0rg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "I can't believe it took me this long to eat here. Went for my father-in-law's birthday dinner and loved every minute of it. Everything we had, from the octopus salad to the braciole to the gnocchi, was just the way you'd want it.\n\nVery cool atmosphere, too... whimsical and intimate. Reminds me of a more laid-back version of the basement at 21 Club... relaxed dress code, service that's more warm than obsequious.\n\nWill definitely come back the next time I'm in Philly.", "date": "2021-10-05 12:58:48", "user": {"name": "Justin", "review_count": 52, "yelping_since": "2010-01-20 20:56:45", "elite": "", "average_stars": 4.38, "fans": 3}}
{"review_id": "ck1V_qPBRr3E4aqwvmy3Gw", "user_id": "-_Lfm5bztNCYXaBmrqY7tA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 2, "text": "Its been many years since I dined here. I must say things have changed a lot, good and not so good. \nLet's start with the food and drinks. They have a fantastic selection of items, and specials on the menu.  From escarole soup to steak and lobster. They also have a very enticing dessert tray! I tried the veal piccante. It was very tender and tasted quite lovely. We also tried the langostinas, they were on the specials menu. Also very well prepared, presented, and delicious. All the main dishes are a la carte. Sides include sauteed spinach, mashed potatoes, sauteed escarole, and there was also a brussel sprout side added. There are two bars, one upstairs and one on the main dining area as you walk in. The bars are beautiful and well stocked.  They have a decent wine and cocktail menu.  I decided to try the Vesper, it was very good! \nWhat's changed? The price of food here is very high! Too high for the area, the type of cuisine (Italian), and for a casual restaurant not known for great cuisine made by well known chefs. There are many top restaurants in the city with comparable pricing, or lower. It would be quite a challenge to dine here again simply based on the very high priced items.  Please take this into consideration! \nBread.  Not good at all! Our bread came out in a small basket and was frozen in the center. Appeared to have been warmed up very quickly. It was not fresh or tasty.  In fact, this almost ruined my appetite.  I didn't mention this to the server because I had already decided this was not typical or satisfactory; and I didn't really need to eat bread that badly anyway. \nComplementary parking.  They have a couple lots to park at.  They were both full.  However there is a valet that will park your car. He will let you know he works for tips. Be good to him. I would recommend taking a taxi, Uber/Lyft to the restaurant..  It would save you time and the aggravation of driving around trying to find a parking space, or tipping the friendly valet. \nSaloon has beautiful old world decor.  Lots of beautiful carved wood and nice artwork throughout.  To be quite frank, it's a little too busy.  The restaurant is very clean.  The service was very good! Everyone here is well dressed and appeared to enjoy doing their job.  They were very welcoming from entering and leaving. \nOverall, Saloon was a disappointment, despite being a traditional South Philly landmark. I was not happy with the prices here at all. Especially since it was a la carte. I probably won't come back, but I feel you should at least give it a try, take your chances. Be prepared to spend at least $70 or more per person.  There's too many other Italian restaurants in the city I would recommend on all levels.", "date": "2021-10-02 13:24:37", "user": {"name": "Ray", "review_count": 174, "yelping_since": "2011-10-04 20:56:56", "elite": "2015,2016,2021", "average_stars": 4.26, "fans": 14}}
{"review_id": "ny_pyywXCt39XUFOtq8ZFA", "user_id": "5jKScvMqxW_rzd0D8xgX1A", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my family and had blast! Our server was amazing and everyone was so friendly.  They def had a huge specials selection which was hard to remember but sounded so good.  We ordered a combination of pasta, seafood and meat and we really enjoyed everything. I dont think you can go wrong with anything here.", "date": "2021-09-30 17:22:57", "user": {"name": "Mike", "review_count": 271, "yelping_since": "2011-06-23 20:30:28", "elite": "2014,2015,2016,2017", "average_stars": 4.29, "fans": 9}}
{"review_id": "BZ5CPMuhx-XSiScLhED1gg", "user_id": "oK03j2HvvGTJ2Y_QbLU43g", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Our favorite spot.  Food is always on point and martinis are best in the city.   Can be pricey but worth it.", "date": "2021-09-24 23:56:21", "user": {"name": "Ed", "review_count": 6, "yelping_since": "2015-11-23 12:42:44", "elite": "", "average_stars": 3.64, "fans": 0}}
{"review_id": "t-hwwFVh08e24WvEL6ocIA", "user_id": "-wksA6A9WjBk0t906rPLbw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I regret not having taken pictures of the food but it was to die for. I hadn't seen my ex since 2015 and I figured that The Saloon was the spot for a fresh restart. We shared the Clams Pavarotti which she loved and with good reason. They were divine. I had the Truffle Filet (a special) which had a crust on the surface and pure meat butter on the inside. I ate this slowly savoring every morsel.  This restaurant has always maintained the highest level of quality for so long. It's old school South Philly refinement and class makes one feel like she walked into a time machine where everyone dresses to the nines and feels that he is part of something. We had such a wonderful time there. I give it a 4.85 with a miniscule deduction for not getting the freshest bread. MADONE!", "date": "2021-09-18 21:23:55", "user": {"name": "David", "review_count": 9, "yelping_since": "2018-09-06 20:49:34", "elite": "", "average_stars": 3.44, "fans": 0}}
{"review_id": "4x3YRnxMBNP9lIVIiEy6fg", "user_id": "WtnerGVQjEgJHNM2rnJDEg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have been here many times. The valet parking is free and extremely convenient. The restaurant's decor is gorgeous, lots of wood and leather. The drinks are strong and the food is tasty but certainly nothing special with the occasional surprise. The upstairs bar  gets noisy. The total experience is more luxurious than 3 stars, but definitely not a five star resto. So 4 stars.", "date": "2021-09-16 22:43:43", "user": {"name": "David", "review_count": 98, "yelping_since": "2009-03-15 21:00:53", "elite": "", "average_stars": 3.53, "fans": 0}}
{"review_id": "VyVtJu8W2LSozM91pfV6ew", "user_id": "AK30CGAECtE_7GwCmDMMMA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "My husband and I had an excellent dinner at the Saloon last PM.  We started off with \"The Sampler\", Poblano Stuffed Peppers, Clams Casino, Clams Pavorotti, and Langostinos.  This was a fabulous appetizer!  For dinner, my husband had Veal Parm with the best homemade raviolis ever!  I had the Lobster Francaise, with Broccoli Rabe,  Beans and Sausage. Our cocktails were spot on and OMG, I almost forgot to mention the bread and pesto. The pesto is homemade and hands down the best I've ever had aside from my future daughter in law's This Resturant is a \"must visit\" when we are in the city. \n\nI have to give a shout out to our server Amy.  She was so sweet, kind and beautiful. She not only remembered serving us 3 weeks ago when we dined there but she knew exactly what we had including our drinks. Now that's impressive!!  She knows the menu well and when she goes over the specials with you she describes them in such a way that you want to have one of each. Thank you Amy for your excellent service and we look forward to seeing you again soon.\n\nKim & Scott G.", "date": "2021-09-13 01:32:56", "user": {"name": "Kim", "review_count": 12, "yelping_since": "2012-12-22 15:29:06", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "uZPEHDD0MOZ7y9qODsLrFQ", "user_id": "DwshcLeRbQzyo-RP1WK5XA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time eating here and I was excited as I've heard about it a lot. To be honest it exceeded my expectations which were not the highest, it was a fantastic dinner and I look forward to going back. I did not even realize they had free valet parking which was . \n\nTomatoes and crab starter was top notch.", "date": "2021-08-02 23:52:22", "user": {"name": "M", "review_count": 35, "yelping_since": "2012-07-31 18:53:52", "elite": "", "average_stars": 4.61, "fans": 0}}
{"review_id": "naZr1AyPRSOm0MnQQMH1kQ", "user_id": "s7xEAffNcf_4XG156aAxmw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Delish!! Food was outstanding and service was excellent! I love the atmosphere of this place reminds me of the 1920's or something all the dark wood and tile. Lovely place can't wait to go back", "date": "2021-05-26 11:36:06", "user": {"name": "Heather", "review_count": 38, "yelping_since": "2012-12-30 21:12:24", "elite": "", "average_stars": 3.05, "fans": 0}}
{"review_id": "PLDm8XnLZXj-hbyHhjWJRA", "user_id": "cHxPxdA4Y4M5S7d0gJf6MA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Amazing that the food is still excellent, but the waitresses stink. They use to be a main attraction, for both looks and service.  The waiters are better now except for the one who is ok with you substituting what you may not want, for a charged side dish.  The interior is fabulous.  Pricing has gotten better offering good value for high quality product and perfect execution.  Service should be more professional, as it will keep me away for a while.", "date": "2021-05-21 18:28:26", "user": {"name": "Jerry", "review_count": 40, "yelping_since": "2009-10-07 12:20:26", "elite": "", "average_stars": 3.53, "fans": 1}}
{"review_id": "AvK1Z8XiIIeF3atUR9D__g", "user_id": "Io3IpnLC3dTnfxPrCzdGvw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "The food here is DELISH! We got:\n\n- bread (free and excellent), \n- tuna sashimi appetizer (excellent), \n- caesar salad (not incredible), \n- bragiole (holy shit that was so goddamn delish) \n- lobster fettuccine (pasta was overcooked and soft) \n- gluten free spaghetti (not terrible, which is a win for GF!!) \n- berry tart (not incredible) \n- almond cake (wayy better than expected) \n\nHope this helps someone!", "date": "2021-05-10 14:09:45", "user": {"name": "Matthew", "review_count": 70, "yelping_since": "2013-06-19 21:12:58", "elite": "", "average_stars": 4.33, "fans": 3}}
{"review_id": "sXpQ3nEybcN-i-R-FWDpUA", "user_id": "eQrqy9t2ciHNtdwVHQXRxw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "In my 4 years living in South philly, having tried what I thought was all the best Italian spots, we had never made our way into Saloon. Until last night. Wow. What a remarkable place. First they hit you with two giant free parking lots. Get outta town that's unheard of in the city. Walking into the restaurant, the vibes and ambiance are way more than expected. Our group had the opportunity of sitting at a beautiful semi-private table surrounded by glass windows. Truly made the experience top level. The service was out of this world as well. Not a water glass waiting to be filled or a cocktail left empty. Huge shout out to FRANK and ALYSSA for making our dinner amazing. Frank (who I have definitely seen in the series Boardwalk Empire), was such a genuine and fun loving guy. He put a smile on our faces every time he came by. Now for the food - unreal. So amazing. We ordered the truffle steak and i have never had a piece of meat melt in my mouth the way that did. Washed it down with some mashed potatoes, some arugula/pear/and burrata salad, with just enough room for lava cake and berry cobbler. Overall I would give it a 13/10. And will be back...maybe even later today", "date": "2021-04-10 12:06:34", "user": {"name": "Andy", "review_count": 4, "yelping_since": "2019-10-17 01:54:45", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "wwJfbNs7d3reI98LEMM9XA", "user_id": "KNQz__F64qvKPOxeXPc9Ag", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Four \"immunized\" boomers decided to have our first dine-in experience in a year at The Saloon.  And are we glad we did!  Covid protocols were in place but most importantly, the food was exceptional --as one would expect from this Philly icon. Our server was vivacious and the manager even made a fuss over two of us who had birthdays that week. A wonderful, memorable night. Grazie!", "date": "2021-03-22 17:49:02", "user": {"name": "Marianne", "review_count": 28, "yelping_since": "2015-07-18 15:24:57", "elite": "", "average_stars": 4.41, "fans": 0}}
{"review_id": "RO6Ek5EaRPfaImwwHa1q8g", "user_id": "BXBtET2Kk7MmsqEXYySXtg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "Saloon is an amazing experience. Everything about it is just so old school and traditional Italian. From the menu offerings to the actual decor (big wooden bar that spans a sizeable part of the restaurant as soon as you walk in, lots of dark and rich tones in the furniture, and of course the food being served on multiple floors just fills the building with the irresistible Italian cuisine aroma.)\n\nIt is in the heart of South Philly, always crowded with great people. Love the energy in this restaurant. \n\nYou are going to spend some decent money here, it can be a bit pricey if you are just seeking Italian food, but in my opinion, it is all worth it!", "date": "2021-02-22 17:42:18", "user": {"name": "Vincent", "review_count": 206, "yelping_since": "2020-01-28 03:25:01", "elite": "20,20,2021", "average_stars": 3.96, "fans": 11}}
{"review_id": "bCVZW9mCXygnL0Siaj0eHg", "user_id": "qifgGoyS3Fnt7KogFa064Q", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "LOVE this restaurant. I mean everything about it is amazing and perfect. We've been here about 5 different times and I have gotten consistent amazing service and food every single time. To start, the ambiance of this restaurant gives you 1960s vibes with the old decor, unique layout and a very impressive upstairs dining area. I also really appreciate the free parking lot they provide since parking in south Philly can be a pain. The food here is simply next level. Everything I've gotten has come out fresh, flavorful, and amazing. Portions are very generous and good for sharing. Service overall is top notch. They do not rush you to order and eat and leave like some places. They allow to you get your drinks and take your time before food comes out so you can enjoy the atmosphere. Overall this is one of my favorite restaurants in the city. I recommend making reservations because they get packed.", "date": "2021-02-13 14:24:22", "user": {"name": "Hang", "review_count": 37, "yelping_since": "2015-04-23 18:22:00", "elite": "2021", "average_stars": 3.97, "fans": 0}}
{"review_id": "UvKwPUFODhRXma2afMvTAw", "user_id": "5NsB7O10FRrrHVAP1Z9RnQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "I cannot express, how good Saloon is - but I'll try. If you're looking for the perfect old school, South Philly, date night spot this is IT. \n\nWe have a few couple friends that we've been here a few times with and I have never been disappointed. If you, and once indoor dining opens again, try to snag a seat upstairs. Everything from the red lighting to the wall decor creates the coziest setting. \n\nWe ordered two of the appetizer samplers that come with stuffed clams, veal stuffed poblano peppers, and prawns - I'd highly recommend if you want a little bit of everything (and drizzle some of the oil they give you on top - it's AMAZING!). I'm a big seafood person and always love the Crab Stuffed Salmon, but got the Scallops & Crab in Cognac sauce off their specials menu the last time we went and it was out of this world. My friend got the truffle steak and also raved about it. \n\nI'm not a huge dessert person, but you really can't go wrong with anything on their menu. And don't skip on an espresso martini to finish things off.", "date": "2020-11-20 15:04:26", "user": {"name": "Kelli", "review_count": 23, "yelping_since": "2015-08-08 17:43:42", "elite": "", "average_stars": 4.56, "fans": 2}}
{"review_id": "l4L8iYcPoBZmSBphYdWAzQ", "user_id": "CPivNJkWGNZQo2zBXrfXqQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We had a 60th Birthday day party for our best friend and the evening was outstanding for the food to the service I would highly recommend it !!! Petite FiletStuffed ClamsEggplant ParmChicken MelanzanaBraciole15oz. Grilled Veal Chop", "date": "2020-10-20 06:51:55", "user": {"name": "Ettore", "review_count": 32, "yelping_since": "2012-07-30 14:31:56", "elite": "", "average_stars": 4.83, "fans": 1}}
{"review_id": "OIQKF9tolpsHnISPc_As1A", "user_id": "qa3zU8C1n58xEzd1qFZP8w", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "Really loved this place. Ate here a few weeks back when I was in Philly for work. The atmosphere is very chill and the decor is really neat. The food was excellent too. Carole Baskin killed her husband. I will definitely be back and highly recommend this Italian gem.", "date": "2020-04-22 15:33:54", "user": {"name": "Brad", "review_count": 10, "yelping_since": "2015-10-01 16:38:50", "elite": "", "average_stars": 4.3, "fans": 0}}
{"review_id": "nfBV5lKafShKH8cu9uOfWg", "user_id": "1IBrv1Ebbk6R9KKSC8l7jQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was taken to Saloon for many years as a child with my Mother, a local celebrity and with family friend Pete Pagano. In my mind I had a very fond memory. We were celebrating my friend's 60th birthday with early reservations on a Sat. night. We checked our coats, I remember complimenting the coat check girl (later to find was reported to be the Manager Susan's Niece). \nMy (extremely unique) scarf and a lapel pin (with semi precious stones)\nwas not returned with my coat!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nNot in my entire life has this kind of thing happened. After looking throughout the coatroom (giving the thief time to place it on the floor or come up with another bs reason why it was not returned to me). I left without my belongings.\nCalling for weeks & speaking to the day manager, all I got was: \"we have people checking furs. Why would my [niece] take your things, she's a student at the Arts Institute. My things were VERY unique & also very sentimental. \nSaloon hires thieves and they are their family and you will never get your things back.\nI'd say DON'T GO and if you do, keep your eyes on your stuff.\nAnd i found the food to be over sauced.\n\nI would still like you to return my belongings!!!!!!", "date": "2020-03-29 04:51:20", "user": {"name": "Laurie", "review_count": 1, "yelping_since": "2019-07-10 21:05:18", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "1ijV719ASH9ItuqeFR2WEg", "user_id": "rdp2a-7sPlqmYlYvuXGlNw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wonderful experience! Meal was fantastic. Drinks were perfect and service was amazing. One of the best Italian Restaurants in the city.", "date": "2020-02-26 11:51:33", "user": {"name": "Eileen", "review_count": 2, "yelping_since": "2014-12-02 00:48:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "cmomPp2kViAOvbrJMYSxoQ", "user_id": "zXdQqQlLHfKOkG_E_79SaA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food ++++\nprices reasonable\nFree parking\nService +++++++\nDrinks were awesome\n\nHaven't been for 30 Years just as good will be going back\n\nPhil from Philly", "date": "2020-02-23 11:54:47", "user": {"name": "Phil", "review_count": 30, "yelping_since": "2014-06-05 11:19:42", "elite": "", "average_stars": 3.78, "fans": 1}}
{"review_id": "_IFoCbPoV_u1cctxPeNAmA", "user_id": "VZx5bcb0yqToz8RmGSI0-Q", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "Decent food, okay service and poor management.\n\nWalked in for a 8:30 reservation at 8:30 and were told \"it'll be a few minutes\". No problem we wait. 20 minutes go by and we are told \"go upstairs the host up there is expecting you the tables are getting ready now\". Walk up and admire all the old time decor (only cool thing about this place) only to wait another 20 minutes for the table. 40 minutes later we were seated with a \"hey thanks for waiting\" and that was it. For an restaurant of this level you'd expect more from management and communication. Server was nice but dropped the check off and never saw her again, another waitress closed us out. \n\nCan definitely get the same quality food at other spots in the city. Go in for a drink at the bar if you're dying to see the decor. Other than that it's not worth your time.", "date": "2020-02-09 14:01:06", "user": {"name": "Lianne", "review_count": 3, "yelping_since": "2014-11-23 18:16:32", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "E3nLxqPCUVGHohfCEVN48Q", "user_id": "6rLcSCokJDCpwSjdiZty3g", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 2, "text": "This place is awesome. I'm not sure how I missed it all of these years but I'm happy to add it into my rotation of favorite places too eat. \n\nBest perk off the bat = the complimentary parking. That eliminates the stress of circling the block for a spot! \n\nNext favorite = the atmosphere is unbeatable. The decor is dark, cozy, and very Italian. There is both an upstairs & downstairs bar. The staff is friendly and very well trained. It's the perfect spot for both a nice date or a fun loud group. Try and get a seat upstairs by the live music! I didn't know this existed until we were leaving and can't wait to come back for it. \n\nJust because of the vibe of the place and how enjoyable our night was I didn't care about the food being great. But luckily each dish was fantastic!! The complimentary bread was hot and fresh and came with a delicious pesto dip. I had one of the salad specials - burrata with arugula, pear, apricots and hazelnut dressing. For my main I had the rigatoni sesso - awesome spicy sauce. My husband had the Braciole and loved it - super tender and flavorful. That comes with  cheese ravioli and OMG that was the total show stopper. I'd come back a mIllion times over for the ravioli. They were like cheesy clouds in an amazing red sauce. \n\nEveryone GO!", "date": "2020-02-02 15:27:29", "user": {"name": "Courtney", "review_count": 314, "yelping_since": "2015-06-19 22:32:16", "elite": "2018,2019,20,20,2021", "average_stars": 3.84, "fans": 11}}
{"review_id": "LWqkxrQrl94CmqnLI2hfSg", "user_id": "wLBs0MD3jvGv0ILSPjxZiA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was fantastic! We were seated on the 2nd floor Monday night and our waiter was very arrogant and short. It doesn't matter how good the food is when the waiter acts as if he is doing you a FAVOR it literally ruins your night.", "date": "2020-01-10 01:55:41", "user": {"name": "Pat", "review_count": 2, "yelping_since": "2018-09-04 20:19:35", "elite": "", "average_stars": 2.5, "fans": 0}}
{"review_id": "UkxQ7Xhx66doQCziPcLO0Q", "user_id": "k0PV5GT4lTx-kFdNx89qeQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Perfect dinner in Christmas Eve ! This place never lets us down! We always leave more than satisfied. All dinners prepared with perfect detail and all the best ingredients. Live music is always tasteful and entertaining!!", "date": "2019-12-27 03:48:01", "user": {"name": "Mike", "review_count": 48, "yelping_since": "2014-11-19 04:10:27", "elite": "", "average_stars": 2.42, "fans": 0}}
{"review_id": "pWee9QUKQucuRHNh7AhR-A", "user_id": "Iv411IFwWulRPvH8X5d5cg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "This place was very nice and vintage with old fashioned pictures on the wall and register. Very cool. All the waitresses were elegant and detailed with their specials for the evening. The waiters and waitresses all greeted us and made sure we were good. I ordered the scallops with crab meat in cognac sauce, delicious! For dessert, they bought out a very large platter with all kind of desserts! Also, they have their very own parking lot just for their guests. I will be coming back.", "date": "2019-12-10 21:14:12", "user": {"name": "Kim", "review_count": 53, "yelping_since": "2017-08-20 02:46:23", "elite": "", "average_stars": 3.5, "fans": 2}}
{"review_id": "tebPZVc3jTjVPL16hBAK5A", "user_id": "ESGcGXYaCoA9IXZ4POnrSg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "HORRIBLE service. Food is decent but for $150 per person, they need to do a better job. Veal was salty and overcooked. Loud restaurant with inexperienced servers for an \"upscale\" white tablecloth restaurant. I gave it two tries and unfortunately, they will not be getting my business again.", "date": "2019-11-25 20:30:02", "user": {"name": "Alex", "review_count": 5, "yelping_since": "2012-05-10 02:15:17", "elite": "", "average_stars": 2.83, "fans": 0}}
{"review_id": "Xj6JsgnDUm-AfLbNeVhECg", "user_id": "PsUgJaz3tw7OidJFkHIbKw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ambiance and service were amazing. We weren't blown away by the food but the place was packed so what is the incentive to change? We did feel bad for the server who had to recite a special menu that featured  about 9 specials, at least. At that point mide as well type them on a sheet.", "date": "2019-11-24 22:37:25", "user": {"name": "George", "review_count": 28, "yelping_since": "2013-11-03 10:21:35", "elite": "", "average_stars": 3.61, "fans": 1}}
{"review_id": "NoOtrHZT0aPH2dp8iip9WA", "user_id": "BtdqTErMCjvrQxKmBlJ7Uw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "This review is a couple weeks old so the specials are probably different now, FYI.\n\nOH MAN. This was the most expensive meal I have ever had. Granted, we ate 3.5 courses and each one was delicious. But that bill was a whammy.\n\nWe actually planned to go somewhere else for dinner because on this particular Saturday night, Saloon was all booked up at the time we wanted to eat and we couldn't make a reservation. Long story short, we ended up here anyway and it was only 15 minute wait for 2 people. We waited at the downstairs bar and got a round of drinks (wine for me, beer for boo). Lots of nostalgia in that area! It reminded me of my grandmoms house in the 80s with the knick knacks and such - and I mean that as a compliment!!\n\nOur wait was truly about 15 minutes as promised, and then we went on a long walk up the stairs and around the corner to our table. I didn't realize how huge this place was inside so I guess that's why, even with no reservations, they could still seat us around 8pm on a Saturday within 15 minutes? There was going to be live music in the upstairs bar later so that might be worth checking out another time.\n\nOur waitress came over to walk us through the menu and tell us about the specials. Pro tip: bring a notebook and pen because the specials menu is about the same length as the regular menu. She rattled off at least another 10-12 dishes ranging from salads to appetizers to entrees. She really knew her stuff because she did not fumble over a single ingredient. We thought we knew what we wanted from the regular menu by the time we sat down (clams casino, two entrees) but upon hearing the specials we completely changed course (punny!) and ordered almost our entire meal from specials.\n\nWe started with (special) salads, which we never do, because the ingredients sounded lovely. My partner had something like an apricot and pecan salad and I ordered a spinach salad wrapped in prosciutto with feta or something. I actually wanted the beet salad but she told us about that one by accident or they were out by the time I ordered. My salad was truly a wrap and in my opinion it could have used half the amount of spinach, but both were overall delicious and full of flavors and textures despite being rabbit food.\n\nI lied, we actually started with the complimentary bread and what appeared to be a pesto dip. Nice way to cleanse the palate for sure!\n\nThen we ordered the (special) appetizer that consisted of two clams casino, two clams some-other-way, two giant prawn boys, and two stuffed poblano peppers. We figured why settle for just the clams casino when we could try a sampler? It was yummy but I wish we had just gone for the casino because the entire appetizer ended up being something like $40-50 by itself and we mostly enjoyed the clams anyway. We were both a little creeped out by the prawns haha.\n\nFor our meals! I ordered scallops (another special) because I will never turn down scallops, and my partner ordered the only thing from our meal that was off the main menu - the veal parmigiana. When he ordered, the waitress asked what kind of pasta he would like on the side as if it was included but as it turns out the side of pasta was another $12. I could make an entire pound of pasta and sauce from scratch to feed a family of 4 for $12! *Shock* My scallops were delicious. I didn't like his veal but he enjoyed it. The pasta sauce was flavorful and yummy, always a good indicator for a solid Italian restaurant that doesn't skimp on the staples.\n\nBy this time I had seen a neighbor table order dessert and there was a huge tray of desserts brought to them and I heard \"cheesecake\" so I decided to get wild and top off my meal with some dessert. I ordered the pumpkin cheesecake. It was a perfectly textured/baked slice, but I didn't get a lot of pumpkin flavoring, and I am all about that basic b* fall PSL life so I was, admittedly, a little disappointed. Did it stop me from eating the entire thing? No. \n\nThen our bill came. We had tried estimating it along the way and knew it would be over $100 but we didn't expect it to be $195 (over $100 per person with tip)!\n\nI left feeling quite satisfied, check shock aside. Everything we ate was delicious, albeit a little pricier than we anticipated. If we come back here I think we will limit ourselves to our normal 2 courses each and we will at least be aware that the specials are also especially priced and not always commiserate with similar-sounding standard-menu counterparts. It would be swell if the restaurant could print the specials so we know the prices and so the servers don't have to rattle them off for 20 minutes at the start of the meal. But, I had a similar experience at another Italian place (Giorgio on Pine) so I guess it's just an ambience thing to shout an entire new menu to me as a patron when I sit down. I can get with it.\n\nBut seriously, #noregrets. Definitely try this place!!", "date": "2019-10-25 12:31:31", "user": {"name": "Tricia", "review_count": 250, "yelping_since": "2015-09-22 18:42:36", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.12, "fans": 14}}
{"review_id": "ldTrlZBovSAW_Y4axBaKqw", "user_id": "g4ptSwb0C1b7PYDo8lHDpQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I can't remember what I got but I recall it being pretty good but not out of the world. Nice atmosphere, pretty nice attire is wore. Overall, would recommend, a little pricey but nothing crazy.", "date": "2019-10-21 22:39:30", "user": {"name": "Matt", "review_count": 393, "yelping_since": "2013-08-09 19:23:14", "elite": "2014,2015,2016,2017,2018", "average_stars": 3.69, "fans": 6}}
{"review_id": "8zPTglKCEdz_9ZuM5t1NQA", "user_id": "G9qKlNJpTtMvqBXOtdlPpg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My son and his wife took his in-laws and my wife and I out to celebrate their anniversary. I've been there before and I was not disappointed. Great drinks and entree's. Service and atmosphere were awesome. Don't forget the desserts !!! Carrot cake was out of this world.", "date": "2019-10-20 18:48:59", "user": {"name": "Harry", "review_count": 12, "yelping_since": "2015-05-16 17:26:09", "elite": "", "average_stars": 3.07, "fans": 0}}
{"review_id": "nFVw-ZlkojfJTMFPNbKaSw", "user_id": "EO4goAgwcbaRx3x-eQf4dg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "5 Fettuccine Lobster Amatriciana w/ homemade fettuccine with South African lobster, guanciale, onion, fresh tomato, leeks and sharp provolone cheese in a tomato sauce. The lobster was fresh and clean paired really well with the other ingredients in this dish. Also made great for next day leftovers!! \n\n5 Petite Filet - 7oz. choice tenderloin of beef with a port wine sauce and Yukon gold mashed potatoes. Tender piece of meat with the wine sauce and the potatoes made this meal delicious.\n4 Chocolate Peanut Butter Mouse Cake- Was good but can't say anything was overly impressive about it.\n\n5 Overall- Food and service was very consistent and delicious! Philly tradition and a staple!\n\n#fourkgasm", "date": "2019-10-13 14:56:44", "user": {"name": "Kathryn", "review_count": 80, "yelping_since": "2017-01-05 01:14:49", "elite": "2019,20,20,2021", "average_stars": 4.65, "fans": 4}}
{"review_id": "Z0Aqck-7DFR5hXnLIkq9cg", "user_id": "yGD167qLRYb0UXeWT4S1Gg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fabulous spot for dinner! The food was delicious, and our server, Anthony, was great. The spinach salas big enough to share, and the warm bread and house-made pesto was amazing! Don't skip dessert!", "date": "2019-08-08 02:29:24", "user": {"name": "Stephanie", "review_count": 11, "yelping_since": "2012-09-22 18:38:40", "elite": "", "average_stars": 4.36, "fans": 0}}
{"review_id": "XYn7ZK7jPExCpWmYePNpTA", "user_id": "tef9hh0ulq5ObePq0zi6MQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "This is an old fashioned Italian restaurant, the kind of place you found in little Italy. I f you want a piece of heaven with good service and great food The Saloon does not disappoint. It has a quality that makes it feel like it's been there for years. Food is good and consistent just like your southern Italian grandma made! It's a gem.", "date": "2019-08-03 22:59:44", "user": {"name": "Marcia", "review_count": 11, "yelping_since": "2014-10-05 14:37:57", "elite": "", "average_stars": 3.83, "fans": 0}}
{"review_id": "HK0PBl7Os-74YGmbQ2ORmw", "user_id": "0JzEGl6pffSgQ7VCIKT5sw", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was nice, but not anything you couldn't get at a mid-range Italian restaurant in the city for half the price. Probably won't return for that reason, but the service was exceptional and made the experience rewarding for us.", "date": "2019-08-03 14:16:55", "user": {"name": "Michele", "review_count": 36, "yelping_since": "2010-06-25 04:02:50", "elite": "", "average_stars": 2.97, "fans": 0}}
{"review_id": "TyKOziMLwbpm6B0mDhr-cg", "user_id": "xoJV_T6LRUNJDKXvwUue6A", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for any kind of occasion. Old school Italian with magnificent service and amazing food. Recommended by a local and not a touristy place at all. Look forward to coming back here for another excellent experience.", "date": "2019-07-18 20:27:20", "user": {"name": "Keyaun", "review_count": 8, "yelping_since": "2013-08-24 01:37:31", "elite": "", "average_stars": 5.0, "fans": 1}}
{"review_id": "3nIVBgLgogqZmkNP75yrzg", "user_id": "9M_nk0kA3CTJt6UoxRAK_g", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is one of the best Italian restaurants in the world . Order the side of peppers and the saloon or fennel salad. The veal parm is spot on. The pasta is the best you will ever have.", "date": "2019-06-19 00:10:56", "user": {"name": "Steven", "review_count": 90, "yelping_since": "2011-04-04 15:57:49", "elite": "", "average_stars": 3.32, "fans": 0}}
{"review_id": "UmKo2v-PrieyDHWM2i7iuA", "user_id": "gvCsKxjSv2gDGecVbcMVDQ", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Amazing service.  Food is excellent.  The waitstaff are very professional and know their stuff. Awesome decor.  Loved the experience.", "date": "2019-05-24 02:32:47", "user": {"name": "Maddy", "review_count": 43, "yelping_since": "2010-04-21 22:12:22", "elite": "", "average_stars": 4.42, "fans": 0}}
{"review_id": "luIOpDlbdrX2JS1wrnA_oQ", "user_id": "YD2uKLdHNMXpa4xYo-3eOg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Husband brought me for my birthday in April.  AWESOME FOOD AND SERVICE!!!!  Definitely will return and would highly recommend", "date": "2019-05-16 13:51:09", "user": {"name": "D", "review_count": 8, "yelping_since": "2019-05-15 22:02:13", "elite": "", "average_stars": 4.44, "fans": 0}}
{"review_id": "vFV2FpuEtPUF4LAWK5-tiQ", "user_id": "VJvOMCjU3_PJJR4-RhAkEg", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 2.0, "useful": 19, "funny": 14, "cool": 11, "text": "Do you like white table covers?! Do you like expensive menus?!  Do you LOVE the location and want to take a risk?!  DEBATABLE.  White table cloths and franchise-like entrees priced at $32 per plate is excessive. Good vibes, OK service, and decent food. If you want to pay out your bum for a normal mid-tier Italian dinner, then this is your spot!", "date": "2019-05-12 02:55:06", "user": {"name": "Stevie", "review_count": 84, "yelping_since": "2013-10-17 16:26:51", "elite": "2019,20,20,2021", "average_stars": 4.13, "fans": 12}}
{"review_id": "ZT8dJav-fVajvwWv4XItVw", "user_id": "ad40SGPhCiFFb0Lj_TTklA", "business_id": "qjIN4UbE96Cq6JKwLIQ9VQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Quite possibly my favorite dining experience ever. In Philly on business and came to Saloon for dinner based off of a recommendation from a fellow hotel guest I met in the lobby - so happy I took the stranger's advice. The food was epic and the service phenomenal. If you have a chance to sit at the bar and chat with Frankie, I can assure you that you'll learn a thing or two about life and will walk away with a new friend and one of the best (and most memorable) experiences. I can't wait to come back.", "date": "2019-04-30 02:41:49", "user": {"name": "Jennifer", "review_count": 1, "yelping_since": "2016-11-11 23:08:09", "elite": "", "average_stars": 5.0, "fans": 0}}
