{"business_id": "wUnLSg_GKfEIQ5CQQ770_g", "name": "Vetri Cucina", "address": "1312 Spruce St", "city": "Philadelphia", "state": "PA", "postal_code": "19107", "latitude": 39.9466441, "longitude": -75.1631867, "stars": 4.5, "review_count": 489, "is_open": 1, "attributes": {"RestaurantsAttire": "'dressy'", "Alcohol": "u'full_bar'", "RestaurantsReservations": "True", "BikeParking": "True", "WiFi": "u'no'", "BusinessAcceptsCreditCards": "True", "GoodForKids": "False", "Caters": "False", "RestaurantsPriceRange2": "4", "RestaurantsGoodForGroups": "False", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': True, 'brunch': False, 'breakfast': False}", "Ambience": "{'touristy': False, 'hipster': False, 'romantic': True, 'divey': False, 'intimate': True, 'trendy': False, 'upscale': True, 'classy': True, 'casual': False}", "RestaurantsTableService": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': True, 'valet': False}", "OutdoorSeating": "True", "RestaurantsTakeOut": "True", "HasTV": "True", "RestaurantsDelivery": "None", "NoiseLevel": "u'average'"}, "categories": "Italian, Cuban, Restaurants", "hours": {"Monday": "18:0-21:30", "Tuesday": "18:0-21:30", "Wednesday": "18:0-21:30", "Thursday": "18:0-21:30", "Friday": "18:0-21:30", "Saturday": "18:0-21:30", "Sunday": "17:0-21:0"}, "category_list": ["Italian", "Cuban", "Restaurants"], "stratification_tag": "Italian"}
{"review_id": "XtvUC9-98VSqPV3HsLrRXg", "user_id": "9kZrW2rpmOtu5RLfwhN33Q", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "The staff here was amazing, you didn't feel \"waited on\" you definitely felt they were invested in your happiness. The appetizers were delicious, the signature cocktails phenomenal, and the dinner was planned perfectly. I left full and happy.", "date": "2022-01-17 21:30:23", "user": {"name": "Andrew", "review_count": 30, "yelping_since": "2014-05-05 23:00:22", "elite": "2021", "average_stars": 4.3, "fans": 1}}
{"review_id": "MMiWR0AVGWeSjol50-ozhQ", "user_id": "w3UyPT4x1uCw8Ci430-1nA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Probably the best wine pairing I've ever had! The staff was so knowledgeable and welcoming. The momster and I had the loveliest of times celebrating our birthdays here together!", "date": "2022-01-16 21:04:16", "user": {"name": "Jess", "review_count": 12, "yelping_since": "2015-08-24 15:04:22", "elite": "", "average_stars": 3.54, "fans": 0}}
{"review_id": "f9RDpZLPAvR2QjWRSqBjJw", "user_id": "hNc9ICYav-FcOkcKaGBZDw", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Philadelphia is lucky to have Vetri Cucina. Five years after my first visit (and over two decades after they first opened their doors), Vetri is still making the best food and providing the warmest, most complete dining experience in the city.\n\nEvery impression and feeling from my first visit has only improved. The most recent time I dined at Vetri, my dining partner and I were blown away by the tortellini in seafood brodo (impossibly delicate and yet so flavorful!) and the roasted goat, which was, in the words of my partner, \"the single best bite I've ever had.\" Also, if it's on the menu, get the molten pistachio cake. It's incredible - possibly my favorite dessert ever.\n\nService is always impeccable and welcoming, from the moment the maître d' greets you to the friendly goodbyes as you walk out the door. A shoutout to Bobby - who described the goat dish so wonderfully, I think it made the dish taste even better - and Zeke, who were and have been memorably wonderful.\n\nWe spent over $300 on our meal for two, and it was worth that and more to see every bite bring an expression of wonderment and joy to my dining partner's face. Vetri encapsulates what a special dining experience should be - expertly executed cuisine without the pretention, and an overall experience that leaves diners feeling fuller - both in regards to food and happiness - than when they walked in the door.", "date": "2022-01-03 23:01:43", "user": {"name": "Stefanie", "review_count": 416, "yelping_since": "2012-02-19 18:57:48", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.14, "fans": 54}}
{"review_id": "EA2A-tmH4bvomhwOKU5FCA", "user_id": "iUo7JE5Uj_LsNH0BxXh_kQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The desserts were impeccable. I have a personal thing against lava cakes (they're not bad, but not worth the fuss in my book), but the molten pistachio cake really surprised me. And the palette cleanser? Absolutely crushed it. I did not expect such a unique combination of flavors in Philadelphia. \n\nUnfortunately, I did find each individual savory course a bit \"one note,\" i.e. the amuse (although *intentionally* burnt) only tasted of char, the veal tartare was overpowered with brown butter, and both the pici as well as the branzino were too salty. I did not finish the branzino and my guest and I had to swap some of our dishes. \n\nHOWEVER, service was perfect and that's why Vetri gets 5 stars in my book.  What the food that night lacked was made up for by the rockstar FOH staff. My server kindly asked me multiple times if I would like something instead of the branzino when I didn't seem to enjoy it - it's on me for not speaking up! I didn't want to cause a fuss, but I don't think they would have minded/been mean about it. \n\nAt the end of the day, Vetri may not be the first thing I recommend to someone in town, but the meal ended on a high note and I'd go back in the future.", "date": "2021-12-09 22:30:59", "user": {"name": "Brett", "review_count": 97, "yelping_since": "2021-05-30 23:49:04", "elite": "2021", "average_stars": 4.4, "fans": 1}}
{"review_id": "dQtOMKU3ogpbq1t9FhCjkA", "user_id": "vtY-vWHvrbNWlWHosNG4ZA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "A special restaurant for a special occasion.  Food is superb, the wine options and pairing are equally excellent.\n\nThe highlight for us, luckily for two visits over the past 10 years, was our server Bill.  Easily the best service we have ever experienced.", "date": "2021-11-15 03:35:54", "user": {"name": "Chris", "review_count": 18, "yelping_since": "2011-01-15 01:17:03", "elite": "", "average_stars": 4.22, "fans": 0}}
{"review_id": "Wq_kWyT12hnogckHn8_HEw", "user_id": "nd3J4ng39EnLN5nAiafA4w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not sure how we've gone so many years without trying Vetri but got the chance to visit recently and I was very pleasantly surprised how much we enjoyed our meal. I think I had been hesitant because some people had told me the portions were not enough but I have to tell you we were STUFFED. Between the complimentary appetizer and amuse bouche, I think the number of courses would have been enough. But we added a third pasta and the prosciutto board and it was way too much food for the two of us.\n\nEverything was excellent. Highlights for me were the duck garganelli pasta, the fried pizza dough complimentary appetizer, and my duck breast entree. The other dishes were very good too but those were definitely my favorite. Not pictured are our desserts, the ricotta cheesecake and the chocolate mousse cake. \n\nI also want to highlight that the service was impeccable! My husband spilled his espresso and they covered it up and got him a new one. And I started not feeling too well during dinner and they kindly packaged all our leftovers so well. Can't wait to go back!", "date": "2021-11-12 18:48:32", "user": {"name": "Lam", "review_count": 92, "yelping_since": "2014-11-11 03:30:29", "elite": "2019,20,20,2021", "average_stars": 4.23, "fans": 11}}
{"review_id": "gokow2yQgjajDkU-05KQEQ", "user_id": "NC6wR35fassyqbijJAT6Dg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I really enjoy this place, the food, the atmosphere, the people everybody was accommodating and friendly. It's a place you will have to try for yourself I highly recommend it. I would definitely go back and try other menus.", "date": "2021-11-07 23:44:59", "user": {"name": "Lula", "review_count": 28, "yelping_since": "2018-07-01 23:50:40", "elite": "", "average_stars": 3.32, "fans": 1}}
{"review_id": "lyxAxW1hjg4S9-Rgy0Pi_A", "user_id": "FPcGjxYuC6FghbTKH6CVng", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Each dish was perfection.  The gnocchi was beyond amazing. The pistachio dessert was delightful. Also the wine pairing elevated our culinary experience to a whole new level. Bobby- we hit the lotto having you as both our sommelier and waiter! Enrique- thank you for being the most gracious host!", "date": "2021-09-10 01:56:09", "user": {"name": "Daniela", "review_count": 35, "yelping_since": "2012-04-07 17:14:01", "elite": "", "average_stars": 4.89, "fans": 1}}
{"review_id": "I1wHj-Sc1KYups_ADWsT1A", "user_id": "B7jkcVMabicI4yloopGKVQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 3.0, "useful": 1, "funny": 2, "cool": 1, "text": "I wanted to love Vetri more than I did. We had the tasting menu, and there certainly were some highlights. We ordered the Stuzzichini with the prosciutto and coppa. This was very good, but I didn't care as much for the tigelle which came with it. These little pieces of fried bread had an unpleasant texture.\n\nThe Sweet Onion Crepe was the best thing I ate all evening. It had the purest distillation of amazing caramelized onion flavor that I have ever experience. I would order this again in a heartbeat. I also tried the Swordfish Braciole, which was delicious.\n\nThe Gnocchi was another highlight. The potato-less dumplings had the most beautiful texture, and the brown butter sauce lent the gnocchi a richness that was amazing. I was less pleased with the Spaghetti Alla Chitarra. Overall, I found that the sauce lacked flavor, and I would not reorder this pasta.\n\nMy husband and I split the Veal Milanese. While it was an excellent cut of veal and had some truly beautiful heirloom tomatoes, I felt this dish lacked flavor as well. \n\nBoth desserts that we tried were outstanding. I loved the Black Forest Tiramisu, finding the additional of cherries to be absolutely delicious. I was even more surprised by the Molten Pistachio Cake. This was a delight, and I would order it again.", "date": "2021-08-10 15:15:54", "user": {"name": "Jessica", "review_count": 218, "yelping_since": "2011-09-10 12:28:05", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.53, "fans": 38}}
{"review_id": "MwkapbcYnk4XYZYINRFTWA", "user_id": "Q_O6_WkfTwphki8eIh6L1w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 3, "funny": 0, "cool": 3, "text": "My husband and I went here a couple nights ago for an early anniversary dinner and it was one of the best meals of my life. Service was exquisite, the ambiance was charming, and the food was incredible.\n\nService: From the phone call to confirm our reservation to wishing us goodbye as we left the service could not have been better. Our servers made wonderful recommendations, topped off our wine often, and brought us extra goodies throughout the evening. Note: Service is not fast, it is intentionally relaxed and spaced out so you can enjoy yourself. I never felt like we had to wait too long for any course, but if you haven't been to a restaurant like this before the paving might seem unfamiliar. \n\nAmbiance: The restaurant is on two levels of a row house. It's definitely not a large space, but they've made the most of it.  I didn't feel crowded at our table as there is plenty of space between tables so everyone has some privacy. But tables were close enough so we could see people's food as it was being brought out to their tables, which we enjoyed. Lighting was low, but not too low, the bathroom was exceptionally clean, the dishes and glasses all beautiful and charming. \n\nFood: They offer a structured menu from which you choose one option among many for each course. Every single thing I ordered was amazing! From the savory caramelized onion crepe with truffle, to the locally foraged mushroom ragu pasta, to the veal Milanese, to the pistachio cake with strawberry ice cream, every dish was exquisite. I\n\nAlso: We sprang for the wine pairings with each course and were really glad we did. Supposedly we were supposed to get a half a glass per course but it was definitely more like a whole glass each time! The wines were perfectly chosen for each dish and our servers were happy to tell us all about them. \n\nMy husband took me to the French Laundry for a milestone e birthday a few years ago when we lived in California, and I enjoyed Vetri Cucina more, and that's saying something. If I could give 6 stars, I would. So, if you are looking for the perfect restaurant to celebrate something significant, or to propose, this is definitely the spot!", "date": "2021-07-19 20:40:25", "user": {"name": "Kristin", "review_count": 40, "yelping_since": "2011-01-26 14:25:20", "elite": "", "average_stars": 4.23, "fans": 1}}
{"review_id": "_q9pv832tkZ_J-ja39L6ag", "user_id": "TRbGw0FJ5zxbQHR-ZHa9hg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "I made a reservation on Tock, this restaurant's online booking portal, on June 12 th for July 16 th. They required a $50 credit card charge to hold the reservation which I provided on American Express. On the night of the reservation they said they had no reservation for me and turned me away. I had given up a reservation at Zahav to eat at this place and ended up eating bar food after driving 5 hours to Philly. This places online reservation portal obviously does not work so please check before you go and get stuck like we did.", "date": "2021-07-19 20:18:51", "user": {"name": "Mia", "review_count": 23, "yelping_since": "2020-03-11 21:15:37", "elite": "", "average_stars": 2.58, "fans": 1}}
{"review_id": "638eg71w65lb1Xh6twdQbQ", "user_id": "QMjUfe5jlad2PWUWu-_FhQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Vetri Cucina is phenomenal. Hands down one of the best meals we have ever had. It's a beautiful restaurant  located in a town house in Philly and offers a $125 pp prix fix style menu. Note that the website now says $135 pp.\n\nWe had;\n\nFoie gras pastrami - excellent \nTorched Hamachi - very good\nBarbecued quail - excellent \nGrano Arso Tonnarelli - very good\nSwiss Chard Gnocchi - excellent \nVeal Milanese for 2 - incredible (best veal Milanese I've ever had) \nChocolate Polenta Soufflé - good", "date": "2021-07-09 20:41:46", "user": {"name": "Anthony", "review_count": 30, "yelping_since": "2021-05-16 22:19:03", "elite": "", "average_stars": 4.53, "fans": 0}}
{"review_id": "TT238qF-ZSm7gxLroghigw", "user_id": "BXBtET2Kk7MmsqEXYySXtg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "We were blown away with our experience at Vetri!\n\nThis is both a warning and a word of encouragement...it's going to be expensive! They have a $125 prefix plating option, but if you can swing it, you will see it is well worth it. \n\nHonestly, walking into the restaurant, I was king of surprised. I knew this was going to be a high-end/fine dining experience, but the you could pass right by the building if you aren't familiar with the city. It's like it intentionally wants to be a secret. And the decor inside is super homey, antique-ish, rich, and warm (not a ton of glitz and glam.) Yet, as soon as you sit down, you see how it is a fine-dining experience. They greet you with a complimentary cocktail, and the service is just fantastic! So friendly and professional, helpful, and provided a perfect balance of attention and letting you enjoy yourselves. \n\nThe food was really good too! Can't complain there. The portions were small, but fair with the amount of plates you get. I left feeling comfortably full. \n\nThey took note of it being our anniversary and added a nice touch to our dessert.\n\nEverything from start to finish was just top notch! Would definitely recommend visiting.", "date": "2021-06-28 03:09:15", "user": {"name": "Vincent", "review_count": 206, "yelping_since": "2020-01-28 03:25:01", "elite": "20,20,2021", "average_stars": 3.96, "fans": 11}}
{"review_id": "ua57LutwtUVzNaCynEQrtQ", "user_id": "nfIBrLEHd-oPQNmV7cDPgw", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This was truly an amazing experience.  The food was EXCELLENT and the service was fantastic. My favorite was the pistachio cake and the hamachi crudo. Highly recommend it to everyone!!", "date": "2021-06-27 23:55:19", "user": {"name": "Vivian", "review_count": 56, "yelping_since": "2015-10-28 03:06:46", "elite": "", "average_stars": 4.82, "fans": 0}}
{"review_id": "2ZR40OC-2T_wcifMbESv7A", "user_id": "dzHjJagTKouGS3h9c_90tQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Lovely place to hold a special occasion dinner. You have a limited number of options for each course, which means they're all perfectly executed. Service is unmatched in the city. Staff is knowledgeable and willing to share what they know.\n\nYou're able to order extra items for a surcharge, which I recommend if you're unsure about what to choose.", "date": "2021-06-24 17:07:06", "user": {"name": "Alejandro", "review_count": 27, "yelping_since": "2020-04-03 21:16:45", "elite": "", "average_stars": 4.48, "fans": 0}}
{"review_id": "1FtodI9Wn2uIRh06Qn8zUw", "user_id": "fMm9byMvqg7ftyq9s84RuQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "We had high hopes for this place, but at $125 per person before tax + tip it was just... not that worth it, unless you have unlimited money to spend. I've had meals for half the price which impressed me much more than Vetri. Coming from out of town, Vetri was supposed to be the food highlight of our trip, but everyone in our party was let down.\n\nThe good:\n- Atmosphere was nice, dimly lit and relaxing\n- Service was friendly\n- The appetizers and desserts were fantastic!\n\nThe meh:\n- The rest of the food was decent but not excellent. I'm writing this review one month later, and besides the appetizers and desserts I can't remember the rest. Pretty unmemorable.\n- If I hadn't eaten the complimentary bread, I would not have left full\n\nAlso, we found out afterwards that the cocktails they offer you in the beginning are complimentary, so make sure to get them. We didn't know and they didn't tell us so we didn't opt for them. The rest of the drinks (coffee, tea, additional alcohol, etc.) are not included.\n\nTo be totally honest, I'm probably not the target demographic for this restaurant since I rarely do high dining. If you have major cash to spend, maybe you'll find Vetri totally worth it for the price. But if this is a bit of a splurge and you're spending this much for a special occasion, I would reconsider.", "date": "2021-06-18 09:15:59", "user": {"name": "Allison", "review_count": 66, "yelping_since": "2013-08-01 09:07:44", "elite": "2018,2019,20,20,2021", "average_stars": 3.76, "fans": 11}}
{"review_id": "JpdTINXCLz4LsJzR_b2XUA", "user_id": "Sp1_SPbLT89WlLv1j-78Ng", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "We came in on a public holiday and we're served so quickly after a long day. The food was fresh and the place was clean. It was well priced and the servings were good.", "date": "2021-06-01 01:26:01", "user": {"name": "Justin", "review_count": 15, "yelping_since": "2013-05-14 20:35:36", "elite": "", "average_stars": 5.0, "fans": 3}}
{"review_id": "uzbMMzCkQ4MojxO_ChNh9g", "user_id": "VqNURaDH9wxCpiRTNzsZvw", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pasta dishes are superb but the wine and cocktails were not well matched both times we have come here. Our waitress made excellent recommendations though and no complaints about the service.", "date": "2021-05-26 02:40:47", "user": {"name": "Erin", "review_count": 57, "yelping_since": "2011-05-27 04:07:51", "elite": "", "average_stars": 3.32, "fans": 1}}
{"review_id": "J3hkuzHP-mx5CZj2PJUtiw", "user_id": "heSD8DBMNMW77Eqi31I9Xg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 6, "funny": 1, "cool": 2, "text": "When I go to dinner I expect to buy dinner, but going to Vetri means paying for an experience! \n\nIn past visits the offering was a chefs choice menu with several courses, usually including a pasta. On this recent visit diners could choose their selections. \n\nFish, pasta, and offerings far outside of traditional fare. Exquisitely presented with various sauces or complimentary flavors that will take you on a culinary adventure found in very few places nationwide. \n\nA small venue of a hundreds year old row home allow a host of knowledge, passionate, professional servers with complete understanding of the dishes to fill in every detail of what you are eating. \n\nGet the wonderful wine pairing from the resident sommelier and let her take you through Italy and describe varieties you likely haven't tried. \n\nFun. Just fun and palate expanding. An experience you'll cherish.", "date": "2021-05-24 17:51:15", "user": {"name": "Shaun", "review_count": 357, "yelping_since": "2016-11-26 16:48:02", "elite": "2018,2019,20,20,2021", "average_stars": 4.34, "fans": 8}}
{"review_id": "mnvDCNfzm2K-e-fp-1LFUA", "user_id": "ZphkMDgCzXzhjnI9gxErTA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We celebrated our 50 th wedding anniversary at Vetri Cuccia, having the most amazing dinner one only can dream of. The entire staff was beyond excellent, as was each course. This wonderful restaurant has our highest recommendation.", "date": "2021-05-15 18:17:19", "user": {"name": "Christine", "review_count": 5, "yelping_since": "2021-01-17 21:09:25", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "cDkSOaFDzNf1IZvq_0QlTQ", "user_id": "MdYhRwctt21HA2AbtNvSxw", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "It's been a long time since I've sat in a fine dining restaurant and I'm so glad my love chose this one. It was his birthday so we decided to visit this restaurant. He's been many times in the past and it was my very first time. The dining experience was very intimate and cozy we had a great view of the chefs table from our location. The service was phenomenal we were greeted and taken directly to our seating area. Then our server explained the menu and discussed a special that would replace the \"second\" portion. The cocktails were amazing and we didn't have to wait long after finishing a course to starting a new one. I'm looking forward to going again hopefully without it being a special occasion.", "date": "2021-05-04 13:33:35", "user": {"name": "Kyrah", "review_count": 58, "yelping_since": "2015-05-07 14:22:38", "elite": "2018,20,20,2021", "average_stars": 4.47, "fans": 1}}
{"review_id": "kf07NNsSN9kHxUku7dsXkA", "user_id": "2XbTR161cR0ARw9KMI7r7Q", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Without a doubt my favorite restaurant - I like it more than the few Michelin 3-star restaurants I've been lucky enough to eat at. Nothing about it - food, service, comfort - is less than amazing. Worth making a special trip for.", "date": "2021-04-28 02:18:14", "user": {"name": "Rick", "review_count": 17, "yelping_since": "2014-08-14 22:59:00", "elite": "", "average_stars": 4.17, "fans": 1}}
{"review_id": "EkOnvpDJX5hJ_2rKi8iB7A", "user_id": "K02kOM_HFFL8_3GlPkOG2g", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Did the tasting menu with wine pairings- so delicious and so much fun! Waitstaff was great, walked us through everything, answered all our questions, and taught us a lot about Italian food & wine! Perfect night out.", "date": "2021-04-07 11:40:15", "user": {"name": "E", "review_count": 13, "yelping_since": "2013-07-11 05:28:11", "elite": "", "average_stars": 2.79, "fans": 0}}
{"review_id": "ZlAnPUWY6kwrC2YPOtz51A", "user_id": "f2qDQ8KnU6szwpTiaz9tVg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Overall: This was a bucket list dinner and well worth the wait. We had a great time at Vetri eating til we burst. You can tell that the chefs have incredible skill and training. Even the bread for the table is house made and the lightest fluffiest bread I have ever had. \n\nThe sweet onion crepe was one of the best things I've eaten, ever. The broiled oysters were fabulous. The branzino was delicious and buttery. The chocolate polenta cake was literally the best chocolate cake I've ever eaten. \n\nThe only thing I wouldn't do again is the spinach gnocchi. I believe I heard the waiter explain that they dont use ricotta or flour, it's basically just a spinach puree dumpling. While wonderfully done, I just don't personally love spinach this much that I can skip all the other things that go into a gnocchi. \n\nThe last thing I wanted to say is that Vetri felt: cozy. It felt comfortable and approachable despite being high end dining. Not at all pretentious. \n\nWhile I can't say we'll be back any time super soon, it was an awesome experience and I'm grateful I finally got to try it!", "date": "2021-04-05 15:03:21", "user": {"name": "Alyse", "review_count": 181, "yelping_since": "2014-06-06 16:09:40", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.59, "fans": 9}}
{"review_id": "PRFwgeNvG_Hkg1VqePG7uw", "user_id": "N287myreS385BJ45fMVDrQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Always amazing!!! The wine pairings are perfect. Service is out of this world. One of the best!!!", "date": "2021-02-13 23:13:23", "user": {"name": "Tom", "review_count": 50, "yelping_since": "2011-01-09 15:02:31", "elite": "", "average_stars": 3.14, "fans": 0}}
{"review_id": "8G26yNsa-c6GF8Jn0ruBhQ", "user_id": "4AOchnqKBnF-ivpq9CsYkw", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The service and ambiance was wonderful,  complimentary aperitifs and petit fours were a nice touch too. But everything else left us wanting...even with a nearly $500 bill for (2) people.  We were so underwhelmed especially as this was our first visit to one of Marc Vetri's restaurants.", "date": "2021-02-02 00:38:28", "user": {"name": "Emma", "review_count": 62, "yelping_since": "2013-08-23 01:51:01", "elite": "", "average_stars": 2.72, "fans": 1}}
{"review_id": "q4Wg9KzKyCmY4HGEUJsB8g", "user_id": "2g0hEKKDpjo3rhMzvkyc9w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 2, "funny": 1, "cool": 0, "text": "So. Funny how I haven't left a review for Vetri yet, even funnier that I waited for the End Times to do my review... But let's lean into it.\n\nMy wife and I have now been to many tasting menus. We make it a point to go to the best rated, fancy-pants-iest restaurants wherever we go. It's worth mentioning that whenever we go to one of these restaurants and they ask us where we are from and we answer that we are from Philly, the other restaurants always ask \"Oh, have you been to Vetri?\" We always answer (with pride) \"Yes. Twice!\"\n\nWell, thrice now. \n\nThe highlights, in no particular order, of this very special Covid-mas episode:\n\nThe pistachio cake was easily the best dessert I've ever had, ever. Considering it didn't include chocolate, peanut butter, or bacon, that's pretty damn impressive.\n\nThe wine pairings varied from \"nicely complimentary\" to \"perfectly paired\" to \"my expectations were shattered.\" Every course we were pleasantly surprised as there was always a break out pairing.\n\nFor a very cold, very plague-ridden time of year, they had such an amazing setup that last year I would have chosen it for a lovely Christmas-themed experience even in non-Covid times.\n\nThe experience tonight made me realize just how, for lack of a better term, \"advanced\" the cuisine at Vetri is. My palate grows, is educated, is elevated, every time I come here. The fact that the entire experience is limited to Italian dishes and Italian wines, without being constrained by Italian tropes was nothing short of amazing to me. It makes me feel incredibly fortunate to be able to appreciate it.\n\nTLDR: The question you should be asking yourself is not \"whether you should go to Vetri\", but rather \"can you afford to miss it this season\"?", "date": "2020-12-06 02:14:42", "user": {"name": "Jordan", "review_count": 72, "yelping_since": "2011-07-17 15:29:57", "elite": "", "average_stars": 4.72, "fans": 0}}
{"review_id": "pYY5g0pdIoW6waLpOi9QqQ", "user_id": "VHWyOuUTDtBySUMNC8VIBQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wow what an experience! Great service, drinks, and food. Our waiter was super attentive and had great recommendations. All staff were always available for questions or help. The food was so delicious. Pictures do not do the food justice! The pastas are some of the best we had ever had. Each dish was perfectly composed. We had the foie gras as an add on that had such a great flavor profile. I forgot to take pictures of dessert, (probably because they looked so good we ate them immediately) but they ended the meal on such a high note. Will definitely be coming back!", "date": "2020-11-12 11:03:47", "user": {"name": "Avory", "review_count": 13, "yelping_since": "2020-01-07 05:06:58", "elite": "", "average_stars": 4.08, "fans": 0}}
{"review_id": "eRzbmoC4r4F-JvDtnUoRXg", "user_id": "Ym6ohF2SaxWEzz_AygZ1dQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Everything was delicious. We started off with the prosciutto board which I didn't get a picture of but it was delicious. The prosciutto was made by Vetris friend in New York. Everything else pictured was delicious and beautifully prepared. Service was excellent and we received complimentary items which is always a plus. It was a great place to spend a romantic birthday celebration. Will definitely be back", "date": "2020-11-03 15:24:17", "user": {"name": "Erika", "review_count": 6, "yelping_since": "2018-02-22 03:50:25", "elite": "", "average_stars": 4.57, "fans": 0}}
{"review_id": "1eLBw2s1Q_HBiO4rUTEu7A", "user_id": "XMqdQ88lUs3RVqFia3JjzA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent, upscale dining in the heart of Center City. Perfect for special occasions and intimate celebrations. Treat yourself and someone you love.", "date": "2020-10-26 19:47:30", "user": {"name": "David", "review_count": 38, "yelping_since": "2017-07-23 19:20:38", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "dO83l_CMd6XfJisNUpKYFQ", "user_id": "js1zmxXXUrKsWgGE6I4rwg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Service was excellent, but the food could have used a little more seasoning. Over all it was a great experience.", "date": "2020-10-19 15:46:19", "user": {"name": "Simi", "review_count": 5, "yelping_since": "2017-12-13 20:30:10", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "H-MePOKdW2xvEQ6a00_2qw", "user_id": "HiBq4PxEa_cjF385B-5b9g", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "It would be easier to list the things that were negative about this experience than those that were great. So here were the things that were wrong: the meal ended too soon. Here are the things that were right: everything else. \n\nFrom the hospitality to the efficiency to the quality of food, this experience was absolutely the best of the 4 times I've been here. I really can't find much of a flaw with any dish we were served. The seasonal additions were incredible. The fish was perfectly cooked. The guinea hen was tender and the jus was out of this world. The smoked pickled mushrooms...tell me the last times anyone has ever had them. The duck breast was great. The wild boar ragu was awesome. The fluke was insane. \n\nThough the price is steep, it's absolutely worth it. Best food I've ever eaten, and it's not even close. Great experience!", "date": "2020-10-18 02:45:26", "user": {"name": "Andrew", "review_count": 50, "yelping_since": "2014-09-25 22:41:18", "elite": "2021", "average_stars": 4.17, "fans": 0}}
{"review_id": "SnU7p3PQEISMvF6sWEDXag", "user_id": "wzGTuG1Xi8ZZV04fgBUw3w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We were supposed to be getting married in Tuscany, Italy at the end of August but had to change plans due to the pandemic. Instead, we hosted a micro-wedding event for our immediate families in our own backyard with an unbelievable 5 course tasting menu prepared by the Vetri Cucina team. The team at Vetri Cucina went above and beyond to make our day special. They prepared an incredible menu and advised us on wine pairing options too. The food, service, communication, professionalism, clean up, everything was off the charts. They even designed personal menus for each guest signed by the chef himself. I can't believe that a meal that delicious was prepared in my own kitchen!! Marc Vetri, I can't thank you and your team enough for being part of our big day. Thank you Chef!", "date": "2020-10-15 15:22:31", "user": {"name": "Allison", "review_count": 5, "yelping_since": "2013-05-13 22:51:35", "elite": "", "average_stars": 4.8, "fans": 0}}
{"review_id": "s8UDtc9VdTNN2bAX47kBFg", "user_id": "6qZBWG97olYq6HIwIzIj3Q", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 13, "funny": 4, "cool": 9, "text": "Vetri has been on the list for a while. I am glad that Philly opened up indoor dining when they did. I was able to make the trip to take my gf for her birthday dinner. This is definitely a special occasion kind of establishment. So save your pennies and go to Vetri when you want to splurge. I truly believe that if Michelin gave stars in Philadelphia, Vetri would be one of the frontrunners. For me the entire experience, start to finish, was 5 stars. We showed up about ten minutes early for our reservation and were given two aperol spritz to enjoy while we wait. We were called in shortly thereafter to be seated. \n\nAs we walked up the stairs to our table in the upstairs dining room we were greeted by any staff we encountered on the way. While this is without a doubt fine dining, there is no pretentiousness lingering in the air. You feel as though you are being welcomed into someones home. Our waiter, Bobby, just made sure the entire experience was well rounded. He was very welcoming, extremely knowledgeable, and attentive. Everything from ambiance, staff, music, etc, set the tone for an incredible dining experience. \n\nNow on to the good stuff (the food). I won't cover every single dish specifically, but I will touch upon my personal standouts, as I couldn't pick a definitive #1 (that's a good problem). The prosciutto and the maple smoked duck breast were the perfect way to get the jowls salivating lol. The sweetbreads dish was bomb. They still managed to hold on to a little of the crispiness while covered in that delicious cream sauce.  The pappardelle with rabbit bolognese is an unassuming dish that packs a very well balanced flavor explosion. The stuffed guinea hen (prosciutto and foie gras) was another amazing dish. We also had tenderloin tartare, lobster tagliolini, and eggplant Milanese. We opted for the wine pairing and it was definitely worth it. Every wine was great and paired well with each dish. Even the dessert wines (which I am not normally a fan of) were great!  For desserts we had the molten peanut butter cake with Concorde grape gelato and the coconut semifreddo. The play on peanut butter and jelly was great. It's what you wish every peanut butter and jelly sandwich you ever ate tasted like. The sorbet that accompanies the semifreddo is the perfect refreshing palette cleanser to end the meal. Great meal (from the amuse bouche to the petit fours), great experience. I would highly recommend it. If you ain't treatin' yourself, you're cheatin' yourself! ENJOY!!!", "date": "2020-10-05 13:36:42", "user": {"name": "Sebastian", "review_count": 462, "yelping_since": "2011-11-05 22:38:59", "elite": "2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.76, "fans": 91}}
{"review_id": "YKIhRMaqtq4PbL_aOebD4w", "user_id": "jB3afU8PV5Cxd4q0njA_Fg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Most amazing experience. From the service to the food. A total gem in Philly 11/10 recommend. Danielle our waitress was absolutely amazing and her deep knowledge of the food and wine made us feel like we were in Italy !", "date": "2020-10-05 02:14:12", "user": {"name": "Sofia", "review_count": 2, "yelping_since": "2019-09-19 17:44:08", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "qLFepzv0qivy_4YZA01jIQ", "user_id": "6C8Ne6yRu6TzBLbhfhdduw", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 9, "funny": 0, "cool": 1, "text": "tl;dr a Philly fine-dining veteran, Vetri serves up incredible Italian food with a generous side of nostalgia\n\nVetri is no stranger to conversations about the best restaurants in Philadelphia, promising an unparalleled take on Italian dining. I've been meaning to give it a whirl for years, but life has blocked me out last-minute each time I've scheduled a reservation. And, ironically enough, the wake of the pandemic was finally my time. Indoor dining mid-COVID is a new challenge for restaurants and restaurant-goers, alike. Fortunately, Vetri did a phenomenal job of ensuring social distancing throughout our visit -- most notably, were separated from other tables by both plenty of room and by physical dividers.\n\nWalking up the stairs to Vetri's dining room felt like being welcomed into an old-school Italian home. A center island and espresso machine are on full display in the space, and the lime-green walls are highlighted by Victorian guardrails and wooden accents. The semblance of traditionality is sharply contrasted by a deep red blown-glass chandelier, while 50s music plays unobtrusively in the background.\n\nWe were welcomed with a complementary spritz, a summer crowd-pleaser with an orange liquor base and a slice of fresh fruit. As we browsed the menu, our server eagerly highlighted some of her favorites. We opted for the Beef Tenderloin Tartare, the Sweet Onion Crepe, the Swiss Chard Gnocchi, the Corn Anolini the Dry Aged Pork Loin, the Roasted Baby Goat (a $35 upcharge), the Chocolate Polenta Souffle, and the Panna Cotta with Poached Peaches and Raspberry Granita.\n\nTo kick off our meal, we were ushered a bowl of focaccia and whole-grain sourdough. The airy center of our bread was contrasted by a delicately charred crust, complemented by a salty butter. We then were offered an amouse-bouche: cucumber-zucchini gazpacho with a tempura squash blossom. Each bite tasted like summer, transporting me to childhood afternoons rolling down grassy hills.\n\nOn to our antipasti, the tartare sported a blast of acidity from the red onion and capers. Admittedly, I would have preferred the crisp of traditional toasts over the somewhat doughy gnocchi friti, but the dyanmic flavors were a strong win. Meanwhile, the crepe was magical--the condensed onions almost had a jam-like consistency and the smokiness of an open fire, bound by a rich pasty and truffle cream sauce. By transforming the essense of onion into something brand new, it's no wonder that this is one of the Vetri's classics after 2 decades.\n\nTo the pasta course, the gnocchi themselves were heavenly pillows, with a richness of butter and ricotta that gave way to the delicate flavor of the chard. Meanwhile, the anolini highlighted the sweetness of summer corn, echoing the sweetness and happiness of the best corncake of my childhood. This was doubled by the zing of salt from Osetra caviar. \n\nFor the entrees, the goat was the fancy rendition of a holiday roast: the polenta itself could stand its own, and the meat. (especially the crispy skin) was loaded with flavor from spices and flame alike. This was arguably the best dish I've had the pleasure to enjoy this year (and well worth the $35 supplement). On our other plate, the espresso reduction and the duo of honey nut squash were the standouts, adding a desserty dimension to an otherwise standard slice of meat.\n\nFinally to dessert, the souffle was masterfully cooked, the dynamic dark chocolate finding the ideal balance between dense and gooey, and complemented by a vanilla gelato and cocoa nibs. In contrast, the zing of the summertime fruits brought the lightness of the last days of summer to the panna cotta. Lastly, we were offered 2 flavorful final bites: a fruit-creme truffle and an almond cookie.\n\nAt $110 for the COVID 4-course tasting menu (a relative steal compared to the $165pp just a few months ago), Vetri undoubtedly is a meal fit for a special occasion. But just the goat alone is reason enough to splurge on the experience. While I wondered if I would be missing out on the full Vetri experience, I nonetheless and left feeling contently full (rather than overwhelmingly so). Most importantly, Vetri left me with a memorable experience, both in exciting new memories and in ones I haven't recalled in years.", "date": "2020-09-13 22:43:44", "user": {"name": "Austin", "review_count": 211, "yelping_since": "2016-12-30 22:23:33", "elite": "2019,20,20,2021", "average_stars": 4.08, "fans": 25}}
{"review_id": "Lg0gnSeoqz94MWYiOsdv8w", "user_id": "IO0mnEw_c1FeJkQvg5t5eg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am a nurse at the Hospital of University of Pennsylvania and I want to give Vetri a BIG THANKS for sending over multiple free and scrumptious meals to our staff! Food is outstanding and gesture SO KIND! \nThank you.", "date": "2020-07-13 12:25:30", "user": {"name": "Anne", "review_count": 3, "yelping_since": "2020-07-13 12:21:03", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "JF4UT_mC2WqXc6JyKqSWYA", "user_id": "mniupzN7JDdP6Ke0lhQn8w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Let me begin this review by saying that it has been a dream of mine to dine at Vetri. \n\nI work in Chicago as a restaurant manager/beverage director at a fine dining restaurant. Additionally I lived in Italy for 5 years. \n\nThe result of the visit leads me to conclude that Vetri is among the finest Italian restaurants in America.\n\nFirst and foremost, compliments to your FOH staff. I was so impressed by the staff's knowledge, disposition, and attentive service. \n\nThe decor is simplistic yet thoughtfully connected to the Italian theme.\n\n As regards food and beverage, the food was as good as mainland Italy. Stand out dishes were the onion crepe, hamachi crudo, the spinach gnocchi, mushroom fettuccine, and duck confit. \n\nThe wine selection is well thought out representing both classic producers as well as some more unique selections. \n\nThe icing on the cake was that Chef Marc was in house and visited the table multiple times. \n\nDining at Vetri was a dream come true and it did not disappoint. Complimenti!", "date": "2020-03-07 16:49:38", "user": {"name": "Paul", "review_count": 5, "yelping_since": "2017-03-01 16:39:38", "elite": "", "average_stars": 4.4, "fans": 0}}
{"review_id": "7aGK9WTQINDIsGQ2mD6png", "user_id": "4krxPxqEL6By9F-4Y1BpRg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Set tasting menu of many courses that are each independently delicious. This included 3 bread servings! They accommodated a vegetarian and non-fin fish diet.  Delicious sauces and creative combinations served on beautiful Italian china.  We dined for over 2 hours and felt perfectly satisfied.", "date": "2020-03-05 04:34:08", "user": {"name": "Holli", "review_count": 58, "yelping_since": "2014-08-27 03:34:46", "elite": "", "average_stars": 4.13, "fans": 0}}
{"review_id": "G93OrHOR-i9jNelpOwwiuA", "user_id": "5kcLlhJPLJL_GLwrAdbZAA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "If you are celebrating a birthday or special event, Vetri deserves serious consideration for that rare memorable meal. \"Oh, my God, don't you remember the /fill-in-the-dish/ you had at Vetri? Wasn't it orgasmic?\" That's the type of place Vetri is. For those of you who've never had food that was so good it was orgasmic, I cannot describe that feeling to you. You have to experience it for yourself. The meal started with a wine spritzer, a plate of assaggi, and a crudité. The highlight was the foie gras torchon on toast. Sandwiched in between the layers was a fruit marmalade. It was heavenly. Our next courses were bison tartare with black caviar and potato dumplings and hamachi crudo. I thought the foie gras was great. The tartare was orgasmic! Crazy good. I had to control my emotions. Our next courses were a prosciutto cotto and a vidalia onion tart. I had hunted a hog last year and had my fill of pork products for a long while. The prosciutto reignited my love for pork products. Such exquisite flavor with the nuts and peppers! We had five pasta dishes next and they were all very good to incredible. I felt like I was eating at Babbo! The spinach gnocchi has always been my favorite. Best gnocchi in Philly. The almond tortellini was outstanding. I'm allergic to almonds and I still ate it, because - fuck it - it was that good! By the way, if you are a true foodie, you'll work through your allergies... just like the time my throat was closing when I ate macadamia-encrusted opa and thoroughly enjoying it as if it were my last meal on earth! Our main courses of capretto (baby goat) with soft polenta and duck with chicories and 'nduja were especially satisfying. \"I encourage you to pick up the chop with your fingers,\" our server recommended. It was finger-licking good! Since it was my dinner companion's first time at Vetri, his meal was comprised of classics, such as the spinach gnocchi and the onion tart. A palate cleanser of grapefruit sorbet was refreshing. Our desserts were chocolate polenta cake and cheesecake. At the end of the meal, I was presented with a goodie bag with a package of petit fours, biscotti, and an autographed copy of the month's menu. As always, Vetri never fails to impress and remains one of my favorite restaurants. It's expensive, but totally worth it for the food, ambiance, and service. It's a complete restaurant experience. When we left the restaurant, there was already a long line of people waiting for the next seating.", "date": "2020-03-01 02:01:28", "user": {"name": "Clare", "review_count": 438, "yelping_since": "2008-12-20 00:19:50", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.76, "fans": 36}}
{"review_id": "fFDhmtNn24SuN9FCgOK-OA", "user_id": "THJo4sOXgM4jxA9UUocJag", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "Overall, my dinner at Vetri was one of the best meals I've had in my life- maybe even top 5. However, this review is really 4.75 stars because one of our dishes was less than satisfactory which I will explain later.\n\nIt's a small spot with only 30 something seats. My husband and I were seated in one of the front windows which was a great table. Our service was excellent from start to finish- we were a little early to our reservation and the hostess gave us a complimentary aperol spritz to sip on while we waited. Eric was our server for the night and he was excellent- well versed on each dish and very attentive.\n\nI love a good tasting menu and the best part about Vetri's is that they give you the option to 'yes' or 'no' certain items- they let you see the menu and if there is something you MUST have or, on the contrary, something you do NOT want, you can let them know ahead of time. The other huge plus about Vetri's tasting is that not everyone at your table gets the same set of courses! That means that I, since I dined with my husband, was able to taste even more courses than I would have if we had all the same dishes. Here is a quick rundown for anyone visiting Vetri in the near future:\n1. starters included mozarella, the most delicious fennel crusted with parm, and an amazing pastrami foie gras. \n2. next up was the hamachi crudo and the bison tartare. Between the two, the bison was the outstanding dish and I could have kept eating it all night. The hamachi was great but the fish + citrus combo is not my favorite so I much preferred the tartare. \n3. the sweet onion crepe, diver scallops and prosciutto cotto were next, all of which were absolutely divine. However, the prosciutto was the clear winner to me and may have been my favorite dish of the entire night. \n4. next up was our first of two pasta courses. I loved that the first round was a small sampling of three of their dishes so as not to overwhelm or stuff you with pasta. We had two plump spinach gnocchis, two almond tortellinis with truffle sauce (this was one of my must-haves), and two ricotta raviolis. These three were equally stunning dishes.\n5. the second round of pasta were slightly larger servings, enough for a few bites each. We had the tajarin with mushrooms and the busiate with pork shank ragu. Of these two, I preferred the tajarin (i love a pasta with mushrooms) over the busiate, which I found to be a little bland and lacking in the vibrant flavors all of the preceding dishes had. Overall, however, I definitely preferred the first round of pasta dishes over the second.\n6. the next course was our 'secondi' which I had not paid much mind to when looking over the menu at the start of the meal so I had not given a preference. My husband received the capretto with polenta which was lightyears ahead of my dish although not my favorite of the night. I received the bollito misto which is my reason for the 0.25 star deduction... this dish was so underwhelming and disappointing I was left a little shocked that the same kitchen could turn out all the dishes mentioned above and this one. To be fair, I do not care for stews or crockpot dishes because, to me, the flavors all blend together into one taste which I hate. This is what the bollito misto tasted like since it is literally just meat and vegetables boiled together. I understand that this is probably a very traditional italian dish but there was nothing about this dish I liked. Even the accompaniments did not seem to go with the rest of the dish (the salsa verde, although good on its own, seemed especially out of place). \n7. Thankfully, dessert picked right back up where we left off at the pasta and all three dishes were fabulous. The lime posset was definitely the underdog here but still good. The hazelnut praline semifreddo and the pistachio flan were BEYOND... and I don't even know how to describe them so just trust me when I say you need to try these.\n\nOk, so now we get to the price. Yes, it's a pricey tasting menu but for $330, the cost of two people, we got to try 15 dishes, not including the starters, the vast majority of which were what I call 'mind-blowing' dishes (aka I cannot make this at home and I have NO idea how they made it taste so good). Vetri is a very high caliber restaurant and it is obvious why they have been around for over 20 years now. I like to think my very disappointing entree was a one-off since almost everything else was outstanding. I will definitely return.", "date": "2020-02-27 21:12:23", "user": {"name": "Courtney", "review_count": 215, "yelping_since": "2013-09-30 23:11:14", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.22, "fans": 12}}
{"review_id": "zQaM0SA9XH9J2-1JdhqkXA", "user_id": "qSEk5dO6UUl_9H5uNyfRJQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have never been more excited for a meal and my hope for an outstanding experience was certainly realized.  You were made to feel special from the moment you walked in.  We were seated,  and greeted by our server who explained the menu perfectly (we dined on a Saturday,  tasting menu). We were then given a wonderful aperitif of prosecco with some fruit.  The meal,  from the first course of appetizers up to the espresso and dolce was elegant, well crafted and stupendous.  Most memorable was the goat,  the almond tortellini and prosciutto cotto. But my goodness,  everything was outstanding.  Highly talented m recommend and we will be back.  I want to do the wine pairing next time!", "date": "2020-02-24 04:13:30", "user": {"name": "Joe", "review_count": 18, "yelping_since": "2014-03-18 18:52:40", "elite": "", "average_stars": 3.91, "fans": 0}}
{"review_id": "jebL-x9bekKSLplPnBxpgg", "user_id": "ETD4yYfJAXbfZuIK-3xLyA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I can't say enough about how amazing our dining experience was at Vetri Cucina. We came here the night of our engagement for a very special celebration. When you first sit down, they offer you a complimentary glass of champagne (which they also refill if you don't order any wine) and present you with that evening's menu. You are encouraged to communicate the dishes that you would be most and least interested in, as they try to tailor the meal to each diner's preferences. Each dish is on the small side, but with so many courses we were definitely stuffed by the end of the night. I also loved that my fiancée and I were presented with something different at each course, so we could essentially try double the number of items. All the food was exceptional, but the pastas were OUT OF THIS WORLD! They were truly some of the most thoughtful and well-executed pasta dishes I've ever eaten.\n\nThe service was first-class, as well. Always being sure to refill our waters (and champagne), answer any questions, and clearly explain each and every dish. They definitely do everything they can to elevate the experience and make you feel special. And this place is certainly reserved for very, very, very special occasions. For us, it was likely a once-in-a-lifetime meal, since it was certainly the most expensive meal either of us have ever had. Having said that, if you are a foodie like me and can splurge on a memorable night, I would say do it.", "date": "2020-02-22 16:41:29", "user": {"name": "Max", "review_count": 45, "yelping_since": "2015-11-03 03:50:17", "elite": "2021", "average_stars": 4.56, "fans": 2}}
{"review_id": "-PhHZSol0t8QSbjfl0qH5Q", "user_id": "Jjuc1_S7cSPP6SUZbBHy9A", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was utterly stunning!  Among the bestt dinners and service I've ever had.  Its pricy but so many dishes on the tasting menu. My wife and I shared a completely different menu for each of us.  Wine pairings made it pricy.  Our wines were completely different as well.  It was a cornucopia of variety s d detailed \"chefery\".  \n\nIn an old rowhouse the vibrant gayborhood.  Quiet street and lovely dining room with about 12 tables.  The service was personal and not obtrusive.  As the courses come ...they mount in size of dish to what was a terrific goat confit.  We must have had 16-20 different dishes with very different flavors.  Omg!!!!!\n\nFinally, they packed up the menu, the wine list with wines we liked all marked...and a bag of granola!!!!!\n\nVetri will set you back  but WOW!!!!", "date": "2020-02-08 17:50:53", "user": {"name": "Roger", "review_count": 911, "yelping_since": "2010-07-20 01:52:33", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.27, "fans": 47}}
{"review_id": "J4Byh8ojqI_cseZWKawlOA", "user_id": "dOMHYUo_5vg9UINSa6Vd0w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 2, "funny": 1, "cool": 2, "text": "Vetri is hands down the best Italian restaurant in Philadelphia. I've wanted to experience it for the longest time, but the timing never worked out in my favor. I was smart and made a reservation a few months ago when I knew that I would be in town. I was also lucky enough to get a reservation for lunch which Mr. Vetri only offers on Friday.\n\nIt was a little tricky for me to find as it is located in a town house. The signage is low key and unassuming. Once I entered, it felt like I was in a friend's home. I was greeted by the host immediately and seated quickly. The dining room is small and intimate with just 11 tables. \n\nThe server came over quickly and went over the wine list making recommendations. I stuck to water as I did not want to dilute my taste buds. \n\nWhen the server returned with the water, he went over the days tasting menu in detail. He also pointed out their most famous dishes and made recommendations based on my personal preferences. \n\nThe prosciutto cotto, truffle onion crepe, swiss chard gnocchi, almond tortellini, baby pork chop and fluke fish were ordered.\n\nA basket was delivered with a variety of hot homemade breads. The breads were unreal. They were soft and flavorful. I was also given a plate of buffalo mozzarella, foie gras and something else that I can't remember. I love foie gras, so I was in heaven when it was placed down in front of me.\n\nEach dish flowed perfectly. I'd finish one and would receive the next one about 10 minutes later. The servers remained exceptionally attentive without being over bearing.\n\nThe almond tortellini was out of this world. It melted on the tongue. The flavors complimented one another. They are known for this dish, so make sure you get it!\n\nThe swiss chard gnocchi was fabulous. Just like the tortellini it melted in your mouth. I'm not a fan of gnocchi in general, but I would definitely get it here without hesitation.\n\nThe baby pork chop was succulent. It was cooked perfectly and melted in the mouth. The broccolini was sautéed beautifully and it was flavorful.\n\nI didn't enjoy the truffle onion crepe. It was too bold for my liking.\n\nThe polenta soufflé was awesome. It was sweet, but not too sweet. The home made gelato that accompanied it was outrageous. \n\nThe server than brought out a surprise plate of various sweet treats. They were all incredible and the presentation was gorgeous. \n\nAll in all the entire experience at Vetri was top notch. The service was perfect and the timing of each course being delivered was just right. The manager visited the table and while he was polite, he came off as stuffy. This was the best meal by far that I've had in recent memory. Vetri will definitely be a place that 'll eat at whenever I'm in town.", "date": "2020-02-04 21:46:13", "user": {"name": "Will", "review_count": 107, "yelping_since": "2010-12-17 01:22:15", "elite": "2015,2016,2017", "average_stars": 3.84, "fans": 43}}
{"review_id": "7xWbNgv_rQKSwsFve74RAw", "user_id": "wtZ5uwrk_33T2SuLzbio8A", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "We had a reservation on a Thursday night for their a la Carte Night at 8:30PM. When we arrived, our table wasn't ready, but they escorted us upstairs to a waiting area and offered a complimentary glass of Prosecco. At first, this was appreciated as a nice gesture. Unfortunately, we ended up having to wait at least a full 55 (!!) minutes past our reservation time before we were even seated. (Honestly, I believe it was actually even longer than that.) There were AT LEAST four other groups also waiting for at least 40 minutes or more throughout our entire wait as well.  Finally, after 40-45 minutes of waiting, we politely asked about the status and whether we could be seated soon and were told our \"table was being set now.\" It still took another 10-15 minutes (at least) to be seated. The staff apologized and one female hostess said they \"make up for it.\" Unfortunately, I wish we would have left instead of continuing to wait. \n\nI presumed they would comp at least something or a portion of our bill, but that unfortunately did not occur. I do appreciate that, after we were finally seated, the staff seemed to expedite our food. However, waiting that long last a reservation time is unreasonable for two very busy working professsionals.  Given that this is supposed to be a fine dining experience, I also expected more effort to make up for this long delay on their part.  As a result, I would not return- at least not on a week night - and would not recommend others dine here without an early reservation and plenty of time to wait.  Their food is very good, but I believe there are very comparable italian restaurants in Philly (for a more affordable cost as well) and others would not require waiting close to an hour, or more, past a reservation time.\n\nUnfortunately, the restaurant's decision to move all of the waiting parties upstairs and out of sight of the dining tables means that current diners do not see the several parties upstairs to be seated and thus feel no need to leave the table once they have finished dining. There were numerous groups lingering and oblivious to the many who were waiting. Vetri needs to rethink how addresses this issue.", "date": "2020-02-03 17:16:29", "user": {"name": "Christine", "review_count": 7, "yelping_since": "2017-12-23 15:27:27", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "HpFeqvbzKldTbqc7vvr88w", "user_id": "SaYctOj-v2LNNkD4EXtZUA", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 4, "funny": 0, "cool": 2, "text": "My husband and I dined at Vetri over the weekend, and it did not disappoint. The wait staff was superb, from the beginning to the end of the service, though I have to say service did start out slow - it took a while for us to get seated even though we had a reservation. And we didn't get menus for 15 minutes after we were seated. It definitely got better and picked up as the courses started flowing. Our server started us off with some predinner bites, which were pretty good. The standout was the foie gras on toast. As part of the predinner bites, we were also served local raw vegetables consisting of sliced carrots, radishes, etc, with a side of oddly looking balsamic jelly, which seemed inconsistent with the tasting menu and did not taste good. Other than that, everything was great. Our server was very friendly and went over the tasting menu with us. The tasting menu consists of 4 courses, with about 4-6 items under each course. Not all of the 21 food items would be served. Instead, our server explained that the menu should be treated as more of a guide, and the chefs would tailor the tasting experience to each table based on each guest's food preferences. The chefs sent out different dishes from each course for my husband and I so that we could taste as many different dishes on the menu. Of the 21 items, we had 14 of them, which was plenty. We shared and enjoyed everything, especially the pastas. They were definitely the BEST that I've ever had. Some favorites of the night were:\n- Bay scallops with caviar (Antipasti)\n- Sweetbread saltimbocca (Antipasti)\n- Prosciutto with brown butter, pepper and nuts (Antipasti ) \n- Cauliflower scapinocc (Pasta)\n- Busiate with pork shank ragu (Pasta)\n- Duck with chicories + 'nduja (Secondi)\n- Chocolate polenta soufflé (Dolce)\nAlso, we probably got three different bread baskets throughout dinner. They were all very well made. The focaccia bread was the best though. It was super soft and spongey. After dessert, our server brought over post dinner treats including profiteroles, cake bites and chocolate! Yum! As we finished up and got ready to leave, our server gave us to take home our own Vetri menu and some chocolate caramel pretzel bark. A very nice touch. Vetri was a pretty cool experience and we will surely be back.", "date": "2019-12-31 16:00:04", "user": {"name": "Ju", "review_count": 531, "yelping_since": "2011-01-26 02:02:49", "elite": "2015,2016,2018,2019,20,20,2021", "average_stars": 4.04, "fans": 43}}
{"review_id": "W_lM9nMyMr02n8A1eIRJRQ", "user_id": "0Osdw__bMpv7DD3EDiS6gQ", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is one of my favs in the world.  The food is impeccable, always.  The wine pairings are perfect. And here's the topper.  The service is incredible.  Not once, but every time we go.  This is fine dining at its finest.  If you like to dine this is a must.  Worth every penny - correction - more than worth every penny!!", "date": "2019-12-29 15:58:41", "user": {"name": "J", "review_count": 35, "yelping_since": "2013-02-17 14:04:40", "elite": "", "average_stars": 3.3, "fans": 0}}
{"review_id": "ezKuTF5y8IFAMEEYxv79-w", "user_id": "F-NzBp9pzz6SFzuUFrUjQg", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 1.0, "useful": 3, "funny": 2, "cool": 0, "text": "I usually prefer to write good reviews and I don't like writing bad about a chef's restaurant that I respect but in this case the disappointment was too much. I decided to gifted my husband with a dinner here for his birthday because I knows he is a fan of chef Marc Vetri. The real purpose was meeting him and I clearly requested it several times to make sure that the night we had dinner the chef would be there and that he would have stopped at the table. Whoever was on the phone, guaranteed that chef would have been there. We had dinner last night and the first disappointment was that after we got sit, we asked about chef Vetri and he wasn't there. We felt fooled because we could have rescheduled the dinner if only they mentioned it during the phone call that I recieved the day before to confirm the reservation. That changed my mood even my hysband told me that we can just have dinner, we would have had other occasions to meet him. Bad idea.\nThe dinner was a huge disappointment. \nWe started with they're tasting menù. \nThe madai crudo was underseasoned, completely flat like most of the dishes we were served that I will describe right now. I couldn't tell if the prosciutto cotto was just the better quality of an american ham or just didn't taste right because it was sliced too thick. It was very balanced tho, the flavours were ok. We had scallops, saltimbocca and the sweet onion crépe. Last one had a very good and intense onion flavor but was overpowering all the other ingredients, not very balanced. Overall appetizers were ok but there was no wow factor.\nProblems started with the pasta dishes. Probably my husband is very picky in terms of fresh pasta because in Italy he had a family business wich fresh pasta was the main thing.\nHe had the gnocchi. I would have called them \"gnudi\" (naked in italian. basically the classic ricotta and spinach raviolo stuffing without the pasta, typical of the Toscana region). That because the texture was very soft; gnocchi usually ar more hard and firm. But that is just an opinion. They were seasoned beautifully, very tasty with a nice topping of ricotta salata. They  were ruined by the puddle of completely unseasoned and broken brown butter they were submerged into, giving me a nasty greasy sensation on my lips. \nWe had other two stuffed pastas wich were crafted beautifully but were completely flat and underseasoned and leaving an unpleasant aftertaste of burned butter. In Italy we definetly don't eat all this butter.\nThan he had the tagliolini with mushrooms. That for him was the only good dish wich truly impressed him. Pasta was pure perfection, slightly undercooked (he comes from Abruzzo and he eats pasta like that) and even if he's not a big fan of mushrooms, he tought they were beautifully seasoned. A very simple dish but with a big impact. Too bad the only one.\nThe worse was the second course. \nHe had capretto. Quality of meat was high but it was very simplistic. Not bad but still no wow factor.\nI had the worse. I was served dry aged pork. We couldn't tell if it was raw, so he tried it and probably it was because it was inedible and impossible to bite, very gamey and hard. But the worst surprise when he tasted it was that the sauce was completely burned. This dish was really terrible, offensive for the price I paid and probably the worst I ever had in my life. We were forced to send it back. They substituted it with the duck. It was slightly under, skin wasn't crispy but soggy and the taste of blood was too intense. The dish came out really quickly so probably that was the reason. Sauce tasted like plain vinegar, it was very acidic. I felt unconfortable to also send it back so luckily it was paired with good nduja and i chugged it trying to cover up the awful taste. Very bad.\nTime for dessert.\nI was served a pistacchio flan wich didn't taste like pistacchio at all. Very flat. They gave us other two chocolate based desserts that tasted like nothing. We left them all, very disappointing.\nI wonder if they even taste the food before sending it out because almost everything was flat and underseasoned.\nI want to believe that the kitchen was in a very bad day, hope that is not the standard and I hope chef Vetri knows about that when he is absent.\nThe only reason I'm giving the one star it's because of the service. The dining assistant that we had was really professionals and attentive. He gave us a great service and he was always on point about our request. He brought us a taste of ana amzing wine to pair it worh the duck to apologize about the pprk dishes. I wish the wine list would be more clear, I wouldn't order a $35 wine by glasse but it worth it. \nOverall, I'm disappointed about that experience and mostly about the fact that I was so sure that the chef would stop by to our table so my husband could finally meet him.", "date": "2019-12-18 03:54:45", "user": {"name": "Giovanna", "review_count": 3, "yelping_since": "2016-09-16 13:06:31", "elite": "", "average_stars": 2.33, "fans": 0}}
{"review_id": "Bcmlr3g9P1hT7ih2g2GXAw", "user_id": "8R16InoIf-JheYnh9EOR7w", "business_id": "wUnLSg_GKfEIQ5CQQ770_g", "stars": 5.0, "useful": 3, "funny": 3, "cool": 4, "text": "It's impossible not to give Vetri five stars. Any argument I can come up with is half-baked and flimsy. This is a five-star experience from start to finish. Your night will be perfectly choreographed and it will feel like an art as much as a science. The service is impeccable, the food is outstanding and somehow it's been shimmying out with this excellence for years and years and years. It would be easy for a place like Vetri to become tired and caught caught flatfooted after so much time in the world, but it continues to dazzle and impress, even amidst the hype. Expect to be full as can be at the end of your dinner here. And expect to be treated like royalty -- even if you're the ultimate difficult patron, as I am. I'm seriously impressed -- hence the hyperbole oozing out of this intro. This is where to book your special occasion dinner. Old school vibes and modern technique come together at Vetri for a masterful performance, and you'll get a personalized menu at the end of the meal to remember it for all of eternity. \n\nCame here as a party of five on a Friday night at 9pm. It's an intimate space -- quite small, in a homey way. The vibes here will assure you that you'll be taken care of in a thoughtful, genuine way. Somehow upscale and cozy at the same time, you'll find dim lighting, antique fixtures and aromas for days. You 100% need to make a reservation -- the space is as small as it is popular. When you reserve, they'll ask about specific dietary preferences/restrictions, which they will confirm when you arrive. Very thorough.\n\nUpon sitting down, you will be greeted with a welcome cocktail (but do *not* forget your ID -- Pennsylvania liquor laws are far more stringent than most, and a few of us weren't thinking about it and didn't bring out wallets which stirred up some frustration but ultimately it all worked out...story for another day), a sparkling vermouth-based drink (wine/beer only here). There's a fabulous wine selection here, which I urge you to take advantage of is you can. That said, I actually would advise against the wine pairing -- while it seems obvious to opt for it at a place like this, it was a little much for me. By the end, I really didn't want it anymore, which was a shame. At the same time, the wine pairing could be worth it just for the sommelier. The gentleman who was helping us had comically extensive knowledge of each wine, which he shared in an animated and painstakingly thorough way. I don't think I retained any of the knowledge he was dropping, but the theatrics of it are hard to beat. \n\nThe most unique thing about Vetri is the way that they structure their tasting menu. I'm not sure if I'm a fan of it or not. It's not better or worse than what I'm used to, it's just different. Unlike all other tasting menus I've had to date, Vetri curates a unique menu for each party member as opposed to bringing everyone the same set list of dishes. Meaning all five of us has slightly different meals. For example: I have a gluten sensitivity and Vetri serves two pasta dishes as part of its menu, so they gave me the option of doing one pasta dish, one alternate (they ended up bringing me a mushroom dish that was bonkers good). My sister doesn't eat duck while I love it, so I got a juicy duck breast for my entree-type dish while she got steak. Little things like that. They will personalize as best as they can. \n\nI tend to find it onerous to detail each dish in a tasting menu, so I'll just give highlights and overall impressions. Start to finish, everything was delicious and well-paced. From the first array of bites in the beginning, we knew we were in for something special. The cheese was fluffy and perfect, the roasted cauliflower seasoned perfectly and super satisfying. \n\nOther highlights:\n-The onion tart. This is a staple here and for good reason. Impossibly rich and flavorful\n-The spinach gnocchi and almond tortellini were outstanding. I'm very sensitive to gluten so I didn't finish this part of the dinner, but my god, it was worth trying. I've never liked gnocchi -- even great gnocchi, usually I just don't jive with the consistency -- but this was special. \n-The prosciutto served family-style during the appetizer portion. They said its magic was simply due to being \"doused in oil and pickle juice\" but it must have been more than that. Like everything else, just incredibly flavorful and delicious\n-The octopus was cooked perfectly, paired with pork belly which was a treat. I've often seen octopus paired with chorizo, so this was some extra special luxury. \n\nThey will bringing you lots and lots and lots of bread (and it's already a pretty heavy tasting menu) so do yourselves a favor and save it to take home. Have a little here and there but it's just as good the next day, and it will allow you to experience the meal without having your buttons pop open.", "date": "2019-12-09 15:38:24", "user": {"name": "Molly", "review_count": 544, "yelping_since": "2015-02-08 03:12:59", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.16, "fans": 212}}
