{"business_id": "VSDdUwXktnvL_O0meKv7MQ", "name": "Alice Pizza", "address": "235 S 15th St", "city": "Philadelphia", "state": "PA", "postal_code": "19102", "latitude": 39.948332, "longitude": -75.166127, "stars": 4.5, "review_count": 243, "is_open": 1, "attributes": {"RestaurantsTakeOut": "True", "GoodForMeal": "{'dessert': True, 'latenight': False, 'lunch': True, 'dinner': True, 'brunch': False, 'breakfast': False}", "Ambience": "{'touristy': False, 'hipster': False, 'romantic': False, 'divey': False, 'intimate': False, 'trendy': True, 'upscale': False, 'classy': False, 'casual': True}", "RestaurantsPriceRange2": "2", "OutdoorSeating": "True", "RestaurantsGoodForGroups": "True", "HasTV": "True", "WiFi": "u'free'", "RestaurantsReservations": "True", "Alcohol": "u'full_bar'", "RestaurantsAttire": "'casual'", "BikeParking": "False", "GoodForKids": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "RestaurantsDelivery": "True", "DogsAllowed": "False", "WheelchairAccessible": "True", "RestaurantsTableService": "True", "HappyHour": "True", "Caters": "True", "BusinessAcceptsCreditCards": "True", "NoiseLevel": "'average'"}, "categories": "Pizza, Restaurants, Nightlife, Italian, Bars, Gelato, Food, Wine Bars", "hours": {"Monday": "0:0-0:0", "Tuesday": "11:0-22:0", "Wednesday": "11:0-22:0", "Thursday": "11:0-22:0", "Friday": "11:0-23:0", "Saturday": "11:0-23:0", "Sunday": "11:0-21:0"}, "category_list": ["Pizza", "Restaurants", "Nightlife", "Italian", "Bars", "Gelato", "Food", "Wine Bars"], "stratification_tag": "Italian"}
{"review_id": "_qxZHOlyjz0ZfNmqrTouFw", "user_id": "gWZETLPu_ihAtLOYtrm0mw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 24, "funny": 8, "cool": 15, "text": "Restaurant Week at Alice Pizza was truly a success. After checking out the RW menu online, and comparing it to a few others that I thought were worth checking out, friends and I decided that Alice Pizza was the spot for us. Two out of three of us had been for pizza and gelato before, but this was a first for the sit down, full menu dining experience. We called about a week in advance to make our reservation and were easily able to get the time we wanted.\n\nWe were seated immediately upon arrival and our vaccination cards were checked per the city mandate. We were offered regular and RW menus. As a participant in dry January, I only peeked at the drink menu to avoid temptation. I was pleased to see that the drink prices are pretty reasonable and there's a wide selection of cocktails, beer, and wine. I opted for a diet coke with lemon, another friend participating had a blood orange italian soda, and our non-dry January friend had an espresso martini.\n\nThe four course RW menu had 4 different choices for first course and the second course, so we all agreed upon our three preferences from each category and ordered accordingly. We each did our own thing for course 3, and then shared desserts for the fourth and final course.\n\nTo start, we had the Mozzarella Tasting, Salumi e Formagi Misti, and Burrata Con Tartufo. The servings were small, but just enough so that we could each have a bite of everything. For our second course, we had the Cacio e Pepe Gnocchi Fritti, Suppli al Telefono, and Sformato. Again, these dishes were on the smaller side, but perfect to share. The gnocchi was incredible, the ragu with the suppli was perfect, and the sformato was next level - definitely my favorite.\n\nFor my third course, I had the Carbonara pizza. This was the main event dish, the portion was so big I could hardly finish half. So crisp, well topped, minimal crust and just delicious. My mouth is watering while writing this review and thinking about that pizza. \n\nTo wrap up the evening, we had the Sfogliatelle, Tortina Della Nonna, and Crema Catalana. Honestly, I think we were served a key lime pie instead of the Tortina Della Nonna because there was a lime garnish and no nut toppings but I am so glad because that little pie was my favorite dessert.\n\nStart to finish, a delightful night. Our server Dom was personable, attentive, and made the evening thoroughly enjoyable. I can't wait to return to Alice for another sit down meal to try all of the other menu options. What is better than a successful Restaurant Week?!", "date": "2022-01-12 16:03:06", "user": {"name": "Gabriella", "review_count": 231, "yelping_since": "2016-01-26 23:54:38", "elite": "20,20,2021", "average_stars": 4.33, "fans": 167}}
{"review_id": "wYp6TFGsjFpy9-W92FEE1w", "user_id": "rxgoHeIus7ES4cGrg8DUqQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I've been here a few times for lunch and dinner and I think this is a pretty good pizza restaurant. They are personal size pizza flavorful and they have a crunchy thick crust. The cool thing is after having a pizza you can grab a scoop or two of gelato. They also sell dry pasta that you can take home and cook yourself.", "date": "2021-12-25 18:54:43", "user": {"name": "Tashalee", "review_count": 183, "yelping_since": "2014-11-18 14:55:26", "elite": "2018,2019,20,20,2021", "average_stars": 4.19, "fans": 35}}
{"review_id": "sxgYsvZ1rvyX6UAhwLjntA", "user_id": "fWKE4r1V0hqBEhuW9gx1Bg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love pizza( never been to Italy ) but New York, Chicago, Detroit,Californian.... I love them all specially New York very thin pizza. This place pizza is like between Detroit & New York pizza.  someone mention like Italian pizza here ! ok !! I will ask Italian friend later ... any way ... pizza taste good, not too oily even I ordered carbonara...taste  like carbonara but not oily... good chewy bite ... and meat ball... very fluffy, meat ball with light marinara sauce over the meat ball good combo! And we thought will order pasta but server mistakes  our order he bring calamari. But its ok ! I was thinking I gonna get them before order meatball! He said calamari with zucchini fritter so would be fine.... Turns out good Because I ordered pitcher of Italian beer we just need some beer food! any way server was super nice ( forgot to ask his name) everything is very nice...", "date": "2021-12-12 04:02:07", "user": {"name": "Mayumi", "review_count": 145, "yelping_since": "2012-11-09 18:25:12", "elite": "2019,20,20,2021", "average_stars": 3.92, "fans": 20}}
{"review_id": "P9rYJrizF1eq8FJqdkYmIw", "user_id": "OE9XOrjARQYJ_WV5KwcgXw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Absolutely delicious for an authentic Italian pizza and I will definitely go back next time we are in the area!! The pizza here is bought by slice/weight just like in Italy, which is wonderful because you can choose so many different types", "date": "2021-12-10 16:46:47", "user": {"name": "Emi", "review_count": 35, "yelping_since": "2012-10-28 21:13:10", "elite": "2021", "average_stars": 4.34, "fans": 2}}
{"review_id": "ahxBatnwuFWktyqDf0IK3g", "user_id": "wK56PYC3Oy5kB0MB0P7HxQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Alice Pizza is a pice of heaven to say the least!. With friends or a family member, to indulge with a simple plate of Pasta, to a Pizza with a number of desserts to complement the dinner, feast for the eyes!.!. From a movie or a theater, what a nice time to relax while relaxing with something to keep you tummy warm!.", "date": "2021-12-02 20:11:28", "user": {"name": "Stewart", "review_count": 19, "yelping_since": "2018-09-13 16:55:22", "elite": "", "average_stars": 3.77, "fans": 0}}
{"review_id": "jm_hYzcCBZbI0kyOgVJ6_Q", "user_id": "zNsQ1gkrWpIu3Q-Zds3Ywg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Very good pizza and desserts. Close tot he theaters. Will need a reservation on theatre nights.", "date": "2021-11-29 00:18:46", "user": {"name": "Leslie", "review_count": 11, "yelping_since": "2014-10-18 19:14:23", "elite": "", "average_stars": 3.27, "fans": 1}}
{"review_id": "aO_MmMAhAyDhaHm6YNH2yw", "user_id": "pysIFCgm5IHgnat9h99QWw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Have I ever reviewed Alice? Lol one of my favorite restaurants in town, whether to grab a slice of pizza, gelato, or to sit down to eat", "date": "2021-10-31 15:03:26", "user": {"name": "E", "review_count": 193, "yelping_since": "2015-10-31 19:43:49", "elite": "", "average_stars": 3.96, "fans": 0}}
{"review_id": "n5-TtzKGl8n1CIj9J9R0uA", "user_id": "zI0XWEuUH9_dx0sjfyz59g", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Would give this 3.5/5 stars, but rounding up just because I had it twice for take-out but never in store, so perhaps I would've had a better experience with the food being more fresh! \n\nI ordered Alice Pizza on Too Good To Go, which is a food saving app which lets you pick up restaurant leftover un-ordered dishes at a discounted price. Therefore, I got a weird assortment of vegetable pizzas (broccoli, mushrooms, etc.) but honestly was pleasantly surprised after heating them up in the oven! There was quite a large quantity and they were quite generous about it. The crust was satisfying and the pizza shapes were all rectangular, which I thought was quite intruiging.", "date": "2021-10-26 02:30:30", "user": {"name": "Andrew", "review_count": 169, "yelping_since": "2016-06-04 00:51:49", "elite": "2018,2019,2021", "average_stars": 3.99, "fans": 5}}
{"review_id": "rbEVemjZM6QunKeDsNJJAQ", "user_id": "gr9c9H1EPYLDXQNaup9BVg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Wow! Simply fantastic pizza, certainly one of the better pizzas I've had. I went with 2 friends and we ordered 2 pizzas to share between the 3 of us, a Margherita and a Philly Special. The Margherita was as good as they get; the sauce was not too salty or sweet, the basil was fresh, and the cheese was tasty without being overly greasy. The Philly Special was terrific. I was very impressed by the pesto and how fresh and flavorful it was which is not easy to do. The crusts were excellent too, a perfect combination of crispy on the bottom and slightly chewy on the top without being either soggy or burnt.\n\nOverall highly recommend going here with a group and sharing several pizzas, they are a bit large for one person to eat in one sitting although a piece would no doubt be fine for reheating. The service is solid and there's outdoor seating too for the COVID-conscious. They also have a huge selection of drinks and gelato which looked really good. We were all too full for gelato which wasn't a problem as it was so satisfying but I hope to come back here another time and try the gelato.", "date": "2021-10-17 23:08:49", "user": {"name": "Austin", "review_count": 113, "yelping_since": "2009-08-30 13:48:20", "elite": "2021", "average_stars": 4.09, "fans": 1}}
{"review_id": "fjj1YMWjApfXZ6z14brJqA", "user_id": "vD9pex35A86ukYMRrj_lwQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Came for the pizza. Stayed for the hospitality. This restaurant is not only outfitted to be an elegant bar-top, but an everyday place to have a drink, or enjoy one of their small appetizers. Antonella and Shane are the people to ask for to enhance your experience. Pizza to coffee, you won't regret stopping by.", "date": "2021-10-09 02:44:01", "user": {"name": "Ronnie", "review_count": 4, "yelping_since": "2014-05-02 18:27:14", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "3PF5z3b0RnUSppbZ2SIB7A", "user_id": "Obp8LRY_MRwUIqTPDbp6Zw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 2, "text": "4 stars for good flavor but 3 stars for being a bit overcooked, 4 stars for an okay salad \n\nAn authentic square cutting Italian style pizza. This order unfortunately did take a bit longer than the projected wait time by about another 5 minutes and the pizza crust was unfortunately overcooked (burnt) on the bottom. I think we got the BBQ pork pizza - it had a nice flavor to it, I liked the red sauce, onion/tomato, but I think the cook of the pizza itself needed some work.\n\nWe also got the bresaola beef tenderloin/arugula salad combo - the beef was thinly sliced, had a very strong flavor, a bit tough to chew, but tasted quite hardy. \n\nTips/Takeaways: \n-I think you'd be satisfied with any of their pizzas\n-The bresaola was okay, nice for a try, but I'm not convinced I'd get it a second time", "date": "2021-09-21 23:18:56", "user": {"name": "Victor", "review_count": 218, "yelping_since": "2018-07-14 20:47:36", "elite": "2018,2019,20,20,2021", "average_stars": 3.83, "fans": 23}}
{"review_id": "DxOXpoACqAXRPVt8RQQBew", "user_id": "6C8Ne6yRu6TzBLbhfhdduw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "tl;dr premium ingredients and grab-and-go slices al taglio culminate into this solid pizza option in Center City\n\n\"Al taglio\" translates directly to \"by the cut,\" in reference to the large sheets, cut and served in rectangular slices. Originally developed in Rome, Alice Pizza has expanded worldwide and is now a heavy-hitter in the pizza al taglio game. A friend remarked that this spot was a regular spot in her culinary routine during her semester abroad in Rome, so it's about time that I tried the Center City outpost.\n\nThe decor is confusingly over-the-top and in slight disrepair. Funky wire lighting fixtures hang from the high ceilings, and the walls prominently display murals and paintings depicting scenes from Rome. The large space is dominated by a U-shaped center counter. A rainbow of gelato options highlights the front side, with a long row of assorted square pies along the left and a full-service bar on the right. Mismatched chairs are paired with Mod Podge-esque tables. Contemporary rock blends with the buzz from the kitchen.\n\nMy partner and I decided to split a few slices during our visit this past weekend. Ordering in-person was a breeze, and the slices were reheated within 5 minutes.\n\nThe crust itself was pleasantly light and crisp. Each slice had a generous helping of clearly premium toppings. I loved that sauce and toppings spread very nearly to the edges of the crust. Our favorites flavors were the Diavolo (spicy salami), Philly Special (pesto, arugula, and sundried tomatoes), and Salsiccia e Funghi (sausage and mushrooms). The only flavor that was a letdown for us was the Melenzane Picante (eggplant), which was lukewarm, slightly slimy, and overly oily, and one-dimensional.\n\nOur eyes were definitely larger than our stomachs -- we ended up getting 6 rectangular slices (translating into 12 square-sized ones). I would recommend 2-3 rectangular slices per person for a solid meal. Nonetheless, the $30 (after tax and tip) for our meal was still a bit jarring for pizza. All being said, Alice offers some of Philly's best reheated slices, which can inherently be inconsistent.", "date": "2021-09-12 21:37:52", "user": {"name": "Austin", "review_count": 211, "yelping_since": "2016-12-30 22:23:33", "elite": "2019,20,20,2021", "average_stars": 4.08, "fans": 25}}
{"review_id": "LTAifJ3kBuFXlqR7D4STxg", "user_id": "G-DzOxoh7tniSa5K7apy-g", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not quite the same pizza al taglio in Rome.  Although this location is a full blown restaurant/bar and not just a pizza joint like in Rome.  I had the funghi e salsiccia, margherita, diavola, and funghi.  All were very close to the flavors, but I can't help but notice this one is more cracker like than the ones in Rome.  I tried ordering the taglio from the bar, but the manager informed me that it was restaurant policy.  So I had to close out my tab and go on the other side of the place to get the taglio.  I suspect that if I was a regular patron, they would be allowed to order from the bar.", "date": "2021-08-27 00:43:58", "user": {"name": "Mark", "review_count": 158, "yelping_since": "2015-10-09 03:25:23", "elite": "2021", "average_stars": 3.65, "fans": 1}}
{"review_id": "2HbyVyiuAH03N120DVnrIw", "user_id": "ts2Rwpo3TEsfQ4r0IWevcQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place, very good pizza and dessert. If you are at Phily City Center is a very good option to eat. Totally recommended.", "date": "2021-08-15 18:05:48", "user": {"name": "Luis", "review_count": 1, "yelping_since": "2021-01-01 04:23:11", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "pjy8C8S_32ZUCcdmPSrERQ", "user_id": "xNIDQfpZ-zpGlLEMdMPNWw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really needed pizza, and I really miss the walk-in by the slice pizza of Italy. But Alice has nailed it. Alice describes itself as having evolved from Roma pizzerias and I would agree. In Rome I was always amazed at the different topping varieties with lots of vegetables as opposed to the meat laden US renditions, and this is exactly how Alice has designed it's offerings. I actually wanted a full meal so ordered a personal pizza (Diablo's with added spinach) and the Fior Latte Mozzarella Caprese with added Prosciutto. Portions are very generous for the price and the pizza was glorious just like what I'd expect in Italy. I have not even had pizza like this in NYC or Boston (which I have always found weird because of the storied Italian influence in these cities). My review is only 3-stars for the following reasons - the Caprese \"heirloom tomatoes\" were not even close to meeting my expectations and they put too much sea salt on but not enough EVOO or oregano. Remember mozzarella is already a salty cheese so overdoing the added sea salt was just too much. Lastly, I ordered the added Prosciutto to the caprese and paid an up charge of $5.50 for it, but it wasn't added to the dish. VERY disappointing. Because I obtained this meal as take-away I didn't notice until I had arrived back at the hotel. For the charge, this is totally unsatisfactory. In hind-sight the added saltiness of the meat would have been completely overwhelming in light of my comment about the excessive sea salt. Finally, when I called in to order my food, the server didn't understand the menu and I had to educate her that, yes in fact they do have a caprese on the menu. How can someone working in a restaurant not know the menu? Really?\nIn summary, the pizza was awesome, the caprese was not worth it in the end. This would be an awesome spot for a walk-in and walk-away lunch - get your pizza, fold it in half and indulge as you walk down the streets of Philadelphia and for a minute believe you are in the streets of Roma.", "date": "2021-08-13 09:22:55", "user": {"name": "Eric", "review_count": 80, "yelping_since": "2016-12-21 07:57:37", "elite": "", "average_stars": 3.81, "fans": 0}}
{"review_id": "EhU8pUGM3FNPKFO2xxETSQ", "user_id": "Oumcr7bl4Jg8WVlkWb9y-g", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pizza was amazing! The ambiance is great and the ice cream to die for. Coming back. Thank you Dominique for taking care of our large party!", "date": "2021-07-25 00:05:21", "user": {"name": "Isabel", "review_count": 42, "yelping_since": "2014-11-30 23:40:58", "elite": "", "average_stars": 3.5, "fans": 1}}
{"review_id": "O0Ex1YotBMw8NdmH21omrQ", "user_id": "mesR7QhowXOtfefr_hMJKw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We had a slice of zucchini buratta pizza. It had a nice think crust; very Detroit style. The sauce and cheese balanced well. I'd definitely eat there again. Staff was helpful.", "date": "2021-07-17 19:47:47", "user": {"name": "Bryan", "review_count": 34, "yelping_since": "2019-07-26 06:49:43", "elite": "", "average_stars": 4.66, "fans": 0}}
{"review_id": "AXJOqnPqqJQhXg5h45EJuA", "user_id": "0DB3Irpf_ETVXu_Ou9vPow", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not sure what I was thinking years ago, I love how you can grab a slice as big as you want. All of their toppings are so fresh and delicious. Light, crispy dough.", "date": "2021-07-16 15:19:04", "user": {"name": "Abraham", "review_count": 732, "yelping_since": "2012-12-29 05:02:04", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.06, "fans": 38}}
{"review_id": "psmTiZNo8mlxIjME-KL4Kg", "user_id": "cl-c9rAAbb8rwyk6sXeOPQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is one of my favorite places in Philly. The staff is super cool, friendly and accommodating. They location is perfect. They have outside seating on the sidewalk, not on the street like Blume does.\n\nOh and the pizza. I've had nearly every pizza like 5 times over but the mushroom one is my favorite.\n\nThen for desserts they have an amazing selection of gelatos and cakes!", "date": "2021-07-10 02:14:46", "user": {"name": "Harris", "review_count": 18, "yelping_since": "2009-07-27 02:58:42", "elite": "", "average_stars": 2.5, "fans": 1}}
{"review_id": "RlmugF_uQ5g7-PLO7q4jRA", "user_id": "ouIyrwwOPt2cG3svK1_QWA", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "As the only US outpost of a Roman chain, we had high expectations. The pizza was great- crispy crust, excellent sauces. The dessert case is stunning & both the strawberry marscapone confection & the chocolate mouse were delightful. The service was also very warm & helpful. Quick too. \nRecommend.", "date": "2021-07-05 18:21:02", "user": {"name": "Liesl", "review_count": 70, "yelping_since": "2015-08-26 19:16:22", "elite": "", "average_stars": 3.89, "fans": 0}}
{"review_id": "UCrbAtBXyOagMN4UhDnIKw", "user_id": "OZLQdl_796gZY6KNKiDOzQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went here for lunch with a friend/family. Decided to eat inside. Server was very nice and quick. We ordered Cacio e Pepe fried gnocchi,2 pizza (margarita and roasted pork). Gnocchi and Pizzas were very good.  for my taste (I tried to eat low sodium) the roasted pork was salted but it was delicious. There were square pizza, 4 moderate size slices. We also had gelato and pastry (I had a kinder gelato and apple tart). I didn't like neither. I had way better gelato with more flavor and the apple tart with almond cream was tasteless as well. I certainly will try this place again for the pizza. The only issue is parking around the area, a few parking garages but very expensive at the time we went. I was able to find parking on the street. (Sorry forgot to take pics of the food).", "date": "2021-06-20 01:34:59", "user": {"name": "Dayana", "review_count": 42, "yelping_since": "2014-11-23 16:28:38", "elite": "", "average_stars": 3.93, "fans": 0}}
{"review_id": "lBzApXjAHVv0HMwkBobBgQ", "user_id": "4lqWX0UVNXDtDBzaS3cCxw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "What a beautiful place! The restaurant and bar is both very clean and very pretty. The pizza was absolutely delicious and prepared quickly! The staff was very patient while I was overwhelmed with all of the options!", "date": "2021-06-09 19:43:24", "user": {"name": "Kevin", "review_count": 22, "yelping_since": "2021-06-08 05:23:56", "elite": "", "average_stars": 4.64, "fans": 0}}
{"review_id": "fnI_nnGxmSBmUgLcDMKtFA", "user_id": "j0zF0eXkyrLitSvw8WklEg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I are riding this experience at 5 stars for several reasons. First when I called to request a reservation, I was politely greeting and not kept on hold long. Then when we arrived we didn't wait more than 2min to be seated and we were able to choose which table we wanted to sit at that our waitress was serving. I got the Spicy Shrimp Fra Diavolo and it was delicious! There was a perfect ratio of spicy tomato sauce to fresh homemade fettuccine , and the flavors were rival to the best Italian food I've ever had. There was plenty of shrimp in the dish, not skimpy like other places. My husband had a pizza and they were very accommodating to his specific request as he can be a picky eater especially when it comes to pizza. I was so happy they did not take offense to his order. He enjoyed it very much. I also want to note that the place was very clean, even the bathroom, which surprised me because there were plenty of people in the restaurant and I would have thought it may be neglected since I didn't see a lot of staff, but it was nice. I would definitely return here next time we visit PA.", "date": "2021-06-06 05:17:24", "user": {"name": "Alicia", "review_count": 39, "yelping_since": "2014-11-19 17:59:33", "elite": "", "average_stars": 4.08, "fans": 0}}
{"review_id": "s6trFzeenMGOHXCbxDrzDw", "user_id": "BtdqTErMCjvrQxKmBlJ7Uw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "I've really only been here for the gelato, but I love it! It's a nice refreshing treat on a hot day that isn't as heavy as all the ice cream around town. I've had the Limone (lemon) a few times, and occasionally get something chocolatey (like Desire, which if I recall is a vanilla base with chocolate cherry or raspberry mix?) I'm never disappointed. Pre-pandemic they would give samples so you could try all of the flavors before you chose one for your purchase but I don't think they offer that anymore.\n\nI always say I'll come back to try the pizza but who knows if I'll ever get around to it. The gelato is worth it on its own, though!", "date": "2021-05-31 22:30:51", "user": {"name": "Tricia", "review_count": 250, "yelping_since": "2015-09-22 18:42:36", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.12, "fans": 14}}
{"review_id": "rFHWCMqLf514Bz9Wg5Tx7A", "user_id": "hImphCrKdXy4rYj7TSZRgw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I wish I could give it a ZERO. I have ordered pizza and gelato from here in the past. Today I had a limited time for lunch and I ORDERED a pizza for pick-up because I wanted it to be fresh. The ones they have in the display sit out there for a while.\n\nAnyway I picked up the pizza, didn't open it until I got home. In the first place it was barely warm, but I'll forgive that. When I opened it up it was BURNT. I thought it was just the corners but the entire crust was burnt underneath. I will NEVER order or buy anything from this restaurant again. I cannot believe that they would SELL this. It must have been a reject that they were going to throw out. Normally I would have returned it for a refund, but I would have been late for work had I done so. \n\nThe gelato is good, but I'll never be back. I can go to the other restaurant on Chestnut and get gelato.", "date": "2021-04-21 18:59:38", "user": {"name": "Lucero", "review_count": 43, "yelping_since": "2010-03-27 21:03:34", "elite": "", "average_stars": 2.47, "fans": 4}}
{"review_id": "Iyg32aVITXJpG5WJ_LOvtQ", "user_id": "h5nKyARNo0jEhAj7nDZjdg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "If only ten stars were possible. I was working the first evening we got to Philadelphia. My son decided pizza was on the menu and they went to get it. I am so glad they picked Alice. I feel gipped that we have such awful pizza where we live now that I've had this. We had the veggie and margherita pizza. After, I enjoyed gelato. So tasty.", "date": "2021-04-18 16:23:27", "user": {"name": "Christi", "review_count": 139, "yelping_since": "2015-09-28 17:36:00", "elite": "", "average_stars": 4.22, "fans": 3}}
{"review_id": "R2bpTSW4gQFVrVXHv_FLhg", "user_id": "GvF2XPPJYQDl5u7eHbLa0g", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "WARNING - not open until 10pm. Walked in on a a Thursday night at 9:18pm and the kitchen had \"already been closed for a while\" and they had already done last call for the bar. Looked delicious and was disappointed in the false advertising. Update your hours if you're only open until 9pm", "date": "2021-04-09 01:21:21", "user": {"name": "Birdie", "review_count": 26, "yelping_since": "2014-07-27 17:23:14", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "Im5bGeNcSTjiodOuQ6dUwA", "user_id": "DB8sZjbJ-HTJIk1rBU1oAQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We got take out to eat in our hotel room after a long day of site seeing. The online menu was easy to use. Pizzas were ready on time and hot after our short walk back to the room. We got the personal sized Margherita pizza, which had four large slices, a crispy crust and the perfect amount of cheese (shredded vs Buffalo mozzarella circles) and tomato sauce. Our second pick was the Casio e Pepi that had a thin crispy crust and rich creamy sauce with black pepper and cheese. Very good, yet rich. They also had a a wide selection selection of gelato, which we didn't try,but that looked delicious.", "date": "2021-04-04 17:16:19", "user": {"name": "Ashley", "review_count": 28, "yelping_since": "2016-05-02 22:49:30", "elite": "", "average_stars": 4.82, "fans": 0}}
{"review_id": "Wh8zvD4LbJeCS9t8GNaejQ", "user_id": "Y2dK_GN380uKkkAnb3hyjA", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Holy cow -- I almost pulled a muscle trying to eat this thing. But for the love of all things holy, this dish was amazing! Easily enough leftovers for lunch tomorrow. \n\nTry this place. You won't be sad.", "date": "2021-03-16 23:32:19", "user": {"name": "Bill", "review_count": 23, "yelping_since": "2010-08-06 04:12:16", "elite": "", "average_stars": 4.5, "fans": 1}}
{"review_id": "501Pdyzbr3hb7LYf-3nHeg", "user_id": "ZS85bkvRejJaPKMhxfx1GQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best pizza we've had since moving to philly. Very reasonably priced for the quality. Pachino E Buffalo was amazing!", "date": "2021-03-07 02:58:46", "user": {"name": "Jennifer", "review_count": 13, "yelping_since": "2009-09-08 02:37:31", "elite": "", "average_stars": 3.08, "fans": 2}}
{"review_id": "dNcJ1GVHltCgTi5uUh0iCw", "user_id": "e33l3ucOBsdsb8jyegZVVQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place used to be better when first opened. I lived in nearby apartment so I know for sure how they have changed the ingredients on their pizza especially the mushroom pizza. They used portobello mushroom  before but now it's just regular mushroom. Its definitely a big minus. I hope they will switch back. Otherwise pizza is still good.", "date": "2021-01-26 18:53:32", "user": {"name": "Iris", "review_count": 6, "yelping_since": "2014-04-21 19:08:59", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "xU0Y1Ji5JqO9zz2t8RQ7mg", "user_id": "dI_ohX8Sn8u7N7IcvxwQXw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "pleasantly surprised how good the food was .\nthe \"personal \"size pizza was really large enough for two to share , once you can agree on what type ! many fresh ,healthy choices as well as plain out just yummy...we had the pork, pulled and with bbq sauce as well as the eggplant ,tomatoes, mozzarella cheese choice ...\nthe crust is crunchy ,perfect !\nour party of 5 included a teenager who chowed down on the meatballs (side dish) ,as well the fried dough with sauce .happy kid ,no easy task .\nthe coffee is delicious. absolutely the best I have had in town ,pre covid included .\nwe ended the meal with the cookie sample plate ..\ngreat cookies ,biscotti, traditional and not overly sweet .\nthe manager ,Shawn was helpful ,and personable,and not in that sappy fakey way you get with some establishment. he was lovely to talk to ,genuine .\nI would give alice 5 stars except for the broken window we were seated near .long story short apparently some road work caused a pebble to crack the window ,which was \"fixed \" temporarily by securing the outside of the large window with plywood ,but not the inside .\nmy teenage grandson and daughter both sat up straight  in their chairs  and ....heard the crack get larger ...\nno one was hurt ,but we were lucky .\nthe manager was apologetic and earnest .\nappreciated that .\ndefinitely will return ,so much to try on the menu !", "date": "2021-01-18 21:54:06", "user": {"name": "Lolly", "review_count": 26, "yelping_since": "2020-04-14 01:17:34", "elite": "", "average_stars": 2.67, "fans": 2}}
{"review_id": "a11BkY90Jae_q4TSFqMy8g", "user_id": "ZCVEZmTB_StK-UXA3WPVlQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "Solid. I got the lunch combo of the Suppli Al Telefano and slice of Margarita pizza. The suppli al telefano is a rice croquet with mozzarella in the center and a beef/veal ragu in with the rice. It was lighter than expected (fried food can sometimes be heavy/dense) this was not but it would have been better if it came with a small ramekin of their tomato sauce to dip it in as the acid would have complimented and brought out the flavor more. I suspect when dining in or outside this may be how they are served as an app but they should include with the take out order combo. The pizza is square cut (I got a corner slice! score!) is very delicate with a crisp crust and nice balance of cheese to sauce. I also splurged for an Isgro cannoli because how can one not? All in all a very tasty lunch!", "date": "2020-12-23 18:31:47", "user": {"name": "Zanna", "review_count": 523, "yelping_since": "2008-01-10 14:09:37", "elite": "2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.56, "fans": 73}}
{"review_id": "xmmirUyCHMx34kjXHpQwGw", "user_id": "UBiJ0YhkHZWM1CuUTy-2qA", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I've had pizza at probably 50+ places in the city over the last 10 years. Alice Pizza's pizza is the best, in my opinion. Whether a speciality pizza or regular, they're both 10/10 in flavor. This place also has the most delicious desserts and coffee selections (lattes, etc). Dined here during the pandemic in their outdoor seating area. Must try for lunch or dinner - you'll be back, I promise!", "date": "2020-12-12 20:18:28", "user": {"name": "Rachael", "review_count": 151, "yelping_since": "2014-10-22 18:06:20", "elite": "20,20,2021", "average_stars": 4.29, "fans": 1}}
{"review_id": "3SntHRDBKzKjxptp9WvC4A", "user_id": "wDDDAueA098iH3W3Y1MuOQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "It's the perfect pizza. I usually don't crave pizza but I constantly crave Alice. My go-to is the spicy salami but my fiance love the spicy tomato. Both are excellent choices!", "date": "2020-12-08 21:38:58", "user": {"name": "J Ng", "review_count": 2, "yelping_since": "2016-05-08 23:44:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "RQYPyyJiXWkYChcWpfDZ0Q", "user_id": "LA4DxijAdk04kf24k0_7fg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love this place's pizza. I started going here because I missed Rione earlier in this pandemic when it was closed but this place stands out on its own. I get the four cheese mushroom pizza which is my favorite. If you really like rosemary there's also a potato rosemary pizza. My mom enjoys the margherita pizza when she visits. We usually get 2-4 square slices per person for two people and two drinks, and we generally have a cost of 14-18$ because they charge you by weight. They will heat it up for you if you ask, but I will note it still is quite tasty at room temp. They have been very nice and have always wrapped/packed my slices nicely.\n\nI haven't tried their gelato (i would have to eat it before the pizza for takeout) but it looks good along with their dessert spread. This pizza tastes like what I had in Italy, pizza al taglio. I prefer this type of pizza to say Neapolitan style personally.", "date": "2020-12-04 22:57:47", "user": {"name": "Elise", "review_count": 144, "yelping_since": "2011-09-03 05:58:49", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.41, "fans": 9}}
{"review_id": "QVJLDVKvP--cWNmUC60lfA", "user_id": "rxgoHeIus7ES4cGrg8DUqQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Visited this restaurant for dinner a couple of times and got some drinks. The drinks were very reasonably price I think. Both of the pizzas were very delicious. One was a margherita pizza and the other was a amatriciana pizza. I would definitely recommend. They have heating lamps for outside dining. Our waiter wore a mask and they have sanitizing stations inside the restaurant.", "date": "2020-12-04 02:56:59", "user": {"name": "Tashalee", "review_count": 183, "yelping_since": "2014-11-18 14:55:26", "elite": "2018,2019,20,20,2021", "average_stars": 4.19, "fans": 35}}
{"review_id": "0MWFjJdeoCDmCH8cI6ugzw", "user_id": "y8bw--UQIOI8yNcCfzynTw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Alice Pizza you are most certainly magnificent, I had a lovely experience here yesterday. Very cute spot with great prices and good choices. Absolutely yummy! Every single thing is super fresh! All of the staff are really pleasant - you certainly feel welcome and taken care of. Certainly will come back to Alice Pizza always.", "date": "2020-11-02 12:49:19", "user": {"name": "Cynthia", "review_count": 149, "yelping_since": "2020-10-18 23:42:10", "elite": "", "average_stars": 4.8, "fans": 1}}
{"review_id": "tb1fLmEW92UvFa6E8RwtGg", "user_id": "rn7waL3tAu6qoB7RGNzuKg", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Finally got to check out this place that's right across the street from my place! We ordered the Diavola Pizza, Calamari Fritti, and Cotoletta Romana. The pizza was so delicious and so flavorful, with plenty of sauce and toppings! The thin square pizzas are my favorite kinds to eat, and Alice Pizza does the Roman style pizzas so well. The calamari was lightly fried (which I like), and chicken cutlet was very filling. Sadly, I didn't get to try any dessert this time, but I'll definitely be back to try it next time! I'm so glad I found a nice pizza spot to satisfy my pizza cravings!", "date": "2020-10-31 16:36:28", "user": {"name": "Jung", "review_count": 91, "yelping_since": "2012-07-10 04:03:32", "elite": "2019,20,20,2021", "average_stars": 4.41, "fans": 5}}
{"review_id": "M8kG6SGilbS74rIf0Qt28w", "user_id": "zwsAA-LTMBQlheFLO2HRCA", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The desserts and the ice creams are great, although the ice cream was a bit too sweet for our liking. Loved the chocolate-raspberry mousse, though!", "date": "2020-10-28 23:11:34", "user": {"name": "Alexandra", "review_count": 184, "yelping_since": "2015-10-16 20:10:22", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.77, "fans": 9}}
{"review_id": "1DFj275BJ6ije2_h0e6hJQ", "user_id": "02j6aTPZVzzYdHeJ-JIT5w", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Alice Pizza never fails to satisfy my pizza cravings. The crust is so buttery and delicious!!", "date": "2020-10-21 04:38:17", "user": {"name": "Perry", "review_count": 8, "yelping_since": "2011-11-29 00:32:50", "elite": "", "average_stars": 3.75, "fans": 0}}
{"review_id": "tBSxpDihHoNB9rX0enH3Vg", "user_id": "B_SBNlvZ46mzV4c6yqVBMA", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love Alice. It was my go-to for a quick post-show bite before COVID and today I got a personal pizza for takeout for the first time -- it was great! I got the Quattro Stagioni since that had never been available for slice orders (all I'd ever done before).", "date": "2020-10-19 04:03:44", "user": {"name": "Laura", "review_count": 28, "yelping_since": "2019-10-09 22:55:33", "elite": "", "average_stars": 4.7, "fans": 0}}
{"review_id": "4P4g7ne_a7G8G7RUztJi2g", "user_id": "94BPeyvx0Ow447J-R7nxYA", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pizza is delicious each time we go. The diavola (spicy pepperoni), bufala Margherita, and fungi quatro (mushroom) are all amazing. We've only done pizza takeout so don't know about the restaurant experience. The desserts we've tried were not great (cannoli and Napoleon), but we'll keep coming back for the pizza.", "date": "2020-10-17 01:08:29", "user": {"name": "James", "review_count": 26, "yelping_since": "2012-12-04 05:56:48", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "DETqFJCVMNki85N6R_leiA", "user_id": "HVQKFDi-vZbawtmLMq3ZOw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I went to one of the Alice locations in Italy years ago, and I'm so glad they opened up stateside!! The pizza is by weight (just like in Italy) and it's amazing. The tomato pizza was my favorite, though the porcini mushrooms and sausage was also great. I need to come back to try the gelato and tiramisu!", "date": "2020-10-11 14:40:36", "user": {"name": "Gab", "review_count": 2422, "yelping_since": "2010-06-12 13:05:15", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.2, "fans": 178}}
{"review_id": "4WWJcPN4EUsFPdMr_48F1Q", "user_id": "bI3QkGVFF5yE9xA_I5L9ig", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "WOW!!! The pizza was so flavorful. I loved the variety of ingredients to chose from. Cute little place too.", "date": "2020-10-09 19:29:42", "user": {"name": "Angela", "review_count": 37, "yelping_since": "2014-07-24 21:42:12", "elite": "", "average_stars": 3.48, "fans": 0}}
{"review_id": "Pa447OaaYeMN6fuTTQ2Cbg", "user_id": "Oi1lBdMgdPyGVs1xk1H1rQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is my favorite pizza in philly so far. You can pay for it by the ounce or get trays of it. I hate to admit that I have finished a whole tray by myself. The pizza comes in squares and is not overly greasy. My favorite is the Pachino E Bufala. This place is great for take out or carry away. There is not much room to dine in the the food other than pizza is not noteworthy. They do however have amazing gelato that you can get in small portions or a pint to save for later! This is ALWAYS my go to pizza place for myself and guests love it when I have people visiting.", "date": "2020-10-08 22:13:07", "user": {"name": "BJ", "review_count": 44, "yelping_since": "2020-09-10 02:06:02", "elite": "20,20,2021", "average_stars": 3.89, "fans": 1}}
{"review_id": "IEE7NJpIEhcPmD_c63J3jA", "user_id": "LdC0q5yrp7ObPCiVGaTzTQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ate here twice, as dinner takeouts: Pizza + ziti. \n\nDelicious but VERY THIRSTY waking up the next day.", "date": "2020-09-26 11:01:42", "user": {"name": "Vin", "review_count": 8, "yelping_since": "2016-06-11 00:08:38", "elite": "", "average_stars": 1.67, "fans": 1}}
{"review_id": "2syZ4i99ji8r6E9RJEgzqA", "user_id": "mC_BjoGIJbS5XD9BA91CVw", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Edit: Restaurant delivered a new pizza to me quickly (see other photo below).  I appreciate the phone call and the hassle free redelivery.  I'll be a returning customer for this. \n\n---------------------------------------\nOrdered a pizza from Here through Caviar. See the photo to look at what I got.  A bunch of COLD dough, cheese and toppings in a box. This isn't a pizza. It's literally cold like it's been outside for half a day. \n\nWill update my review if they make it right.", "date": "2020-09-21 22:21:46", "user": {"name": "Mike", "review_count": 15, "yelping_since": "2013-07-06 00:56:50", "elite": "", "average_stars": 2.95, "fans": 0}}
{"review_id": "6l7SDf8Y1XjyWV7DTiavKQ", "user_id": "dwvtZLPpwUCI5G-vPd4iWQ", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Super delicious!! Prefer the strawberry cheesecake over the tiramisu. The suppli al telefono was crunchy and delicious. The diavola pizza (added mushrooms) was seasoned perfectly with the right amount of spice for a kick. Would definitely recommend!", "date": "2020-08-26 19:38:14", "user": {"name": "Grace", "review_count": 11, "yelping_since": "2012-05-04 14:36:09", "elite": "", "average_stars": 3.36, "fans": 1}}
{"review_id": "zBiHfw68kmuc2KR0fR1Njg", "user_id": "96JZapwKFbOc5MrXLh8E2w", "business_id": "VSDdUwXktnvL_O0meKv7MQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Big fan of Alice Pizza! It's a pretty unimpressive storefront, but the inside is beautiful. You can walk up to the counter to order pizza and/or gelato. My date and I split a few slices of pizza, which were delicious. We got one with mushrooms and one with sausage, and we definitely had some leftovers. The outdoor seating is a little lacking, and it is in a busy spot of town, so it might not be an ideal place for a quiet dinner. That being said, I had a lot of fun and can't wait to go back.\n\nBy the way - it's called \"A-leech-ay\".", "date": "2020-08-21 12:30:08", "user": {"name": "Neil", "review_count": 426, "yelping_since": "2013-12-29 21:54:09", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.23, "fans": 14}}
