{"business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "name": "LaScala's", "address": "615 Chestnut St", "city": "Philadelphia", "state": "PA", "postal_code": "19106", "latitude": 39.949529, "longitude": -75.152139, "stars": 3.5, "review_count": 367, "is_open": 0, "attributes": {"RestaurantsReservations": "True", "BYOBCorkage": "'yes_free'", "RestaurantsDelivery": "False", "BusinessAcceptsCreditCards": "True", "RestaurantsGoodForGroups": "True", "OutdoorSeating": "True", "RestaurantsAttire": "'casual'", "Alcohol": "u'full_bar'", "GoodForKids": "True", "Corkage": "False", "BusinessParking": "{'garage': True, 'street': False, 'validated': True, 'lot': False, 'valet': False}", "RestaurantsTakeOut": "True", "RestaurantsPriceRange2": "2", "WiFi": "u'free'", "HasTV": "True", "NoiseLevel": "u'average'", "Caters": "True", "BikeParking": "True", "RestaurantsTableService": "True", "HappyHour": "True", "BusinessAcceptsBitcoin": "False", "Ambience": "{'touristy': False, 'hipster': False, 'romantic': False, 'divey': False, 'intimate': False, 'trendy': False, 'upscale': False, 'classy': True, 'casual': False}", "WheelchairAccessible": "True", "GoodForMeal": "{'dessert': None, 'latenight': False, 'lunch': True, 'dinner': True, 'brunch': False, 'breakfast': False}", "DogsAllowed": "False"}, "categories": "Pizza, Restaurants, Italian, Salad", "hours": {"Monday": "0:0-0:0", "Tuesday": "11:30-21:0", "Wednesday": "11:30-21:0", "Thursday": "12:0-20:0", "Friday": "11:30-22:0", "Saturday": "11:30-22:0", "Sunday": "15:0-1:0"}, "category_list": ["Pizza", "Restaurants", "Italian", "Salad"], "stratification_tag": "Italian"}
{"review_id": "5cT4hzd7XKiWcDcTBqmsaA", "user_id": "W30i4p00F8WnXYRutiRUNg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "We love lascala's at cooper River and had family visiting from out of town. They wanted to eat in Philly and I sadly recommended Lascalas at Passyunk expecting the same great food. \n\nTheir pizza is a sad version of the excellent offerings at their NJ location. \n\nServers were all nice and cordial.  Location is good. \n\nFood was not. \n\nThe chicken parm pizza was very good. \nGarlic pizza was just a ton of garlic powder. No shaved roasted garlic like in NJ. \nTheir marinara was not as good as NJ either. \n\nSkip this place. \nMaybe it's ok if you never had the better versions of their menu.", "date": "2021-08-01 12:31:43", "user": {"name": "James", "review_count": 13, "yelping_since": "2015-08-14 18:31:26", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "cYiRtUAz9bqGGYG6Sg9OQg", "user_id": "2sAn28_SpSeWqbSYqKUViw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "Visited LaScala's with my husband two weekends ago when we were visiting Philly for our anniversary. We both were in the mood for some itialian food and pizza so we decided to give this place a try. To our surprise, we visited on their re-opening night. We were told by the host that we would be seated outside since the owner was celebrating the grand opening with his guests inside. We weren't bothered since the weather was nice and they had patio heaters, it was a nice ambiance. We ordered a 5 cheese pizza and Philly Cheesesteak calzones however, only the pizza was good. The food overall  was underwhelming. My husband also ordered a Lofi sour, which was too sour to drink. He had originally asked for a mojito, but they only had the 5 drinks available on the menu. Service was just ok. Really wanted to like this place, but we wouldn't return.", "date": "2020-11-03 00:26:06", "user": {"name": "Astrid", "review_count": 20, "yelping_since": "2014-05-13 23:05:24", "elite": "", "average_stars": 3.23, "fans": 1}}
{"review_id": "Pl4Hr9Ka9u46TtzJlKrwzw", "user_id": "XD_SGGnLRR-NmdI_jjobZg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "Boy, am I full! I didn't even eat any of the Italian Wedding Soup I ordered as I was just stuffed.\n\nMy coworker and I came here after the new grand \"reopening.\" LaScala's Fire has been open about a week and used to just be LaScala's. In these COVID-19 times, we were upset when they closed thinking it was for good. Thank God it wasn't!\n\nLaScala's Fire has a very easy to use online ordering website and I used it without any difficulties to place a pick-up order. I love how with certain items they move into sub-menus for extra add-ons or take-aways. The price adjusts accordingly for the add-ons. After placing your order, they give you a time it should be ready and it was!\n\nThe Alicia's salad was nothing much in way of the salad itself. Greens, chickpeas, onions, tomatoes, but I added some calamari which upped the game, and the dressing they kept to the side. However, the gigantic sphere of a meatball with a huge amount of ricotta and red sauce was almost a meal in itself. Perfectly cooked with an almost crispy outer rim, juicy inside and so much flavor. Mixed with the ricotta was perfect. I was not the biggest fan of the red sauce, but everyone has their preferences. \n\nThe fried calamari came back to work a little on the soggy side, and they were too salty for me. Next time I'll try at the restaurant itself and I bet they'll be better. Most of that came home for someone else in the family to enjoy.\n\nLastly, dessert was so decadent. The zeppoles were perfectly fried dough balls in powdered sugar with an outstanding cannoli cream over them. Then, to somehow make them even better, a raspberry dipping sauce. OMG. \n\nMy coworker really liked her chicken Caesar salad that she added bacon to. Couldn't finish it but did chow down on the nice grilled chicken. Had to save room for the zeppoles! \n\nLaScala's Fire also looked awesome inside in gleaming white and has plenty of seating. The staff were using all COVID-19 precautions. We inquired about a luncheon and they said they are taking things day by day as the rules seem to change by the second in Philadelphia. However, they can accommodate.\n\nThe online ordering menu allows for a tip to be added, and you pay with credit. $67 for everything including tax and tip - 2 salads, soup, calamari, and zeppoles! I'll definitely be back to try the pizzas, paninis, Stromboli, calzone, some other starters, and their favorites. Really, one of everything, please, extra meatballs.", "date": "2020-10-30 17:00:19", "user": {"name": "Michael", "review_count": 607, "yelping_since": "2011-10-26 12:55:21", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.0, "fans": 36}}
{"review_id": "eNLP06y99O9sMvFtoSpE1w", "user_id": "sAigaJRNfiFohTgH_EKCVw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "LaScala completely remodeled over the last few and reopened as LaScala Fire. The remodel is stunning! Larger bar , open kitchen . Gorgeous!  Luigi was our server and attentive and fun. The menu has changed some but the food was delicious . The portions were huge and enough to take home for a second meal . What are you waiting for ? Make your reservation today!!", "date": "2020-10-29 12:02:33", "user": {"name": "Lynn", "review_count": 38, "yelping_since": "2012-04-19 01:03:35", "elite": "", "average_stars": 4.51, "fans": 0}}
{"review_id": "8iqUPB81ECjvLYwl7cPJjQ", "user_id": "CWG56gJr5zfSMRckvhxqEw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great food and great service! You walk in and see the beautiful bar to your left and the dining room to the right. I have not yet utilized the happy hour at the bar yet, but rest assured I will be back for that. My party and i split the eggplant appetizer and the ricotta board and it was gone in no time. I got the gnocchi last night with Alfredo sauce and it was delicious. I only wish I had saved room for desserts! I would definitely recommend for a more dressed up, yet casual, dining experience with a group of friends or an affordable date night.", "date": "2020-03-07 16:26:15", "user": {"name": "Antonio", "review_count": 13, "yelping_since": "2018-05-22 15:16:43", "elite": "", "average_stars": 4.77, "fans": 0}}
{"review_id": "Z6ifA4feitydcbNLs8AD6g", "user_id": "modbeam24iJy9rWmF4awFQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The exterior of LaScala's right off the bat is quite inviting and intriguing. I was seated at a candle lit table next to the window in the back room, which featured quaint chandeliers and friendly prints around the room. The waiter was quick to greet us and I knew I wanted the fusilli with seafood before I arrived. The food came very fast (it was 5 pm so it wasn't that crowded yet). My food was extremely hot and steamy, which was impressive but somewhat intimidating. The food was delicious! I had never tried scallops before and they were lump and delicious. The shrimp still had the tails attached unfortunately, but they were satisfyingly easy to slide off. The pasta itself was fresh and the sauce was delicious. The only complaint I really have is how small the glasses are, which had my waiter refilling it every time I took a sip. We had a cannoli afterwards which was also very delicious. By the time it came the restaurant was very lively with a cheery and romantic atmosphere. This place is great for a date and I would 100% recommend!", "date": "2020-02-15 21:40:26", "user": {"name": "Wayne", "review_count": 5, "yelping_since": "2013-12-21 02:51:06", "elite": "", "average_stars": 2.8, "fans": 0}}
{"review_id": "slk1B2OIXSK-CUyBCYXKNQ", "user_id": "Mv6VwUqfuCndBWPg9uthOA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went on Valentine's and although it was (rightfully) busy, the food was out in less than 15 minutes. The salmon was incredible and so was the lava cake. When I had asked the host for better seats he did not hesitate. A relaxed environment with great food, definitely recommend!", "date": "2020-02-15 18:06:50", "user": {"name": "Matheus", "review_count": 7, "yelping_since": "2016-02-28 18:37:38", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "jr8ENZ7v_O4zudOMAVDxwQ", "user_id": "MuJkO8PNzJ-abgwjuDsAGA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Visited last night and was blown away. The staff was extremely nice and attentive, and had the food out in less than 15 minutes from when our order was taken. Amazing food and great atmosphere. Would definitely recommend to anyone who's visiting Center City.", "date": "2020-02-15 18:04:14", "user": {"name": "Kristen", "review_count": 5, "yelping_since": "2017-06-06 01:07:59", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "99_GcNojE1SV55sePUYRyg", "user_id": "FPWH8L_B5XXGB6EGkN4kLA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Salmon was cooked to perfection overtop a hearty bed of spinach.  Chicken Marsala was delicious and serving sizes were fair.  Prices weren't steep.  Overall, it was a good experience with Sergio as my waiter.   I just wish that my table placement was different on valentine's today.  My table was all the way in the back corner and to be honest. I didn't feel like I was apart of the restaurant at all. Complementary parking above the restaurant was a winner.  Overall.  I would probably return sometime in the future.", "date": "2020-02-15 17:19:01", "user": {"name": "Brendan", "review_count": 8, "yelping_since": "2019-02-17 17:55:35", "elite": "", "average_stars": 2.33, "fans": 0}}
{"review_id": "8wP-NPB2nFsgiIK9g4ZNnw", "user_id": "ODU5vlt_r299tWAXtnfO9g", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "LaScalas is a wonderful spot in a great location within walking distance from the liberty bell and independence hall. The interior has a somewhat swanky feel with large leather booths and dim lighting. When you enter you walk by giant dessert carts filled with mouthwatering treats.\nThe food did not disappoint! We highly recommend the brussel sprouts as an appetizer. They were cooked perfectly with pancetta and balsamic for a beautiful flavor and texture. The calamari was pretty good and the truffle Mac and cheese was also good, however the truffle flavor was not as strong as we hoped. \n\nThe rigatoni a la vodka was pretty good, but nothing too special. However, the pizzas were incredible. If you dine here, DEFINITELY order a pizza. The crust is perfectly cooked and has a crunchy base. The buffalo chicken pizza and prosciutto pizza were both raved about at our table! They also had a great selection of wines that made everyone happy.\nDefinitely worth trying LaScalas!", "date": "2020-02-11 03:22:16", "user": {"name": "Alissa", "review_count": 65, "yelping_since": "2017-07-14 15:03:05", "elite": "20,20,2021", "average_stars": 4.22, "fans": 5}}
{"review_id": "z9685KB20LgXiiBdECNHIw", "user_id": "oXZDWYnkbbQkf8jJnbl09g", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food use to be so good but I don't know what happened. I haven't been here in years and was so excited to return. First, I ordered a pitcher of sangria but the size that was given definitely was a carafe. The price I paid for the sangria wasn't worth it all. Plus, I ordered the rose sangria and it tasted nothing like rose. It seemed like I was given a white sangria. The mussels and sausage appetizers I ordered just weren't good. Something about the flavor was off. The entrees were mediocre, well at least the rigatoni vodka. I remember having it back then and it was amazing. The seafood pasta was just horrible. It tasted like I was eating the entire ocean. It really was a turn off. I've had seafood pasta before at other restaurants and it definitely didn't taste like that. The sauce tasted like nothing. No flavor at all. Finally, when my plates were cleared, dessert was not offered and immediately he informed us he would bring the check. I did stop him and asked him what desserts were offered. I got the chocolate cake and it was probably the best thing I had the entire night. Service was mediocre and food was definitely not great. Definitely won't be coming back!!", "date": "2020-02-02 04:05:58", "user": {"name": "Amy", "review_count": 6, "yelping_since": "2013-01-18 20:48:30", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "PE7jDfzN3a4ZqE-4FwbHCA", "user_id": "bJnfc8WsA_zwf30gVSyGEw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Convenient to go to after the theater. TOok us earlier than  our reservation. No problem. Surprise! Restaurant Week! Didn't know but everything I wanted was on the special menu. Chopped Sally's, baked eggplant, aranccinni. Enough to share. Seafood fusilli was amazing. I kept the tiramisu to myself and wanted to lick the plate. Took home leftovers. Will definitely go back. Maybe for pizza. ThE piece  I tried was outstanding. Especially the crust!", "date": "2020-01-20 07:53:06", "user": {"name": "Lynne", "review_count": 16, "yelping_since": "2015-10-08 13:11:53", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "jEVQkY0kk1z83j5FlDdyVw", "user_id": "yFzqqCYYfiog6zin2P_7uA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "Such a shame with the lack of private event customer service, since their food is delicious. I called the third week of December in regards to holding a rehearsal dinner for February. The host who had answered the phone was great! She informed me the manager will respond within 2 business days with pricing but that the restaurant is completely available.  I had asked if they could just email me prices and expressed that I was very interested, as well as give who had referred me to them. I had also send an email request prior to my call with the same information. I waited for over a week, with regards and  understanding due to holiday parties it might take a few extra days. After 10 days, I had called back again and expressed to the host that I had been waiting for pricing and would like to have an idea before booking as we are in a time sensitive manner. The gentleman only took my name, not phone number, date I requested, or any other information and explained the manager is out of the office and will respond when he returns. It is now another week past and I have yet to get a response. As I work in the sales and event management business for over 10 years, I'm astonished with the last of follow through and customer service on potential business.  complete Mismanagement", "date": "2020-01-02 23:42:01", "user": {"name": "Megan", "review_count": 7, "yelping_since": "2014-09-08 20:09:41", "elite": "", "average_stars": 2.63, "fans": 0}}
{"review_id": "LTyVe_FaBhLSeN30qAsVNg", "user_id": "7gt5Lue__iRo4aFrH4POvw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went there on New Year's Eve for an early dinner. Had a special menu for the day and it had nice selection. I had reservations and was seated immediately. Was seated by the window which my daughter and wife enjoyed. Server was rough in the beginning but he warmed up and turned out to be a Great server! The food was very good. My wife had the seafood Fra diaolvo and I had the short rib with risotto. They were both very good. This was our 2nd time at this location and it was very enjoyable.", "date": "2020-01-02 14:39:30", "user": {"name": "Charles", "review_count": 103, "yelping_since": "2011-12-29 13:55:55", "elite": "", "average_stars": 3.4, "fans": 3}}
{"review_id": "ygQ1dM9bN4tGJsTVCKa9Aw", "user_id": "CIVdUWy8KevSfFqgDcoRpg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Hubby had a cast, so we decided on a restaurant near our hotel. Usually restaurants near hotels especially near tourist attractions are just \"ok\". In addition we have had great Italian in South Philly, so our expectations were low. \n\nWe are eating our words!! Hubby wants to return again this weekend. It was an amazing Italian meal.\n\nWe had the lemon cello martini over ice in a tall glass- so yummy.\n\nThe 3 meatballs appetizer was enough for 6 of us to share with the rolls- rolls served with softened butter in olive oil.\n\nThe beet salad was also enough for sharing small bites- very good and I highly recommend.\n\nThe veal parmigiana was simple and yummy!! The broccoli rabe was light and tasty with fresh, crisp vegetables and sausage.\n\nThe pappaderelle was delicious! The vegetables were perfect and meaty tasting.\n\nThe Creme Brûlée was good, but the lemon cake  was sensational!!\n\nThe wait staff was super friendly, took our picture and the regulars were friendly and chatty.\n\nGreat experience", "date": "2019-12-27 04:51:09", "user": {"name": "Cathy", "review_count": 170, "yelping_since": "2010-12-02 01:37:43", "elite": "2018,2019,20,20,2021", "average_stars": 4.79, "fans": 7}}
{"review_id": "bBJOVS2tBOP1H7NVaygVrw", "user_id": "mNAVI_w-Bg_Us1gV4Dzphw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Was pleasantly surprised..the food was very tasty and my waiter was very good!! Will tell friends to try it and am glad I know this is there!!", "date": "2019-12-13 21:40:48", "user": {"name": "Helene", "review_count": 12, "yelping_since": "2011-07-15 21:34:01", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "GYLdTNEif6taFNlrsTS-Bg", "user_id": "sdkBG4H2tNsTwgVV3OTRcg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time here - absolutely fantastic. Food was outstanding, sangria was delicious. First off the appetizers ... stuffed long hots and the ricotta board. Both were phenomenal and Ive never had ricotta and honey before and it was just such a delightful mixture and was amazing with the homemade bread. My fiancées entree was a great pasta in creamy red sauce with lump crab meat, shrimp and scallops. My entree was a perfectly cooked strip steak covered in a mozzarella cheese on a bed of mashed potatoes and broccoli rabe. Zero complaints on food. The service was also perfectly okay, not too on top of you and allowed you to enjoy the food. Setting is also very comfortable and open. They also offer free parking in a garage nearby with entree purchase which in Philly is huge. Will certainly be back to try more of the menu! Great first experience.", "date": "2019-11-06 04:15:40", "user": {"name": "Mark", "review_count": 27, "yelping_since": "2014-05-14 08:38:55", "elite": "", "average_stars": 3.47, "fans": 0}}
{"review_id": "woHmGh8Zhoq9qVQf9DmDPQ", "user_id": "3Rs8FMPalqkgAorEZY4iKA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Still great!  We hit this place a few times a year.  Love it.  In 9 years I think we had 1 bad meal and apparently there was a chef issue that night.  The only other bad experience was an ignorant patron that was upset that our children were there at 8pm.  Get over it lady!  This is their city and they are extremely well behaved... in restaurants anyway.", "date": "2019-10-25 20:46:38", "user": {"name": "Marissa", "review_count": 25, "yelping_since": "2011-05-01 14:57:38", "elite": "", "average_stars": 3.85, "fans": 1}}
{"review_id": "6gs_Pe5LwjMuA75iVBJ2XA", "user_id": "YeT54AS1s5HR0lXqvmnxdg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The atmosphere is nice , service was very good  but the food had a lot to be desired.  Salad was wet, pizza was so dry I could not eat it. , pasta was on level of Olive Garden. My friend ordered ravioli and she was disappointed ( it was the special too)   There are so many great restaurants in Philly so I would not put this on my list !", "date": "2019-09-08 04:54:30", "user": {"name": "E Marie", "review_count": 44, "yelping_since": "2012-08-05 17:25:00", "elite": "", "average_stars": 3.41, "fans": 0}}
{"review_id": "wTuPUqcBGALLZ9BjCRGE6Q", "user_id": "JLjwyhktF1GgK6fElnZzzQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Just ok....went here cause the place we wanted to was closed and it also had outdoor seating, which was nice. Menu is alittle pricey and everything was just ok. We got calamari for an app, which was the best is the meal. My husband for a pizza and I got the chicken francese. Both were bland and ive had way better. Service was fine and being outside was nice. Place was empty at 6pm in a Sunday.", "date": "2019-09-03 21:36:25", "user": {"name": "Kim", "review_count": 206, "yelping_since": "2013-08-27 17:52:29", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.82, "fans": 8}}
{"review_id": "FppG4gZusQlHYP_slayOug", "user_id": "_rX2xDlQtbDipXJpg53-bA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "We came here for dinner around 6:30 on a Saturday. The place was pretty empty. The interior is nice. There are a ton of canvas photos of random people everywhere. We asked the waiter who they were and he said it was family photos of the owner. Which is cool!  We each ordered a glass of wine. I had the peperadelle pasta and my husband had the bolognese. Our dishes were very sub par. They weren't bad, but they weren't good either. It felt like Olive Garden quality. Overall, we had an ok experience, but it was mediocre food.", "date": "2019-09-01 01:33:15", "user": {"name": "Morgan", "review_count": 183, "yelping_since": "2016-09-03 00:16:28", "elite": "2018,2019,20,20,2021", "average_stars": 3.52, "fans": 7}}
{"review_id": "6_esXcdwHCsbmtxb3E166Q", "user_id": "-ohsN0tzF5qEkR1S-cj8UQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "We went there 8/19/19.  The service was good, but the food was bland.  They offered to make something else or give us some seasonings, we chose to add some seasonings.", "date": "2019-08-21 11:40:58", "user": {"name": "The", "review_count": 8, "yelping_since": "2011-08-07 22:34:08", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "vLk_ykdTI6OUMYKVglV76Q", "user_id": "Y8feumhKHDt8f7O1Zlsurw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not the LaScala's it used to be. At one time, it was a go-to restaurant for me. The atmosphere, food, and service was great. Now, I'm giving 1 star for service, and 1 star for the apps. What's good... the service. Our waiter was Kenardi, and LaScala's is lucky to have him. He's the only reason the experience didn't end up being a disaster. He's very attentive and friendly. The food... The bread and oil dip is excellent. The appetizers we had was pretty good (White Pear Pizza, especially ) and Im glad because we sent back 2 entrees. Both were chicken pasta dishes. The chicken was literally boiled in water and thrown on top of noodles, it was absolutely flavorless, the sauce was just as bad... it was like eating cardboard topped with chalk. Both dishes were really terrible. I couldn't even dress it up. Use the seasoning rack, dammit! The atmosphere is confusing. They have candles lit on all the tables, but what mood is that setting when your customers under lights bright enough for a broadway show. Also, they don't pay attention to seating. The restaurant was pretty empty, so sitting adult parties next a table with 3 screaming kids wasn't very thoughtful. I think it's unfortunate the way LaScala's has changed. It's not hard to get it right, you just have to pay attention, and put the effort in. Prior to this visit, it has been a long time. I'm not gonna say I'll never go back, because I'm really hoping this was just a bad night, and I can still count on one of my old favorite restaurants. We'll see.", "date": "2019-08-07 09:01:04", "user": {"name": "L", "review_count": 38, "yelping_since": "2012-06-16 22:56:07", "elite": "", "average_stars": 3.28, "fans": 0}}
{"review_id": "W6xcT5p478iEzuNqjHuFwQ", "user_id": "jYkie_ON5RKU85bXb7joLQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We went on Easter Sunday. We had drinks at the bar before dinner. The food was very good and the service was also attentive.", "date": "2019-07-24 17:23:37", "user": {"name": "Robyn", "review_count": 71, "yelping_since": "2013-03-28 06:27:22", "elite": "", "average_stars": 3.82, "fans": 5}}
{"review_id": "uHp3yeW6az_f_CwXNNLbqw", "user_id": "ZXuiFhaHRabZIG9ehezUoQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 1, "funny": 2, "cool": 0, "text": "I was greeted by the manager at the door with, \"What can I do for ya, Buddy?\" When I told him I was there to eat, he seemed displeased with that.\n\nThe stuffed long-hots were great. The veal Marsala was good. The espresso was good too. My server was polite and efficient.\n\nOver all, it was an unfortunate experience.", "date": "2019-07-04 18:47:54", "user": {"name": "William", "review_count": 3, "yelping_since": "2014-06-21 04:03:41", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "SJcwxesH6REJiVOj83FfbA", "user_id": "Idy2kKgrD7pMBTjIhXIMJQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 2, "text": "Lovely eve for outside dining and great locale but our waiter was pretty slow taking our orders. Pizzas were reasonably priced and much larger than expected. The tomato sauce on the gnocchi was very fresh and seasoned perfectly. Crunchy crust. Pear, Arugula and prosciutto pizza tasty but a little too much prosciutto and had only a small amount of oil soaked arugula centrally.", "date": "2019-07-03 03:58:33", "user": {"name": "Heather", "review_count": 40, "yelping_since": "2016-05-14 21:41:40", "elite": "", "average_stars": 4.63, "fans": 0}}
{"review_id": "BdTOZJD_6IjvJiBkLG4cRg", "user_id": "sSKM2zeM2O-jSYqq3yjR8A", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "sat outside on a not so busy night.  The service was the worst I have  experienced in a long time.  Took a long time for the server to arrive at our table.  ordered 2 glasses of wine, again took a long time to arrive.  ordered our food, again a long wait.  pizza was \"cold\".  we had to track down the server and tell the pizza as cold.  she brought another hot pizza out.  My clams and linguine was very good. My water was never re-filled until the end of our meal.  The server volunteered to bring a bowl of water for our dog.  that never happened. They did not not charge us for the pizza. The problems were likely the server but will not return.", "date": "2019-06-09 12:13:30", "user": {"name": "Marc", "review_count": 61, "yelping_since": "2010-01-29 01:01:08", "elite": "", "average_stars": 4.3, "fans": 1}}
{"review_id": "QtNjKHCYKGjaaqBKFvJdJQ", "user_id": "toC5X76auB7oCDtDODuRwA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Had open table for 9pm (we arrived 45 minutes early thank goodness) after a graduation, but usual closing at 10pm. So obviously no one was happy to see us. \nFood was ok, not memorable.\nWait staff while very professional and polite but unfortunately for him I saw the look he gave the host.\n\nDrinks were great.\n\nAlso unfortunate road construction too!\nOverall plan our to celebrate my daughter's graduation were not successful", "date": "2019-05-21 17:36:11", "user": {"name": "Paula", "review_count": 44, "yelping_since": "2014-03-09 04:49:08", "elite": "", "average_stars": 3.45, "fans": 2}}
{"review_id": "Uv-yE6e4xQTbC5hx531ejQ", "user_id": "fQl_sfLGDBAgQgnwDfgYgA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "LaScala has a great happy hour. The drinks are tasty and they don't skimp on the cocktails. The calamari is fried perfectly and the cheesesteak rolls never disappoint. The atmosphere is nice and the bartender is too!", "date": "2019-05-20 00:15:08", "user": {"name": "Sherrie", "review_count": 34, "yelping_since": "2015-03-01 15:06:12", "elite": "", "average_stars": 4.14, "fans": 0}}
{"review_id": "zVI0IlUQucxD690jmvCN-g", "user_id": "rzTDNNnqksThPVu2lvI2fQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "I am here right now and I am receiving the the worst service I have had in a very long time. Wow. It's terrible. Don't come here. Don't come here.", "date": "2019-05-19 00:56:15", "user": {"name": "John", "review_count": 8, "yelping_since": "2011-03-06 18:37:04", "elite": "", "average_stars": 3.38, "fans": 1}}
{"review_id": "5Yq0R1RRceKCjQz5Tk50Kw", "user_id": "hXcFcp56qOkrBKdoxKpJ8w", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "WOW! This place was DELICIOUS. \n\nThe bread is amazing and the butter is mixed with balsamic OMG.\n\nThe gnocchi was great! I got the Pappardelle which was good but next time Ill get the gnocchi for myself.\n\nThen we had the best chocolate cake ever. Wow, what a meal! A little pricey, but WORTH IT", "date": "2019-05-16 19:02:19", "user": {"name": "Karli", "review_count": 9, "yelping_since": "2013-02-18 21:03:10", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "5DbnRI_naCyQPdrexFjoYw", "user_id": "dqk8toUXSmboUwaFtOFZXw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "All the food is great, especially the bread they give you! Everyone working there is always very friendly and helpful. One of my favorite places to get pasta in the city, would definitely recommend.", "date": "2019-04-25 02:13:47", "user": {"name": "Taylor", "review_count": 2, "yelping_since": "2018-07-11 23:06:52", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "zbaQG1UMmmC83LblcFecYQ", "user_id": "ivJjQIl-16rIDI32dlVjnA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Philly has an unlimited number of great restaurants in Center City.  This is one of my favorite places for lunch.  I like the salads.  I usually have wine at the bar but I have a lot of walking to do so today I'll forgo that for now.  \n\nThe food is always good, staff friendly and the seating comfortable.", "date": "2019-04-22 16:40:50", "user": {"name": "Clare Marie", "review_count": 50, "yelping_since": "2013-05-15 18:24:20", "elite": "", "average_stars": 4.55, "fans": 2}}
{"review_id": "AQP7CmiYcAoQCWzFZYCIxA", "user_id": "2ro4B-U1x6GBJFbbYJhLVQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pasta is light and perfect! A great meal before a long ride home!! The sauce is also Amazing!!", "date": "2019-04-21 19:02:16", "user": {"name": "Victoria", "review_count": 4, "yelping_since": "2016-06-04 19:24:15", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "Mf0HfU14d_5Q6RcHCUE2ug", "user_id": "7iw-4p8H00ys9e5r8UtGHg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "I came here only after I had eaten their food at my job that had an event and it was catered by them. When I say the chicken parmigiana was soooo good, it was just that!! That's the reason I'm back here by myself  I should get a pizza while I'm here too since it's only six bucks during happy hour. Oh I can wait until tomorrow since I'll be in this area again!!!", "date": "2019-04-09 20:21:43", "user": {"name": "Natasha", "review_count": 149, "yelping_since": "2015-05-31 02:07:53", "elite": "", "average_stars": 3.41, "fans": 6}}
{"review_id": "G6XnvimFpQJD32b1h8fJHQ", "user_id": "5kZvUX8-rvTvoEaK5gB5CQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "Reliable classic American Italian dishes in a clean, modern environment. The staff is well dressed and professional and the food is above average. The menu isn't incredibly creative or inspired but you won't leave hungry or unsatisfied. Wine list isn't the best and slightly overpriced but the dishes are very reasonably priced with very large portions.", "date": "2019-04-09 02:08:55", "user": {"name": "Chris", "review_count": 121, "yelping_since": "2009-03-20 16:57:52", "elite": "2019,20,20,2021", "average_stars": 3.98, "fans": 5}}
{"review_id": "2j-Db7eLmNLQkOFP7VLtuQ", "user_id": "gdDRpeLd63qomhNBarrY1g", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Service was good but $13 bucks is a lot for a 12 inch \"specialty\" pizza with one basil leaf", "date": "2019-03-29 17:44:07", "user": {"name": "Regina", "review_count": 2, "yelping_since": "2013-08-06 00:14:05", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "LLGE5djqcZaF1xUYJCbAbg", "user_id": "O61GkHdQaSm_CUXFsRsZGg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The service and food was fabulous! We started off with balsamic Brussel sprouts and the ricotta board, both were amazing. For dinner, I got the braised short rib with mashed potatoes & asparagus and my sister got the penne vodka. Both were delicious! I highly recommend this restaurant.", "date": "2019-03-24 00:18:44", "user": {"name": "Kaitlyn", "review_count": 27, "yelping_since": "2018-12-31 20:04:25", "elite": "", "average_stars": 4.17, "fans": 0}}
{"review_id": "8QZ4HxcyR6c1AcPv2nJWWQ", "user_id": "D_a8tbz_Tuh4x4lGW9nVZA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I got violently ill (will spare readers the details) after having the caprese salad and the lasagna.", "date": "2019-03-20 16:07:14", "user": {"name": "Raeefa", "review_count": 19, "yelping_since": "2009-03-07 17:26:45", "elite": "", "average_stars": 3.8, "fans": 0}}
{"review_id": "N0_1gO50Du7JrS8GjRUBfA", "user_id": "bhAB5wo9iLsaExSw4apR4g", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "I work extremely close to LaScala so I frequent this establishment quite often, typically, eating by the bar while watching Sportscenter.  The bartenders are always friendly and hospitable, probably the highlight of the place.  \n\nThey have a good lunch menu in which they USED to have an amazing petite filet with a side salad and potatoes for $21. I really wish they brought that back, I'd probably give them 5 stars if they brought that dish back.  Other than that, the food is legit, always large portions whether you're getting a sandwich or pasta dish.  It's just a solid, large portion type, generic, Italian restaurant.", "date": "2019-02-17 11:13:55", "user": {"name": "Tom", "review_count": 382, "yelping_since": "2016-02-10 01:52:43", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.2, "fans": 19}}
{"review_id": "GjVwoo3UtiPSYoxVzPFzUg", "user_id": "75AvfzGfe-8SK2qnuCRXaw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "My boyfriend and I decided to take a trip to Philadelphia. While walking along historic Philadelphia, we came across a moderately priced Italian restaurant, which is exactly what we were looking for. We went in to a half filled restaurant, to be told that there will be no tables for another 4 hours. We agreed to sit at the bar instead. This was a bad decision. Before I was able to finish ordering the calamari - Captain Gordon fishsticks came out with it. Before I was able to finish taking the first bite of the calamari - both of the main courses were already in front of us. Truth be told, the pappardelle? I wouldn't serve it to the inmates at Eastern State Penitentiary. An hour later, the bar was completely full and all the \"reserved\" tables were still empty. The experience was so poor, we decided to leave Philadelphia for the night altogether.", "date": "2019-02-10 01:08:00", "user": {"name": "Amy", "review_count": 60, "yelping_since": "2015-08-21 03:14:39", "elite": "2018", "average_stars": 3.62, "fans": 2}}
{"review_id": "bHfHd3dIvP6fT3258ZfSaA", "user_id": "dF-cIZlPoxyjoNxKCecYDQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place overall.. I started off with the escarole soup which was great. Great stock and plenty of ingredients in the bowl. Then me and my wife split the meatball trio, little dense for my liking but i liked the flavor, my wife did not. Then onto our entree's and she have the rigatoni vodka with chicken, she didn't eat much because she was full. But this is weird on her end. Most of the the entree was left on her plate. But when we got home with left overs there was hardly any in the small container. Little weird to say the least. I had the Seafood Fra Diavlo (which wasn't bad) i ate the seafood but took the pasta home, lots of seafood in the bowl. But i should have went with the veal parm as it came out next to me and looked fantastic. Only reason i gave 4 starts was because the service was slow but when he was around the service was great. Didn't get dessert since we are both on diets.. overall we will be back. not having to pay for parking was a huge plus. my only other complaint was how expensive a bottle of wine was to be honest its cheaper to get glasses. But the beer prices and serving size is fantastic.", "date": "2019-02-04 15:38:29", "user": {"name": "Paul", "review_count": 2, "yelping_since": "2016-10-09 17:50:53", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "-C4ziot6ucrO6myzHZSpwA", "user_id": "tsLCoSKFZO_vUf_-NMb6Rw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place, specifically the vodka sauce pasta. It is by far one of the best in Philadelphia.  The service is always great too and they fresh roll with the balsamic butter mixture they give you is delicious.  My husband got the chicken parm which was also good but he agreed that the vodka sauce was amazing. We opted for the chocolate cake dessert which was also delicious.  The only downfall is that they are a bit pricey compared to other restaurants but the portions are decent.", "date": "2019-01-17 14:33:50", "user": {"name": "Pinky", "review_count": 210, "yelping_since": "2011-09-25 19:40:49", "elite": "2019,20,20,2021", "average_stars": 4.01, "fans": 10}}
{"review_id": "p2oaToYcdMaPHudor4Kttw", "user_id": "YPvfXRsIYVgrenwau4-aFw", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "useful": 3, "funny": 1, "cool": 2, "text": "To start off, the price point on Yelp is definitely off for this restaurant. It's definitely a more upscale restaurant with entrees that will cost you anywhere from 22$-30$. However, it had one of the best calamari I've ever had. The calamari wasn't chewy at all and sunk into my mouth as soon as I bit into it. The accompanying sauce was amazing as well. The \"formality bread\" in the bread I would advice two baskets off because it's amazing!!! If you're a carb junkie like me, just ask for two in the beginning and extra balsamic on the side ( they have this olive oil and balsamic dip on the side and I could've drank it but yk.... i didn't). \n\nThe pasta is good as well but nothing special. The good thing is, the fusilli with seafood doesn't leave that gross fishy after taste we all oh so love. I would stick with a classic chicken Marsala or any pasta with a simple tomato cream sauce ( can't go wrong with that). \n\nIf you're not broke by the time you get to dessert, I'd get the creme brûlée hands down. Maybe an actual dessert connoisseur would say otherwise, but if you have a sweet tooth... just get it :)", "date": "2019-01-14 02:26:23", "user": {"name": "Nikitha", "review_count": 84, "yelping_since": "2016-02-02 00:23:09", "elite": "2018,2019", "average_stars": 4.17, "fans": 9}}
{"review_id": "cdcfFoJCgAOAYu6yyZzQkg", "user_id": "uasI0o_Pko7PXjmkJrFZXg", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "OPMy husband and I were in Center City  enjoying the ballet and afterward I  was craving papparedelle. I did a Google search and Lascala was recommended. I noticed as we were seated that the table didn't offer a salt or pepper shaker- which set my expeditions very high- for the chef to produce a tasteful and well balanced dish. Highly disappointed was an understatment. In hindsight I remember our server saying that LaScala was known for their pappardelle as being one of their best dishes. After taking 2 bites my immediate response was \"WHY tf?\" If the pasta was home made and fresh it was hard to tell since it was drenched in THE MOST TASTELESS, SALTLESS, under seasoned wine sauce EVER. Our server knew I was displeased yet didn't send over the manager...he just wanted to get by, I suppose. So in the end, I asked for a manger. Needless to say I was disappointed yet again. We live quite a distance from Center City, so each visit makes an impact. Maybe LaScala's chef was having a rough night, maybe our server was having a bad day, maybe the manager on duty didn't give two F's and over all it was our bad luck that we happened to try  LaScala on this particular evening...LaScala wont get a second chance with us. Try at your own risk.", "date": "2018-12-30 03:25:00", "user": {"name": "Carolinn", "review_count": 1, "yelping_since": "2018-08-05 16:04:45", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "Q9xfUE5-FIUtDS9LdxBVqg", "user_id": "WAu3dxtBFFn-6EWW__B5Ug", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went for Christmas Eve dinner and service was excellent and everything was delicious. There was barely any leftovers. My table ordered the meatball trio, caprese, and the Brussels sprouts. I loved the meatballs and their homemade sauce is amazing! The compliment bread and their balsamic, butter, oil mixture is quite tasty as well.\nFor the entrees, I ordered a simple linguine with sausage bolognese, my cousin got chicken parm, and my aunt and mom got the chicken Marcella. Their portions were huge mine was a little smaller but that was fine with me cuz i was full from the apps.\nDessert: My cousin and I split the chocolate fudge cake. It was so Good!\nBeverages: Red wine Sangria was tasty. My aunt and mom had an after dinner espresso martini and said it was the best one they ever had.\nWill definitely be back", "date": "2018-12-25 14:53:54", "user": {"name": "Erin", "review_count": 20, "yelping_since": "2018-04-21 13:49:48", "elite": "", "average_stars": 4.6, "fans": 1}}
{"review_id": "ZDX_jACBf9b8Lnoc-kuQBQ", "user_id": "6jqe0ElKpdYGSDkc45JkVA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Seemed to have the worst service in the restaurant. Waiter was very nice but never refilled waters, checked on drinks and it took forever to get our food and check. Food is subpar for Philadelphia. Felt like we were in a tourist trap.", "date": "2018-12-25 12:59:18", "user": {"name": "Erica", "review_count": 11, "yelping_since": "2012-01-25 16:20:18", "elite": "", "average_stars": 3.45, "fans": 0}}
{"review_id": "4D0yiVu_Nj2CeypBnJEdww", "user_id": "TTSJb0I91fMHwOvU_EU7yQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Perfect experience with 7 friends last night! Extensive wine list, everyone delighted in their dinner selections & server Sergio brought it to 5 stars. I'll be back next time in Philly!", "date": "2018-11-09 17:13:20", "user": {"name": "Susan", "review_count": 46, "yelping_since": "2016-10-15 17:42:11", "elite": "", "average_stars": 4.46, "fans": 0}}
{"review_id": "90wW0kkCjGz9236BUTzFig", "user_id": "JntT66aa-92AmnUtWk5YqQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "LaScala gives great portion size for average meals, but the service was terrible. Our server was in the weeds so bad and unreachable during the entire dinner. From apps to entrees the server just put the plates down on one side of the table and expected us to pass the plates across the table. Sadly, not sure if I will be returning for dinner.", "date": "2018-11-06 02:04:32", "user": {"name": "Ann", "review_count": 52, "yelping_since": "2014-10-20 12:20:39", "elite": "", "average_stars": 3.8, "fans": 0}}
{"review_id": "kTywtXZf5gvRzYI5y0Q3Ig", "user_id": "rDsq5W75o4PLfeANx4-iDA", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 3.0, "useful": 2, "funny": 0, "cool": 1, "text": "Came here on a weekday afternoon for lunch and was unimpressed.  First, the restaurant was supposedly open based on the hours posted on the door, but when I walked and tried to open, the door was locked.  The irate attendant came and slowly opened the door.  It seems like they are upset about having a customer at 11:30 am.  Their hours stated they are open starting 11 am.  So I was confused.  I was seated to a table and after ordering my drinks and my entree.  I got the bread, which is probably the best part of my meal.  I ordered the veal with linguine which was very average tasting.  I ate some and packed 80% of it.  On my way out,  I saw a homeless man and gave my leftover meal to him.   I don't think I will ever come back to this place.", "date": "2018-11-05 17:53:27", "user": {"name": "Kirstie", "review_count": 140, "yelping_since": "2012-03-29 19:29:38", "elite": "2019,20,20,2021", "average_stars": 3.71, "fans": 5}}
