{"business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "name": "Nomad Roman Pizza", "address": "1305 Locust St", "city": "Philadelphia", "state": "PA", "postal_code": "19107", "latitude": 39.9480175237, "longitude": -75.1626882641, "stars": 4.0, "review_count": 286, "is_open": 0, "attributes": {"Alcohol": "u'full_bar'", "RestaurantsReservations": "True", "WiFi": "u'no'", "RestaurantsTakeOut": "True", "OutdoorSeating": "False", "BusinessAcceptsCreditCards": "True", "Caters": "False", "RestaurantsGoodForGroups": "True", "NoiseLevel": "u'average'", "HappyHour": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "BikeParking": "True", "RestaurantsPriceRange2": "2", "RestaurantsAttire": "u'casual'", "GoodForKids": "True", "RestaurantsTableService": "True", "HasTV": "True", "Ambience": "{'touristy': False, 'hipster': None, 'romantic': None, 'divey': False, 'intimate': None, 'trendy': None, 'upscale': False, 'classy': False, 'casual': True}", "CoatCheck": "False", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': True, 'brunch': False, 'breakfast': False}", "GoodForDancing": "False", "Music": "{'dj': False, 'background_music': False, 'no_music': False, 'jukebox': False, 'live': False, 'video': False, 'karaoke': None}", "BestNights": "{'monday': False, 'tuesday': False, 'friday': True, 'wednesday': True, 'thursday': False, 'sunday': False, 'saturday': True}", "RestaurantsDelivery": "True"}, "categories": "Restaurants, Bars, Wine Bars, Italian, Pizza, Nightlife", "hours": {"Monday": "16:30-22:0", "Tuesday": "16:30-22:0", "Wednesday": "16:30-22:0", "Thursday": "16:30-22:0", "Friday": "11:30-23:0", "Saturday": "11:30-23:0", "Sunday": "11:30-21:0"}, "category_list": ["Restaurants", "Bars", "Wine Bars", "Italian", "Pizza", "Nightlife"], "stratification_tag": "Italian"}
{"review_id": "0H_ZolGXsPWzKBR22E4sZQ", "user_id": "W3ysWL_V19TTmAvxMRKnxA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Been here a few times but it was my first time on a Tuesday which was great with the BOGO deal for pizzas. Favorite one is the truffle pizza. The spicy sausage is good meat option too. Fungi is on the special menu which is okay but I would just order an extra truffle. \n\nGood service.", "date": "2020-03-12 18:32:15", "user": {"name": "Annie", "review_count": 161, "yelping_since": "2011-08-21 02:43:37", "elite": "2019,20,20,2021", "average_stars": 3.94, "fans": 4}}
{"review_id": "xtfZSXKj5C5-eoGPLox1Xg", "user_id": "AIThV7psRb6R8WD4LiYPdA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Swung by here on a Saturday night and got a table for two with no wait. \n\nWe were originally going to get an app and pizza but no apps called our names so got two pizzas. Managed to eat a pizza each. To be fair though, very very thin crust. The crust was nice and chewy though with crispy edges. Came out in less than 10 minutes. \n\nThe quattro formaggi was great, with just the right amount of onion that gave a hint of sweetness. We also got the arugula which was great... nice freshness to the greens. \n\nThe place was pretty packed by the later evening and tables so close that every time a waitress or waiter came through, had to hold onto our water glasses, so definitely not a fancy place. Cute though. Variety of pizzas, including a couple vegan options.", "date": "2020-03-08 20:05:00", "user": {"name": "Niki", "review_count": 156, "yelping_since": "2017-09-24 22:12:57", "elite": "", "average_stars": 3.63, "fans": 1}}
{"review_id": "wZnoLRT_1-v1bNvuA07CQg", "user_id": "ARULoqP8p7GconvPGGO_zg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been coming to Nomads for a few years now and their pizza is consistently amazing  My favorite is the Trenton Tomato which consists of a white sauce, fresh basil, mozzarella and tomatoes, it's delic guys and gals, you won't be disappointed! \nHowever, their drink selection leaves a lot to be desired with limited craft beers, wines and cocktails to choice from. Overall it's a good experience because the pizza more than makes up for the alcohol selection. I'm mad about Nomads!", "date": "2020-03-07 02:50:11", "user": {"name": "Chris", "review_count": 9, "yelping_since": "2020-03-07 02:38:53", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "ZkxINGcnLyCL6PjAcTRLgA", "user_id": "eNTeZDl1uyuiByMSVRcdpQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "I went here with a group of about 15 coworkers on a weeknight.  My boss made a reservation and they were ready when we got there.  We did show up a couple of minutes late.  Nomad Roma was easy to find for a bunch of out of towners.  Our dinner was reserved for 5:30 PM, so we arrived during happy hour.  The happy hour menu was great for individuals and our group.  It looked like most people ordered a personal pizza, or there were a few people who split a specialty pie.  I ordered a marghertia personal pie and did not remain full for most of the evening.  The pizza had extremely thin crust, it was basically non-existent. I guess they are known for having thin crust, but thin was seriously an understatement.  The service was great and they allowed us to linger for a while when we finished eating.  I really was not a fan of the pizza otherwise I would have rated 4 stars instead of 3.", "date": "2020-02-03 01:33:01", "user": {"name": "Cara", "review_count": 137, "yelping_since": "2016-04-30 20:02:54", "elite": "20,20,2021", "average_stars": 4.02, "fans": 7}}
{"review_id": "sLOTqZ1RlZ9x1maKigkjgw", "user_id": "gWZETLPu_ihAtLOYtrm0mw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "Had a reservation for a Sunday night at 5pm. We showed up 10 minutes early and we were immediately seated. The service was so quick - we had food on the table by 5:08. I checked the time because of how quickly it came! \n\nWe ordered the arancini, a salad and a pizza. The salad was delicious. We loved the arancini. The pizza was plenty for two people to share.\n\nI heard that Nomad does buy one get one pizzas on Tuesdays, so I got a group of four together and made a reservation for Tuesday night. We ordered four pizzas (for the price of two) and had leftovers! We tried the Margherita Di Bufala, Arugula Con Prosciutto, Spicy Sopressata, and Quattro Formaggi. All were delicious, but my favorites had to be the Quattro Formaggi and the Spicy Sopressata. I typically do not like spicy foods, however the honey paired with the spice was delicious.\n\nThis is a great spot and if you want to try it, I'd recommend going on a Tuesday and making a reservation. The restaurant filled up quickly! There is also bar seating available, so you could always give that a try!", "date": "2020-01-15 15:42:37", "user": {"name": "Gabriella", "review_count": 231, "yelping_since": "2016-01-26 23:54:38", "elite": "20,20,2021", "average_stars": 4.33, "fans": 167}}
{"review_id": "lH72PqbNarvIzBvZRrBrmg", "user_id": "VxisHVgAg7D8kgCUws8-OQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you are a fan of deliciously thin and crispy pizza crusts (as I am), this is the place for you. The sauce and toppings were super fresh and flavorful. The service was great; attentive, but not intrusive. As a bonus, the location is just a short walk from venues in the Avenue of the Arts area. Great for a pre-show or post-show meal.", "date": "2020-01-06 21:00:55", "user": {"name": "Martha", "review_count": 12, "yelping_since": "2015-10-18 05:14:43", "elite": "", "average_stars": 3.75, "fans": 0}}
{"review_id": "eMvrVO5PKZMC0SepJi3maw", "user_id": "vE9LIIqyxuipateEX80tRQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here on a Saturday night with a bunch of friends. Surpringsly was not too crowded, and we didn't have to wait too long for a table of four. We decided to do family style and just share a bunch of starters/entrees. We ordered three items - Cacio de Pepe (which was on their specials), Margherita pizza and Spicy Sausage pizza. All three were really good and the perfect amount of food for four people. The spicy sausage pizza had a good kick to it as well. \n\nThe ambiance of this place is really nice and our waiter was nice as well. We were able to try a couple wines before ordering the ones we wanted. If you're planning to drive in, plan some time for parking because it may be a little difficult to find parking, especially on the weekend. Overall, great restaurant with great food. Would recommend if you're looking for good pizza/pasta!", "date": "2019-12-18 14:37:36", "user": {"name": "Amit", "review_count": 231, "yelping_since": "2014-08-17 00:43:22", "elite": "20,20,2021", "average_stars": 4.05, "fans": 8}}
{"review_id": "Ph-XguTarnoqyqu1Y8gS3g", "user_id": "GA3UUzI76bZGLKvvm1iF6g", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I recently went to Nomad Pizza for dinner and had a great experience. Pizza was great, service was great, and the restaurant had a nice vibe. All the ingredients for a memorable experience. I will definitely be back when I have a hankering for pizza in Philadelphia.", "date": "2019-12-12 20:26:52", "user": {"name": "Richard", "review_count": 16, "yelping_since": "2016-01-10 15:41:06", "elite": "", "average_stars": 3.56, "fans": 0}}
{"review_id": "GyhdWwfUzWwpEbp8AotlAA", "user_id": "KTxe33TKY86VJRm41iBm1A", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Quick review:\nYesss this place is a delish casual place to grab dinner with friends!\n\n10/10 for the crispy thin crust pizza my friend and I devoured! We decided to try the arugula prosciutto pizza. ***Note, this place does medium size pizzas and considering they're thin crust, I think it'd be pretty easy to eat one by yourself heheh. However, my friend and I were in the mood to share a pizza and try an app! We didn't exactly want the same things and tried to do half and half which apparently is not something they attempt here! However if you want to remove a topping off one side or add another they seem flexible to it. I will definitely be back for this yummy pizza..\n\nNow to the part I didn't love...\n\n5/10 for the bistro salad! This app seemed action packed with fruit/avocado on butter lettuce with a ball of fried goat cheese.. all the elements were there but somehow it just was a little sad. Literally 4 pieces of butter lettuce spread across the plate with some toppings but somehow it comes to $10... skeptical. I'll be sticking to pizza in the future", "date": "2019-11-09 19:44:58", "user": {"name": "Emma", "review_count": 64, "yelping_since": "2015-07-10 19:00:47", "elite": "2018,2019,20,20", "average_stars": 4.06, "fans": 7}}
{"review_id": "7IcirBVo_L12AWtf1AjD8w", "user_id": "_rX2xDlQtbDipXJpg53-bA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "My husband and I were staying near center city and decided to try Nomad's on a Saturday night. We didn't have a reservation, but thought we would just walk there and see if we could eat. The hostess gave us in our opinion the best seat in the house, a little table right next to the open window wall. She told us we needed to be done in 45 minutes because that's when the next reservation for that table began. We tend to eat fast, so that was no problem for us! This place is very small and cozy, with dim lighting. It's a nice date spot! Our waitress was great to begin with, but forgot about us after our food was brought out. We decided to order 2 pizzas and share them. My husband ordered the spicy sausage and had the caramelized onions omitted on his half. I ordered the spicy soppressata and he asked for the honey to be omitted on his half. I appreciate them allowing you to make small alterations, and not pulling the \"chef created this to perfection\" card. Each pizza was $17, which seems about right for the quality and charm of the place! Our pizza was brought out in under 10 minutes! A food runner brought the pizza, not our waitress and we were out of water and it was clear after 6-7 minutes she wasn't coming back anytime soon, so we had to ask another waitress for a water refill. She must have told our waitress because she cane back with water and apologized. After she apologized, we were fine, didn't hold a grudge. Our pizza was so delicious! The pepperoni was so crispy and paired perfectly with the honey! My husband's sausage pizza was also very good! I felt like it was missing acidic and textural elements though. It needed a little lemon or vinegar and something on top for a little crunch. But overall, very excellent! We finished in about 35 minutes and we're just waiting for our waitress to come back so we could ask for a box and the check. She finally came back after another 7 minutes. We were getting nervous because we didn't want to screw over the hostess who let us take the table. When she brought the bill we had our card out and ready for her to take. By the time she brought it back, we had gone over the 45 minutes. There aren't very many tables, this place is very small and they seemed to have a handful of waitress/waiters in addition to food runners, so we're not sure what caused our waitress to be aloof after we ordered. Anyway, food is very excellent! The place is super cute! I highly recommend this place!", "date": "2019-11-06 16:51:29", "user": {"name": "Morgan", "review_count": 183, "yelping_since": "2016-09-03 00:16:28", "elite": "2018,2019,20,20,2021", "average_stars": 3.52, "fans": 7}}
{"review_id": "RMmTmU-N5D1r6KuqIjBiTg", "user_id": "hcw7ndQKWGEH4P7BYAlG9w", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "The service was okay. The first server was awkward, broke a glass as we walked in. The other server who sat us was a bit standoff-ish. We ordered from the late night menu 10-11pm. Happy hour drinks consisted of red or white wine, selected beer or cocktails. We ordered the two wines however were not informed or asked what the wines were? But I guess that was ok since it was late. The table was wobbly thus the water vase on the table was close to tilting over during the duration of our meal. The pizza was good: taste-wise and cooked well. Not worth the $16, thank goodness we paid happy hour pricing. Giving a 4 because the pizza was good but overly priced / cold service", "date": "2019-10-19 03:32:08", "user": {"name": "Mary", "review_count": 100, "yelping_since": "2019-06-26 14:08:01", "elite": "2019,20,20,2021", "average_stars": 4.08, "fans": 11}}
{"review_id": "KHzARBsIYFNruhgp3p9oYg", "user_id": "wo5QavnrMex2rXuZBRyrJQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ok. Check this out. They have a for real wood fired brick oven. The pizza comes out quickly. And perfect!  We had the spices sausage pizza. The layers of flavors are amazing. The crust?  Faggotitaboutit!  I loved it. \nWait staff was good and knowledgeable but not smothering. I want to eat lunch here tomorrow!  \nThe red wine was good on the happy hour. \nSo go if you want. But if you eat a bad meal somewhere else that is on you!", "date": "2019-10-07 22:38:40", "user": {"name": "Jason", "review_count": 136, "yelping_since": "2010-12-13 16:54:14", "elite": "2015,2016,2019,20,20,2021", "average_stars": 4.33, "fans": 6}}
{"review_id": "H-7bEvxIo1aqAMEoF6g-8g", "user_id": "GtmvDH3LqZf3-NlHUYXgrQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Nomad Roman is a true GEM. I kick myself every time I get pizza in Philly and it's not from here! I've probably been here ~10 times over the past 3 years and I continue to love it each time I visit.\n\nTheir best deals are their HH (regular hours AND late night on the weekends) as well as their 2-for-1 pizzas on Tuesdays (they include automatic tip on the non-discounted amount, fyi). They have standard options (e.g., Margarita) that are enhanced by their scrumptious thin crusts. I am a personal fan of their honey sopressata (hot and spicy with honey-y goodness). I could probably eat one of their personal HH-size pizzas by themselves given how thin the crusts are, but at $6/each, it's a steal anyways.\n\nI've been here with small and large groups and the service is usually great! They take reservations, so a good option if you're looking for a team meal. \n\nCome here if you're craving thin-crust pizza, you're looking for a bomb HH deal, or you're in the neighborhood. You probably won't regret it!", "date": "2019-10-02 18:37:38", "user": {"name": "Radhika", "review_count": 125, "yelping_since": "2015-05-23 01:12:26", "elite": "2019,20,20,2021", "average_stars": 3.91, "fans": 10}}
{"review_id": "qg9I4hpTLqRf336Y6X_7EA", "user_id": "jRVs6KNh30LgOcAcWttJMg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 3.0, "useful": 2, "funny": 1, "cool": 1, "text": "Great happy hour prices and the service was good until we wanted to pay. $6 personal pies for HH and they were just meh. The margherita came out less than 5 minutes since we ordered and was obviously not made to order, at least not for our table. Luke warm and lacking flavor. \nThe marinara pie was a little better. \n\nVery thin pies with not a lot a flavor. We won't be returning.", "date": "2019-09-21 21:51:47", "user": {"name": "Michael", "review_count": 218, "yelping_since": "2016-12-17 01:51:37", "elite": "2018,2019,20,20,2021", "average_stars": 3.73, "fans": 8}}
{"review_id": "c4dIk3xhFgHYnQVJ561dzQ", "user_id": "clk-jsr6x8RfkJOUVT7L6Q", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went out to brunch and the wait was too long elsewhere, so me and my boyfriend decided to check out this cute pizza boutique! I usually get too excited about eating to catch pictures but this time I was able to capture it all.   The decor is handpainted by a local artist. The music and vibe is dope! We started with two apps, the fried seasonal veggies and the grilled Caesar! 10 toes up! It was boyfriend's first warm salad and he LOVED IT! He almost didn't let me try it! And the veggies,OH MY! WE HATE sweet potatoes but it's something about how they fried them and the aioli on the side just sealed the deal! We had like 4 cocktails. Two Tito's mules to start and then we jumped into the paper plane and the Margarita!!! Our server/bartender ZACH WAS spot on! Those drinks definitely made for an interesting afternoon on the town lol. I don't eat pork so I ordered their truffle pizza..my only complaint is that i would have liked for something tart or acidic to cut the richness of the all the cheeses on it. My boyfriend ordered the soppressata pizza and only left ONE slice. Everything was timely, hot and delicious!!!! We WILL be back!!! Might be a new little hangout", "date": "2019-08-16 17:21:19", "user": {"name": "Namia", "review_count": 4, "yelping_since": "2018-03-13 01:12:21", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "s4gEu82bfMSQI3vKAhx0Bg", "user_id": "aYY-i5pXJpdDG2rhF0YsRg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "It seems like every restaurant in this neighborhood of Philly serves fancy pizza but we were very happy we ended up here. The restaurant is nice and not pretentious. Service was good and pizza was great. Prices were reasonable.", "date": "2019-08-12 20:48:48", "user": {"name": "Gerry", "review_count": 64, "yelping_since": "2013-03-23 23:20:21", "elite": "2021", "average_stars": 4.15, "fans": 0}}
{"review_id": "soCtbP2oo6dsKT3GnNDOmA", "user_id": "aRZkstJ6Z8j5NeV-K37WRQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I LOVE this place! Eat here whenever I can. The staff is lovely, the food and drinks are great and the vibe is relaxing and the prices are good. I enjoyed every dish I have eaten here. Go alone or go with friends, you'll have a good time and you'll eat well.", "date": "2019-08-11 03:19:32", "user": {"name": "Bella", "review_count": 36, "yelping_since": "2017-06-20 19:40:19", "elite": "", "average_stars": 4.26, "fans": 0}}
{"review_id": "FeYMTB8YNOQ8sfOSLCnn3w", "user_id": "UE6NMBPbglkD1ghUap6WoQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nomad pizza was a really nice little spot in south Philadelphia. Everyone working was nice, there was no wait and it wasn't too crowded. We ordered two pizzas and they were both delicious. We had the Truffle Pecorino and the Arugula pizzas. When we ordered drinks there was some confusion with what they still had on tap so two of the beers we ordered were not available. They were super nice about it and covered the cost of my beer. The vermouth drink my sister had was great, the mojito was not amazing, it tasted pre-made and with not much mint added. Other than that we had a great experience !", "date": "2019-07-27 13:53:30", "user": {"name": "Phoebe", "review_count": 29, "yelping_since": "2019-07-08 13:26:26", "elite": "", "average_stars": 4.2, "fans": 1}}
{"review_id": "aodzJBhLdaV3zc-Jk9ApZA", "user_id": "h-arsm1cVeN84GJReMeGIA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "The tuesday special buy one get one free pizza is amazing!! The only negative is the pizzas are very thin crust (not very filling) so it's a bit pricey if you aren't going on Tuesday.\n\nAlso the blue cheese salad we got was awesome", "date": "2019-07-26 04:39:20", "user": {"name": "Lexa", "review_count": 137, "yelping_since": "2015-01-04 18:32:49", "elite": "2019,20,20,2021", "average_stars": 4.12, "fans": 9}}
{"review_id": "5JgD4FAevXHROay8oopYMA", "user_id": "aSabe2Eas9ahj6o3svVRPQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was decent but waiter was extremely rude. As a former waitress I was shocked at how he spoke to people at my table. The owners should be much more careful in who they hire.", "date": "2019-07-22 12:02:13", "user": {"name": "Tricia", "review_count": 27, "yelping_since": "2011-03-26 16:49:16", "elite": "", "average_stars": 3.52, "fans": 0}}
{"review_id": "Q1QCRQtVn3DDVFnZ2FvSEQ", "user_id": "riqVnqzfWKfE37DV0LJ-gA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 2.0, "useful": 3, "funny": 0, "cool": 1, "text": "About 2 years ago, this restaurant was highly recommended and so I finally got a chance to dine here and I was not impressed. I absolutely love pizza and I love crust and the depth varies, but when you get pizza where the crust is non existent and so thin and crunchy it resembles a cracker, that's when I have problem. \nPerusing the menu, options like eggplant parmesan and truffle pecorino stand out and sound amazing until you get them and the toppings are so thick they just about fall through the crust, making for a sloppy mess. I love arancini balls, but the prosciutto should be inside the ball, not lying on top and I am also a huge fan of veggies, specifically cauliflower and mushrooms...they were lukewarm and I really do not have any words for this dish.\nNow, if you are on a budget, they offer a handful of pizzas during their happy hour for $6 each and for the price, it is worth it.", "date": "2019-06-17 23:28:47", "user": {"name": "Quin", "review_count": 959, "yelping_since": "2011-01-28 20:11:42", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.05, "fans": 51}}
{"review_id": "LWZdDOJ2_xgayaE7wuZPrw", "user_id": "rhtjFoaOfCWb8P7iP02akA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This pizza was amazing If your looking for great thin crust pizza then this is absolutely the place to go", "date": "2019-06-10 06:24:39", "user": {"name": "David", "review_count": 1, "yelping_since": "2016-07-14 12:15:30", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Hsz-YPatxvuYyGF6dtd0xQ", "user_id": "OI-w95AvXwBlwyh_JPwmnw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went for the first time this weekend and it was delicious! A friend and I split a hurrays salad and the spicy sopressata pizza. Plenty of meat on there as well a nice crunchy, thin crust. The service was great. The waiter was attentive and our food came out pretty quickly.", "date": "2019-05-29 01:11:49", "user": {"name": "Stephanie", "review_count": 167, "yelping_since": "2017-06-03 20:30:23", "elite": "2019,20,20,2021", "average_stars": 4.69, "fans": 3}}
{"review_id": "HT0rDsvAUjF1-DetE4w8pQ", "user_id": "itWMVHIgbAyvzA-hZUcGIA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Thin crust pizza was very good.  Sauce was excellent and the buffalo cheese was excellent as well.   The meatball appetizer was delicious.  They gave three small meatballs in sauce.  Would come back again.", "date": "2019-05-24 23:24:50", "user": {"name": "John", "review_count": 3, "yelping_since": "2018-09-04 23:54:53", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "VIG9oPdJIb3W_jbdfco2Cw", "user_id": "RnsGfdux_mwwOEIx-piakA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nomad is great for happy hour, especially with large groups. Came here the other day with a group of ~8 people, and they were able to take a reservation for us with no problem.\n They had a few pizzas on happy hour special special, all with thin and crispy crusts. I had the margarita, which was standard but flavorful. I also tried some of the tomato pie, which had a delicious tomato sauce. They had a variety of sausage-topped pizzas that seemed to be well-received by my friends. \nDocked one star because the prices have increased quite a bit for their happy hour specials (no longer $5 pizzas). But for the taste and convenience, Nomad is a great choice!", "date": "2019-05-12 22:18:59", "user": {"name": "Sanika", "review_count": 71, "yelping_since": "2016-03-16 05:12:40", "elite": "2019,20,20,2021", "average_stars": 4.31, "fans": 4}}
{"review_id": "G081Wa6MmH5RucrdZqrOHg", "user_id": "kh8FA-_QSuTL1U0fygs6Cg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Managed to grab a table with a group of friends right after Nomad had opened again after being closed for a private event. The staff was super friendly and nice (they were in the process of cleaning up after the event) and were patient with us even though we changed our idea of where to sit like 3 times (we had the whole place to ourselves and was overwhelmed with where to sit lol!) so extra points for being patient with us lol. A staff member put us in a really great spot near the opened windows so we got a view of the street. It was a beautiful Friday night so people watching was prime.  \n\nOur server was funny, nice, engaging -  over all great energy. We ordered two pizzas (a Margherita pizza and a special pizza), two orders of meatballs and a Caesar salad for the table.The one pizza was from the specials list, it had Chorizo on it, and it was delicious! Me and my friend joked that when we come back, we'll have to order the special Chorizo pizza to ourselves because it was *that* good. I ordered a cocktail which was really good as well! \n\nWe must have gotten in at a good time because it wasn't long before the place started filling up! Based off that, I'm assuming a reservation is needed for this restaurant, which isn't a big deal. \n\nI will definitely be back - looking forward to it!", "date": "2019-05-06 20:02:28", "user": {"name": "Cayleesi", "review_count": 15, "yelping_since": "2015-11-14 23:00:40", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "Ftlym0O5PLJVTgM9eOpn6Q", "user_id": "G_WepRqjbm-LPwbHSXZR9g", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "We were looking for vegan pizza while in the area and this place came up. I'm not vegan but experimenting with it. So their castelvetrano seemed to be the one but it's only vegan without the cheese, no! I want vegan cheese. Ok so anyway we got the moz on it and it turned out to be one of the best I have ever eaten! Took me back to childhood days in Antwerp. Truly amazing! I only wanted a slice but ended up having 5. Wife and I shared one pie around 4pm...\n\nSo next time I'm trying the regular margherita as I always do. I truly love the flavor and how thin it was made.", "date": "2019-04-07 22:11:16", "user": {"name": "Sabin", "review_count": 356, "yelping_since": "2010-10-03 19:47:53", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.24, "fans": 28}}
{"review_id": "NJ3UEMpBZ6IXzeM4W-g5wg", "user_id": "9npwOaWdk75Kpowm9vM3cw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great pizza and apps. Place is chill and food is amazing. Order extra pizza and bring home for friends or even the the doorman at the next bar", "date": "2019-03-31 14:16:27", "user": {"name": "Joel", "review_count": 12, "yelping_since": "2007-08-15 19:24:38", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "J34vkdRTSAK2KjJn4tnHNg", "user_id": "VXfinAmKYD73O2AnaF6ATQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely Delicious Pizza! We showed up to our reservation 45 mins early but they were still able to sit us shortly after our arrival. We got the Quattro Formagi pizza and it was super garlicky (in the best way possible!).  The other pizza was one of their specials! Both were pizzas were amazing and I cant wait to go back.", "date": "2019-03-11 17:23:07", "user": {"name": "Shannon", "review_count": 11, "yelping_since": "2014-09-10 00:43:25", "elite": "", "average_stars": 4.91, "fans": 0}}
{"review_id": "V3v9xNIuUONIME7x9miqiQ", "user_id": "LAaYMVy5XSfopa5kD2YJLg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The thin crust pizzas here are so delicious and light. They also have some really great happy hour specials with $4 wine/beer and $6-$8 personal pizzas. In addition, there is a special on Tuesday's where you can get two pizzas for the price of one. This is a great spot to go with a group, order a couple of pizzas, and share everything. There's nothing on the menu I wouldn't recommend!", "date": "2019-03-07 05:14:43", "user": {"name": "Ally", "review_count": 109, "yelping_since": "2018-02-13 12:10:06", "elite": "2018,2019", "average_stars": 4.41, "fans": 7}}
{"review_id": "MKsfmye8qfz2ix-Erj1Y1g", "user_id": "zg6lm7DLKJArzFxLDILhwQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 3, "funny": 0, "cool": 3, "text": "Just realized I hadn't written a review despite being a regular here for more than a year.\n\nI would 100% suggest their happy hour - several pizza options and drinks for a great price. The pizzas are slightly smaller than the regular entrée sizes but at $6-$8 there is no complaint. They also have a late night happy hour on Fridays and Saturdays which is another great way to partake. I've been there during regular hours and because there are so many options to get HH pricing, I find it difficult to justify paying regular price.\n\nPlease note that the times online and the times the restaurant follows are not the same, I tried to go there once based on the online times and sadly they were closed. \n\nMy #1 pizza is the spicy soppresata (honey and spicy flavors), all around favorite. They have good cocktails and beer selections as well.", "date": "2019-03-01 14:04:42", "user": {"name": "Ragini", "review_count": 161, "yelping_since": "2013-01-06 17:16:58", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.76, "fans": 24}}
{"review_id": "Oppl1pMX5wmIVHEyGF9KHw", "user_id": "iQY0-9zOIZD-u725NgToNw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came with a few friends on a Friday night. We got 2 pizzas and a salad and had some to take home. We got the eggplant pizza special and the quattro formaggi both were delicious! They also have very reasonable wine selection. Will definitely be returning!", "date": "2018-12-03 16:59:47", "user": {"name": "Samantha", "review_count": 42, "yelping_since": "2018-03-25 11:19:26", "elite": "", "average_stars": 3.62, "fans": 0}}
{"review_id": "IgOOn0XycdCogIBZ6bWWNQ", "user_id": "GX4lio7E96sCpRsyUfzGdQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time ordering to-go from this location and let me just say, we were very pleased!! We ordered two pizzas - margarita and pepperoni and they were ready in about 30 minutes from the time I called ahead and ordered. \n\nWe ordered at peak dinner time on a Saturday night, so the place was packed out. Nonetheless, the hostess was very attentive to us. We had to wait a few more minutes for the pizzas to come out, but the only downside is that the pizzas were not as hot as we would have liked them to be once we sat down to eat. They were cooked fresh though and tasted great! \n\nThe pepperoni pizza in particular was especially good. They used some sort of chorizo which made the pizza really flavorful - in a way I had never tasted before. We'll definitely be back soon and hopefully to sit-in next time!", "date": "2018-11-16 23:00:32", "user": {"name": "Olivia", "review_count": 186, "yelping_since": "2013-01-12 21:15:02", "elite": "2018,2019,20,20,2021", "average_stars": 4.52, "fans": 10}}
{"review_id": "VSFl2DJBy8JoFeaMXq1QPQ", "user_id": "cJRdN20Qq3jlHXyTl3P03A", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great little place to grab a fast bite highly recommended if you are in Center city...", "date": "2018-10-25 22:50:57", "user": {"name": "Charles", "review_count": 36, "yelping_since": "2015-03-21 23:12:40", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "W58fuRX8lqEHEpRkdvJPvQ", "user_id": "Ttn1RtATzZBtWsx6MoPGqQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 2, "text": "What a great find! About a dozen beers on tap, a really nice variety. I usually have a hard time choosing, so many are appealing. Then the pizza - I'm a serious pizza guy, I'll drive hundreds of miles out of my way to go to New Haven, and the pizzas here are truly excellent. They really get the concept and don't try to over do it. Espresso machine to boot. New Haven, get jealous. My only warning to people who are not attentive to the menu is that the marinara pizza is indeed spicy (some people will probably find it too hot, and probably none of those people will wander in here). At the same time, my marinara pizza had fabulous basil flavor from the fresh basil leaves. Sometimes, it's worth just going with the Trenton Pie on the happy hour menu. Simple, and totally delicious. After many visits, I've developed some favorites on the menu. Specials are often worth checking out, including the Bistro Salad, which I order regularly. Always good. Recently, we tried the Cacio e pepe, which was good, although the cheese sauce on it was a bit in the direction of a more traditional mac 'n' cheese - just mentioning that in case you're looking for a more authentic Italian version. Still, quite satisfying.\n\nAnd I haven't even mentioned the friendly staff. Apparently only really nice people are allowed to work here. After many visits, I'm still a fan.  Another recommendation is the Arugula Pizza, as something a little more unusual. And look for their Tiramisu. I'm not sure it's on the menu, but it is simply the best I've ever had.", "date": "2018-10-11 17:09:33", "user": {"name": "David", "review_count": 359, "yelping_since": "2011-11-11 00:16:00", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.49, "fans": 20}}
{"review_id": "p8Aaxs00ztbr53wUuKFFDA", "user_id": "uXznbrfW2o2WumkfHkuCkg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wow. If you aren't impressed with the cool decor and fast service, then the pizza will blow u away.\nSo its Roman style, which means thin crust extreme.\n\nWe did 2 pizzas for 2 people, and it was a lot.  Each is a culinary explosion of flavors and textures. \n\nThe truffle pizza, wow, and it has, wait for it...eggs on it\n\nGreat draft selection, and not too shabby on the wine selection either.", "date": "2018-09-30 17:39:12", "user": {"name": "Christopher", "review_count": 70, "yelping_since": "2014-10-21 23:51:13", "elite": "", "average_stars": 3.65, "fans": 2}}
{"review_id": "n5VudA7IWEOrm1YmXWVkWg", "user_id": "rMgHovIE-cu9qOdhMuF6HQ", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "We found ourselves roaming the streets, starving and completely reservation-less on a saturday evening. Tried a couple of nearby spots , but Nomad didn't look too crowded so figured it was worth a try.\nThe hostess told us that they were about to have a bunch of people that actually made reservations arrive, but that she could squeeze us in toward the back of the restaurant near the kitchen. It sounded like being banished to the dungeon, but it was actually cool to be right next to the pizza making area, and see the pizza oven itself.\nWe were so lucky to have stumbled upon this place (thanks to yelp). It was an agonizing choice to settle on food, but we went with the seasonal veggies and arancini as apps and shared a spicy sausage pizza.\nThe veggies were kind of fried tempura style, but browner and crunchier...they tasted great as did the arancini which were nicely covered in think prosciutto and served with a garden fresh tomato dipping sauce.\nThe pizza was a hit..the sausage was spicy but not overwhelmingly and the crust had a crisp edge and simple but pleasant flavor profile. The 2 of us were barely able to finish it.\nThe only fail, was the moscow mule I ordered...so gross. I dont' think they put any ginger beer in it? I was close to sending it back it was that bad.\nThe drink aside, I would absolutely come back here again, but make a reservation.", "date": "2018-09-17 12:45:27", "user": {"name": "Troy", "review_count": 379, "yelping_since": "2009-02-02 18:32:08", "elite": "2015,2016,2017,2018,2019", "average_stars": 3.68, "fans": 33}}
{"review_id": "Dwd_aB521ztOH6ddnjLemA", "user_id": "3oIt2taGHPYczKYm4lISTA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "A surprisingly good pizza place tucked away in center city. All the pizzas here are roman-style (basically really thin and crunchy crust). One pie per person is usually sufficient. \n\nI tried both the spicy soppressata and spicy sausage. Neither was actually spicy, but both were delicious! The spicy sausage pizza approximates a classic fennel sausage pizza in appearance and taste, but the spicy soppressata had a nice twist by throwing on some honey, which gave some sweetness to balance the saltiness of the salami.\n\nIn general, found it hard to get good pizza in philly, but this is definitely one place to try out", "date": "2018-09-10 20:52:56", "user": {"name": "Matt", "review_count": 284, "yelping_since": "2017-01-01 20:52:39", "elite": "2017,2018,2019", "average_stars": 4.05, "fans": 26}}
{"review_id": "I8QPW87ZgrLpPlEDVXwYHQ", "user_id": "uIQLJY4y-FIBglM61-Zx0Q", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome atmosphere food recommend it\nHad personal pizza and wine\nGood location and parking is deceny", "date": "2018-09-09 14:17:01", "user": {"name": "Mail", "review_count": 10, "yelping_since": "2013-07-19 17:16:30", "elite": "", "average_stars": 4.1, "fans": 0}}
{"review_id": "y2YyLQoEzR0FN04TMUzdgQ", "user_id": "Ps5r8bzd1UO-UDGBUkMkBw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this pizza place (and I'm a New Yorker!!). My favorite is the Bufalla Mozzarella. The seasonal pizzas are great too (the garden/asparagus was very good). This is a fun place to visit with friends.", "date": "2018-09-08 01:24:10", "user": {"name": "Neha", "review_count": 30, "yelping_since": "2014-12-27 06:09:36", "elite": "", "average_stars": 4.03, "fans": 0}}
{"review_id": "_1n9OYQGcJ52cT4i4yVNlw", "user_id": "AMazgnwFbGlDmViAQwiv-w", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Really tasty/fresh thin crust pizza!! The only reason I took a star away is because the appetizer was supposed to be grilled mushrooms and cauliflower but came out bland and soggy. They also served their house wine bottle in a carafe despite having a carafe as a lower priced item that they apparently just fill less? nonetheless a nice spot and will probably be back or will at least order takeout.", "date": "2018-09-02 04:23:38", "user": {"name": "Haley", "review_count": 25, "yelping_since": "2018-09-02 03:48:29", "elite": "", "average_stars": 4.08, "fans": 4}}
{"review_id": "ee6sKna7W-PSgfv_0vdr-g", "user_id": "dxEU4v4fSX9aD3tH8dy7cw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Really good pizza if you like extra thin crispy crust! \n\nI have been to nomad more times than I can probably count, and it is a really good option when looking for pizza in the center city area. The place is relatively small, but I have never had to wait for a table. My standard order is the spicy sausage pizza, which is not too spicy and has delicious crumbles of sausage and onion. I have been to the other Nomad location, and it seems that they put more toppings on their pizza (in my experience- I also only went there once) than this location, but I like this locations meatball appetizer better. I wouldn't say I crave their pizza, but my boyfriend and I really like their meatball appetizer. It comes with 3 meatballs covered with sauce and some Parmesan cheese and served with crispy bread thins and broccoli rabe. It's my fav about nomad.\n\nMy biggest issue is the service which almost makes me want to give it 3 stars. I have had multiple issues with food coming out slowly or servers just not being aware of things like empty glasses of water or coming to check in with the table. One time it was so bad that the person making pizzas in the back went up to the front to find out where our waiter was. I wish they would improve the training of staff, it would make the experience more enjoyable!", "date": "2018-08-28 00:45:50", "user": {"name": "Lauren", "review_count": 69, "yelping_since": "2015-07-20 14:54:17", "elite": "2018,2019", "average_stars": 3.46, "fans": 4}}
{"review_id": "BN9yX_1nSzfQlndNMhYZYw", "user_id": "gWvYumqEEsoOAg8sTKFJEA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is good for thin crust Italian style pizza, not bad for what it is, not a destination IMO", "date": "2018-08-20 23:56:04", "user": {"name": "Hannah", "review_count": 6, "yelping_since": "2011-10-29 00:08:26", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "v8EEUb1KPLCpR4kduEASYQ", "user_id": "PdFB0Aks8uggeDAh_tLZtg", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I fly up from Tampa for pizza at this restaurant. I would eat the Truffle pizza everyday", "date": "2018-08-18 22:08:16", "user": {"name": "Pam", "review_count": 3, "yelping_since": "2018-07-18 12:12:28", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "gTq5mb0rOymGJnJpiEMypQ", "user_id": "xXyewQCsDGKvWmQIEHK_3A", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "My wife and I visited Philadelphia from NYC for a convention and are delighted to have found this gem.  Friendly, efficient service and reasonable prices.  The blue cheese salad with walnuts and seasonal fruits was delicious, and the margherita di bufala pizza with pepperoni was crisp and fresh.  Capuccino and cannoli made for a perfect conclusion.  Will definitely visit again when back in Philly.", "date": "2018-08-17 00:46:30", "user": {"name": "eric", "review_count": 5, "yelping_since": "2011-09-04 12:45:45", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "EBAbsbtfTx-iFVbO1Y5-sw", "user_id": "rd0J9qgJsrU7YnfzLb1eQw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 14, "funny": 2, "cool": 14, "text": "My friend and I came here on a Wednesday around 5:30pm for Center City Sips, and we got a nice table right by the window. \n\nWe tried a few beers on the Sips list (they had three options of $4 drafts), and I also had the Pineapple Basil Margarita ($6), which was very refreshing.\n\nTheir personal pizzas were available for $6-$8 as part of Sips, so my friend and I split the Trenton Tomato Pie (shredded mozzarella, Italian tomato, oregano, garlic, red pepper, basil, & parmigiano) and the Margherita. Both were delicious - despite the simple ingredient list, they were so flavorful.\n\nI definitely plan to come back for some more delicious wood-fired pizza and great Happy Hour specials!", "date": "2018-07-30 02:03:54", "user": {"name": "Elizabeth", "review_count": 294, "yelping_since": "2016-12-07 20:19:44", "elite": "2018,2019,20,20,2021", "average_stars": 4.39, "fans": 25}}
{"review_id": "lvsfSPSog3GN7HK4TggRqw", "user_id": "9O0EgQUzityaKncpgQ5-YA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I am lactose intolerant and love their marinara pie which is simple yet flavorful. They are decently priced, however I would like the portion size to be a tad bit larger. Other than that service is alway prompt and nice, although I only have done take out.", "date": "2018-07-27 16:15:48", "user": {"name": "Jade", "review_count": 119, "yelping_since": "2015-04-16 19:25:52", "elite": "2017,2018,2019", "average_stars": 3.3, "fans": 9}}
{"review_id": "RMwRt6djfTIHdFG07CGrIg", "user_id": "7hk4z3ytm-wwVtsKDeEHdw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Outstanding! My family and I were staying in a hotel nearby. It was raining so we needed something close. Nomad was a half block away. The pizza is incredible. Everyone will talk about the thin and crispy pizza. I want to talk about the incredible flavors. We had two different pies and each was so flavorful. The deserts are just as good. Many great beer choices and a full bar. So happy we were forced to stay close due to rain.", "date": "2018-07-04 10:42:36", "user": {"name": "Randy", "review_count": 14, "yelping_since": "2012-08-11 13:49:14", "elite": "", "average_stars": 4.43, "fans": 0}}
{"review_id": "ohpW4WOjoIhsb-Ku_13YLg", "user_id": "1msVg_B-Ef6K814sQDOTPA", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Nomad is definitely my favorite place to go during SIPS if I'm looking to eat. $6-8 pizzas, $5-6 drinks - what more can you ask for? Their pizzas are absolutely delicious too. Would highly recommend the spicy soppressata (we ordered a spicy sausage instead but glad this one came instead). They were very liberal with the toppings which I appreciate and compared to the sausage, the meat just covers more surface area. I came in two Wednesdays ago and there were 2 large parties that had made reservations :( Luckily, there were 5 spots at the pizza bar and my party of 2 fit cozily there. I didn't even know there was a pizza bar and it was so nice that we got to see how the pizzas were made while enjoying them ourselves! I really liked that aspect and it was farther away from the window where there was hot air coming in the restaurant. The restaurant is a pretty small space, but their service is very quick, waiters and waitresses are very prompt and attentive. Would highly recommend that you try this out for SIPS and maybe I'll even be back to try them when it's not just SIPS :) Keep up the good work Nomad! We love you", "date": "2018-06-26 14:44:50", "user": {"name": "Leslie", "review_count": 285, "yelping_since": "2014-11-26 23:29:38", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.95, "fans": 26}}
{"review_id": "jsKiPFn3-iGPGmWM4CrXqQ", "user_id": "OxLGqUsCy7NfXrt0z9iAKw", "business_id": "pxmBh8YZ6HLGQfNHvJoHzA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place had been on my to-try list for a while. The location and decor is great, as was the service. We went on a Tuesday night which had a great special: buy one get one free for their regular sized pizza. We tried the Trenton Tomato Pie and the Spicy Sorprressata. Good, not great. The crust was so thin it felt like a cracker. On the plus side, it was so thin it barely counts as eating carbs, right?", "date": "2018-06-20 12:42:07", "user": {"name": "Ada", "review_count": 15, "yelping_since": "2010-02-03 20:41:43", "elite": "", "average_stars": 3.67, "fans": 1}}
