{"business_id": "lKU_kljhbEQKIPaM1Zbqiw", "name": "Little Nonna's", "address": "1234 Locust St", "city": "Philadelphia", "state": "PA", "postal_code": "19107", "latitude": 39.947786438, "longitude": -75.1618928091, "stars": 4.0, "review_count": 1147, "is_open": 1, "attributes": {"RestaurantsPriceRange2": "2", "GoodForKids": "False", "RestaurantsAttire": "u'casual'", "Alcohol": "u'full_bar'", "RestaurantsReservations": "True", "NoiseLevel": "u'average'", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "Caters": "False", "BusinessAcceptsCreditCards": "True", "HasTV": "False", "WiFi": "u'no'", "DogsAllowed": "False", "BikeParking": "True", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': None, 'dinner': True, 'brunch': False, 'breakfast': False}", "Ambience": "{u'divey': False, u'hipster': False, u'casual': None, u'touristy': False, u'trendy': None, u'intimate': True, u'romantic': True, u'classy': None, u'upscale': False}", "HappyHour": "False", "RestaurantsGoodForGroups": "True", "RestaurantsDelivery": "True", "OutdoorSeating": "None", "RestaurantsTakeOut": "True"}, "categories": "Restaurants, Italian", "hours": {"Monday": "17:0-22:0", "Tuesday": "17:0-22:0", "Wednesday": "17:0-22:0", "Thursday": "17:0-22:0", "Friday": "17:0-22:0", "Saturday": "17:0-22:0", "Sunday": "17:0-22:0"}, "category_list": ["Restaurants", "Italian"], "stratification_tag": "Italian"}
{"review_id": "iTm7_Tvy4_zn1Gfj8voGrA", "user_id": "Y2ShLn_gdJrpV3LD-ln_nw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 3, "text": "These phenomenal Italian devours come all the way from Little Nonna's located in the center city area of Philadelphia. This small Italian restaurant is snuggled in between two businesses. They offer both indoor and outdoor dining.  They are very prompt with seating their guess who either has reservations or who doesn't have reservations. Once I got here I was seated properly by my server Connor. Connor was very knowledgeable of all the wines that were offered as well as the full menu. He introduced the special for the week which was the seven fishes special which was a three-course meal that introduced seven fish dishes. I was totally intrigued and I took him up on his offer. The feast is an annual 6 day long special menu (regular menu available as well). I ordered the red wine that was simply amazing. It was very smooth yet tight towards the end. The bathrooms are really clean, and they are well decorated with priceless pieces of art. The feast of the seven fishes consisted of the olive & smoke salmon crostone, the fried cod, the grilled octopus, the shrimp scampi with the baccala mash were all incredible. The code shrimp salad was simply amazing. While the grilled octopus was cooked to perfection. If you ever find yourself in Center City wanting some authentic Italian cuisine please check out little Nonnas and please tell them that SHIMMY sent you and ask for my good friend Connor!", "date": "2022-01-16 13:51:42", "user": {"name": "Julian", "review_count": 103, "yelping_since": "2014-10-14 04:39:04", "elite": "2019,20,20,2021", "average_stars": 4.25, "fans": 10}}
{"review_id": "85vyHA52vBCxb5fTlNqDbg", "user_id": "I_dOZb3ZCLfSfV3lbFhu0g", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Food was amazing, the Courtyard is where to sit for the perfect ambiance. Absolutely loved it!", "date": "2022-01-09 17:27:25", "user": {"name": "Rhiana", "review_count": 24, "yelping_since": "2013-09-06 21:50:32", "elite": "", "average_stars": 4.24, "fans": 0}}
{"review_id": "h5LB08UY_ehZdamG332mWw", "user_id": "vF206LfYQJLOyiIk8l_tzg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wasn't too happy with the chicken Al Mattone and the unnecessary food garnishing included in a separate container. Could've included a salad or some bread to make up for the overcooked chicken and Brussels sprouts.", "date": "2021-12-28 03:46:34", "user": {"name": "Dani", "review_count": 4, "yelping_since": "2020-11-21 01:34:31", "elite": "", "average_stars": 3.25, "fans": 0}}
{"review_id": "1Wm6qZSW8DNtMSKnIepjng", "user_id": "WgrG-HgahUbjV1O2A45TfA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Came here for Restaurant Week in fall 2021. The main pasta and desserts hit the spot. This Italian place is not one of those super super fancy restaurants but the more quaint, should I dare say more authentic Italian place. You should ask for one of their seatings in the patio inside the restaurant! Super romantic and great at night with the string lights overhead.\n\nWe didn't order spaghetti and meatballs but the table next to us ordered and it looked delicious (will probably order it the next time we go). \n\nThe wild mushroom avacini was a ball of goodness, the warmth and the mushrooms all melted inside the fried outer was spectacular. Also got the rigatoni alla vodka.", "date": "2021-12-26 04:14:44", "user": {"name": "Stephanie", "review_count": 20, "yelping_since": "2021-08-07 02:17:54", "elite": "", "average_stars": 4.15, "fans": 0}}
{"review_id": "oAKro-Pfow2wzCsXWmoERg", "user_id": "711gsmiQOjOAHZP_0uJabw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great tasting Italian food with a small menu of options to choose from. Staff is polite and helpful. Prices are reasonable.", "date": "2021-12-20 03:18:50", "user": {"name": "Naveen", "review_count": 551, "yelping_since": "2012-12-29 14:45:29", "elite": "", "average_stars": 3.74, "fans": 6}}
{"review_id": "szSBUaikh7vGPsWoWtiYTw", "user_id": "QVaRjjvGEn0rgfmoh-WHEw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I knew I was in for a treat when I saw the line outside. But lucky for us we didn't have to wait long until we got our table. Let me start off by saying the ambiance and atmosphere of this restaurant is homely and comfortable. It's perfect for a gathering with friends and family or a date with someone that you're getting to know. I ordered the spaghetti and meatballs while my friend ordered the eggplant parmesan. Now as a meatball aficionado I will say that this was possibly one of the best meatballs and marinara sauce I've had in Philadelphia. My friend couldn't stop raving about the eggplant parmesan and both of us have promised ourselves that we will be returning on our next visit. At this price point I don't think that this restaurant can be beat by any of the surrounding Italian restaurants. Enjoy friends because we know we did.", "date": "2021-12-15 16:53:58", "user": {"name": "Peter", "review_count": 223, "yelping_since": "2012-09-18 02:22:50", "elite": "2018,2019,2021", "average_stars": 3.75, "fans": 22}}
{"review_id": "aTNbztwvTEg-rucXuSOgSA", "user_id": "16xv08cy9TtvFY-9V4JLyQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was looking forward to this place after seeing raving reviews but I was disappointed. The only good thing about this place was the ambiance. The waiter asked if we wanted garlic bread or regl bread with our meals so we assumed it came with it and wasn't an extra $5 since it wasn't mentioned. I had the chicken parmigiana which was pretty good but the sauce on the pasta was super sweet and disgusting.", "date": "2021-12-10 18:31:11", "user": {"name": "Miranda", "review_count": 58, "yelping_since": "2016-01-29 03:29:03", "elite": "", "average_stars": 3.42, "fans": 0}}
{"review_id": "6Zgd5-VxqCN-iKNiI0JB8Q", "user_id": "6QlpAnPAqu8ax6R6JGdXzA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Little Nonna's is one of the reasons why I think about Italian food whenever I visit Philadelphia. I visited Little Nonna's on a Friday evening after trekking through a rainstorm. I had reservations for 5:30 pm and got to sit in the covered back patio area. There were parts of the patio that weren't ultra rainproof, but most of it was. The space was very warm and cozy with lots of live plants decorating the space. Got the escarole and apple salad, wild mushroom arancini, and the Sunday gravy. Portion sizes were very generous, especially the Sunday gravy. The braided beef short rib in the Sunday gravy was so tender the meat basically fell apart without really having to chew it. The salad was refreshing and the apples added that extra sweetness and crunch amongst the leaves. Service was great, food was delicious. It's a shame that I can only eat so much for one meal. Looking forward to my next visit.", "date": "2021-12-07 14:27:01", "user": {"name": "Amanda", "review_count": 121, "yelping_since": "2016-09-16 22:37:59", "elite": "2021", "average_stars": 4.38, "fans": 2}}
{"review_id": "HAuPsfKla3A6m_kyyPsHIw", "user_id": "z_-T67LB0OgmKseK8KgSKQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We got there an hour early and they were very gracious to accommodate us. Service was great. (6'5\" server) Every dish was perfect: charcuterie board, meatballs, eggplant, Philly wedge, spags & mb, chicken parm, Sunday gravy, rigatoni vodka sauce!! Wine choices....perfect! Thank you, we'll be back!", "date": "2021-11-24 23:44:22", "user": {"name": "Jen", "review_count": 4, "yelping_since": "2016-01-16 13:13:49", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "trgtUaL54dN-hWMUMdLjwQ", "user_id": "NnseU4d-4N-qGXwY0Erzow", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food and Service were both AMAZING! The garlic bread melts in your mouth. Spaghetti and meatballs an the chicken parmigiana were amazing! Order the cannolis, our daughter picked one up and gobbled it!!", "date": "2021-11-22 17:08:45", "user": {"name": "Frances", "review_count": 2, "yelping_since": "2021-11-05 17:32:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "4LAnajhIzaI1owMdgYpYPw", "user_id": "phTTOwsNA_4Sz2VgftzsBw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Was visiting Philadelphia to celebrate a friend's birthday. We waited over two hours for a table and when they sat us outside (when the weather was in the 30°s), we asked for a covered table because I had stage lV cancer, a transplant  and was suffering from neuropathy. That I physically couldn't sit there ...they just told me 'sorry it didn't work out for you'. Both the waiter and the host had the same response. Even though they could have accommodated us at a different table they were so pretentious that they didn't care at all, to put it lightly.", "date": "2021-11-21 12:13:20", "user": {"name": "Greg", "review_count": 4, "yelping_since": "2014-07-24 20:20:19", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "-KFZeqxE0BWXht5qy-VBZQ", "user_id": "LBqZf1OAa0mxbVqC9du_Gw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "This should be advertised as American-Italian restaurant, because our Italian counterparts would have a big problem with this place. Not authentic. The best part of my meal was my glass of wine that arrived AFTER my appetizer. My friend and I had Nonna's spaghetti and meatballs, and the chicken parm, both of which were SWIMMING in sauce. And not in a good way. There's no complimentary bread, so it's not like we were gonna sop up the acidic sauce either.", "date": "2021-11-20 12:15:39", "user": {"name": "A", "review_count": 20, "yelping_since": "2017-02-03 02:32:44", "elite": "", "average_stars": 2.9, "fans": 0}}
{"review_id": "yEZdl6TBlU86LToHIvIfIQ", "user_id": "snAr1ke4LGWJEXY0YPuTNQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was pleasantly surprised by this restaurant. Not only was the ambiance great but the food and service was amazing. Their menu is limited however I can guarantee that they cook every mean they offer exceptionally well. If the weather is nice ask to be seated in the back patio you won't be disappointed. Make sure to order the garlic bread, I believe it's freshly made and seasoned so well. I ordered the Campanella Nero which is squid ink pasta with shrimp. The dish was seasoned perfectly, each ingredient was allowed to shine and I was left wanting more. My boyfriend ordered the Steak Tagliata, the steak was perfectly charred and the fingerling potatoes complimented the dish really well. Note this dish comes with mushrooms. Be sure to stop by if you're in the area. Also Philip was our waiter and was very attentive.", "date": "2021-11-16 18:09:00", "user": {"name": "Sheila", "review_count": 18, "yelping_since": "2021-09-18 19:43:07", "elite": "", "average_stars": 4.72, "fans": 1}}
{"review_id": "L4UaXMU3PVycmWYEgB9j9Q", "user_id": "b8fJfWhl2rvvb5OHe_RVZQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "I just cried, tears down my face, because the tiramisu was so good. I have never had a good bring me to tears before. I got the tiramisu to go because I was so full from the giant portions! \n\nI got Nonni's Spaghetti & Meatballs and my fiance got the Sunday Gravy ... we were both blown away. First by how much food we got, but second how DELICIOUS it was. \n\nAt first I was nervous the prices were a bit high, but rest assured it is worth every penny! We will definitely be back again!!! \n\nHelpful note: it's just as delicious the next day as left overs :)", "date": "2021-11-11 17:26:44", "user": {"name": "Tristin", "review_count": 25, "yelping_since": "2018-10-18 23:51:48", "elite": "", "average_stars": 3.81, "fans": 0}}
{"review_id": "LKrDOGrn0rd6YDshGmaKPA", "user_id": "itcyGJsassJ0iutr0gBMjg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 2, "funny": 1, "cool": 2, "text": "If you're dining inside Little Nonna recently, you will find that it is an intimate dinning experience. The perfect romantic space for a date. The reflection of the lights against the clear dividing wall between tables look like stars. On my recent visit, I had a wonderful time. The pasta was delicious  along with the yummy garlic bread which includes freshly roasted garlic that you can squeeze on top of the bread. I also enjoyed a nice sangria with the meal. What makes the whole evening even better was my date. He was just perfect.", "date": "2021-11-10 18:25:50", "user": {"name": "KhanhMy", "review_count": 407, "yelping_since": "2013-05-23 14:15:35", "elite": "2021", "average_stars": 3.41, "fans": 28}}
{"review_id": "ms6GiFZbBdrpsB8vnKqcfQ", "user_id": "AIThV7psRb6R8WD4LiYPdA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "They were very accommodating about reservations which was nice! The courtyard area was cute. \n\nWe knew what app we wanted even before fully pulling up the menu online. We were told we had to order appetizers and entrées at the same time, since the kitchen was too busy. It looked like about 30% of indoor/outdoor/courtyard tables were full...but maybe they had a lot of carry outs. Little frustrating though for entrees to come out literally 5 minutes after appetizers. Couldn't enjoy the apps without entrees getting cold, and all crammed into the tiny table. \n\nNot the biggest deal, obviously, but enough to be a turnoff. The food was good, but with so many options in Philly, things like that tend to really distinguish restaurants.", "date": "2021-11-09 03:49:59", "user": {"name": "Niki", "review_count": 156, "yelping_since": "2017-09-24 22:12:57", "elite": "", "average_stars": 3.63, "fans": 1}}
{"review_id": "kqt-fOpE206VcuzwSLP2Vg", "user_id": "3c3uj4KIExrxmbSLOkzLWg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "Short and simple: The food here is amazing! Feels like a small mom & pop restaurant you'd find in Italy! Came here for Restaurant week and we were able to try a few of their pastas, and they were all amazing! The meatballs for the appetizer were absolutely delicious. Their tiramisu was also so fluffy and soft. Honestly, A+ to their food. We came rather early and booked a table, so not much of a wait. Server was knowledgeable on what they have, and also had recommendations regarding wine! We were also able to sit in their back outdoor seating area, which was a pleasantly surprising cute space. Definitely worth coming back!\n\nRating: 9.0/10\nPros: All their pastas\nCons: Not much.", "date": "2021-11-09 00:15:24", "user": {"name": "Patrick", "review_count": 153, "yelping_since": "2012-06-09 02:33:03", "elite": "2018,2019,20,20,2021", "average_stars": 4.14, "fans": 8}}
{"review_id": "nlGZYfokPmbv4G_wPe2O0Q", "user_id": "KIXxVQW0WeSbPGAwg5P_4A", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Delicious. I had the cheese stuffed meatballs and they were FANTASTIC.", "date": "2021-10-26 14:20:01", "user": {"name": "Michelle", "review_count": 61, "yelping_since": "2011-09-05 22:41:42", "elite": "2021", "average_stars": 4.18, "fans": 1}}
{"review_id": "jwntUhDJ1YHrAIGBwGnkpg", "user_id": "ggzgUqbA8RtwTvY5z1Yysw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 4, "funny": 0, "cool": 1, "text": "One the of best Italian places I've been to in a while. Wife and I sat in the back covered courtyard and it was a nice romantic meal with excellent service.\n\nWe ordered a bunch of items so the waiter recommended bringing certain things out a different intervals to create several courses, which worked nicely.\n\nStarted with creamy Stracciatella with olives and fresh warm bread. We followed this up with a tangy escarole/apple salad. One order of salad was plenty for two. \n\nNext up was a fantastic course of wild mushroom arancini and broccoli rabe with white beans. The four crispy rice balls had a lot of flavor. And the rabe had a nice garlicky flavor with a kick from the red pepper flakes. \n\nFor dinner, my wife went with a good portion of branzino. She said it was nice and fluffy with perfect seasoning. \n\nI went for Nonna's Sunday sauce dinner. Pasta of the day was orrechiette. It came with the side of short rib, garlic sausage and their famous meatball. Portion was enough to take half home. Sauce really did remind you of eating at your grandma's house as a kid. Nice flavor. All the meats were delicious with the meatball standing out. \n\nWe also did the garlic bread on the side. Hot toasted bread with a side of roasted garlic head to spread. \n\nOverall, this placed wowed with its food and service. Looking to try a new place in center city? This is a good pick.", "date": "2021-10-25 12:15:25", "user": {"name": "M", "review_count": 40, "yelping_since": "2013-08-21 15:56:39", "elite": "", "average_stars": 3.78, "fans": 1}}
{"review_id": "zFCOsEC5mYzdz6_nSe-n3A", "user_id": "4YHsquxf-ngYgTW2A2t9hg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere! Highly recommend the Sangria. Portions were pretty large so easy to share with friends. Staff was very warm and welcoming", "date": "2021-10-24 23:23:41", "user": {"name": "Elizabeth", "review_count": 5, "yelping_since": "2018-03-25 18:46:35", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "3QFk8rb8vQBLtsLMWnEZJA", "user_id": "N5lY7zWnXpdXGxuuHdRcGg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "Had carry out from here over quarantine and like many other Italian neighborhood favorites, this place got the job done. \n\nI know a lot of people might think ordering spaghetti and meatballs out at dinner is a faux pas, but this place is an exception. The spaghetti and meatballs are a must-try. I believe it was about $15-16 bucks. \n\nWould love to go back and try again in person! Until then, B+ 4 stars!", "date": "2021-10-14 18:32:59", "user": {"name": "Fernando", "review_count": 34, "yelping_since": "2020-12-03 22:31:58", "elite": "2021", "average_stars": 4.29, "fans": 1}}
{"review_id": "yVvR0bXgmWLNzgxzWD_UHw", "user_id": "ATiE5_7Md8S3yO3CbEHXWQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "My wife and I had a great dining experience here. The staff was very knowledgeable and friendly. The food was pleasant and surprising while still maintaining a rustic Italian oeuvre. \n\nItalian food is almost always unsurprising. The margin between the best and worst Italian food is relatively narrow. For a restaurant to deliver four bites of familiar foods with an unfamiliar twist was a pleasant deviation from the status quo. \n\nThe meatballs for example were standard from the outside, but with smokey and cured undertones. The chicken parm was crispy enough to handle the burrata and the fennel salad added a pleasant note. Even the house made sausage had nuance that I didn't expect.\n\nParking is aplenty nearby. The courtyard:garden area was lovely and intimate. A+ dining experience.", "date": "2021-10-13 01:56:48", "user": {"name": "Zack", "review_count": 174, "yelping_since": "2018-03-18 17:49:57", "elite": "2018,2019,20,20,2021", "average_stars": 3.98, "fans": 12}}
{"review_id": "QHH7NUrg-1HCbbLbwSgvfg", "user_id": "33HPJ06cxmnphCAogiG3nw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "We came into town for my son's last treatment at CHOP.  I made a reservation for 5pm in the courtyard to celebrate with my 7yo, 7 month old, and husband.  We got there at 4:50pm.  My son was hot and wanted water, my daughter really wanted to nurse.  I just popped into the restaurant to ask if we could change our reservation from the courtyard to a sidewalk booth.  There was a hefty brunette woman who said they didn't have my reservation (I have a copy of it in my email) and that they maybe could sit us, but to come back in ten minutes.  She was not very nice about it.  My husband waited w my daughter standing outside the booth and I went and got my son a bottle of water around the corner.  They got us the sidewalk booth and asked us if we needed a high chair.  We said yes.  They never brought us one.  They did say that we couldn't have outside beverages, so away went the water.  The food was good.  But, we really did feel unwelcome.  I kept a smile on for my son.  And really wanted to show the lady my reservation in my email, but didn't.  Meh.  Next.  Philly where's the love?  Not here.", "date": "2021-10-08 23:33:50", "user": {"name": "Rachel", "review_count": 3, "yelping_since": "2019-09-19 13:54:10", "elite": "", "average_stars": 2.5, "fans": 0}}
{"review_id": "KrQf1bTIiTNRstt0N4gi_g", "user_id": "2tOFaC1hBOV-vAFzAaqzFA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "all of the food i've ever gotten from here has been so good! but the best was the tiramisu, i'm obsessed with it", "date": "2021-09-29 00:47:09", "user": {"name": "Ramya", "review_count": 2, "yelping_since": "2019-09-01 23:38:29", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "4NodFlQsXYhwg6aRh34-2g", "user_id": "361gGBlPMsMAYf75uoyS_w", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "Amazing Italian cuisine! From the bread service to the antipasto to the dinner, I was in heaven from start to finish.\n\nI had the Sunday gravy, which is a delcious combination of the house gravy with sausage, meatballs and meat, served with a healthy bowl of pasta. It was one of the most delicious dishes I have ever had in my young life.\n\nNonna's will definitely be a require stop whenever I am in town.", "date": "2021-09-27 01:29:36", "user": {"name": "Arturo", "review_count": 259, "yelping_since": "2017-10-24 16:33:24", "elite": "20,20,2021", "average_stars": 4.17, "fans": 12}}
{"review_id": "mYdwXr_XWjlB07t5qgfVfw", "user_id": "UHyquwvf_mI98eNsbIZbng", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "My husband and I had dinner here on our last night in philly. Best squid ink pasta I've ever had. I'd come back just to have that squid ink pasta again. Shrimp was a bit over done though; it was hard to chew. Roasted garlic was great with the garlic bread. Panzanella was hearty and healthy. The restaurant is beautifully decorated inside and outside. Do not try to drive in anywhere in downtown Philly. It's easier to take the local bus and or to walk. You won't find parking anywhere and the roads are just way too narrow.", "date": "2021-09-26 18:56:33", "user": {"name": "April", "review_count": 149, "yelping_since": "2015-06-11 13:25:11", "elite": "2021", "average_stars": 4.26, "fans": 12}}
{"review_id": "vUoR5B2TzzHQ4NjxDoConA", "user_id": "-6GY04bTPM2Zo4z0GN4a1A", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came for here for restaurant week with friends and managed to walk in since there was a no-show. The courtyard area is GORGEOUS though dimly lit. It had a cozy feeling and I loved the strung lights and overall vibe.\n\nFood was 10/10, I would come back non restaurant week just to get an entree and share some apps/dessert.\n\nHighlights of the meal: arancini, meatballs, short rib radiatore, tiramisu!!!", "date": "2021-09-24 13:18:59", "user": {"name": "Eileen", "review_count": 108, "yelping_since": "2019-10-25 22:16:56", "elite": "2021", "average_stars": 4.26, "fans": 6}}
{"review_id": "74ku23bq4-MXYYC-CilHpQ", "user_id": "sReHTpsK4shuPLpB0zvcDw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wonderful atmosphere, service and outstanding food!   Went during restaurant week and the portions were generous.  The courtyard was extremely well ventilated and yet felt intimate at the same time.  Highly recommend. Book reservations.", "date": "2021-09-21 00:52:55", "user": {"name": "Noreen", "review_count": 6, "yelping_since": "2009-06-25 00:12:44", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "k-g2EqtkcxXZaEpwxXD7jQ", "user_id": "c58LB4hCJcL93W52whHgKA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "We arrived at our scheduled reservation time and requested the covered porch-patio.  It was a lovely spot but the fans weren't ceiling fans but wall mounted fans which just blew my hair and shirt around to the point I asked to move to another seat.  There was very loud, not relaxing for dinner, unromantic music for our dinner date.  Not what I would've chosen for my restaurant.  The servers were masked but our server wasn't personable and mumbled through his mask and seemed annoyed when I asked him to repeat his words.  He also wasn't super attentive.  We ordered the Caesar salad eyeglass broccoli rabe which had great cornbread croutons and a hint of fresh anchovies.  We followed this with mushroom arancini balls with truffle sauce.  Hubby polished off his chicken parm and I had the spaghetti with 2 meatballs, sausage with a nice full plate of spaghetti.  Lunch will be this tomorrow. Overall very tasty meal but the meatballs were tepid.  .", "date": "2021-09-18 03:28:56", "user": {"name": "Janet", "review_count": 187, "yelping_since": "2010-02-21 12:47:16", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.78, "fans": 3}}
{"review_id": "aE7MwbEEyhST4e7_aibmVg", "user_id": "HGTdyEDygTqANThO64WDWQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 4, "funny": 1, "cool": 2, "text": "They do take reservations, but we did not have one and were able to get a table here last minute on a Monday. We were seated at an outside table on the sidewalk right outside the front door. They have the pods in the street, but those were full. Our server was great and was good about my change in order as I changed my mind moments after she walked away from taking our order.\n\nI was debating between the Campanelle Nero, which is a squid ink pasta dish, and the Short Rib Radiatore. I switched to the Radiatore and could not have been happier. The sauce was amazing, the short rib was nice and tender, and the mushrooms, horseradish and whipped ricotta came together perfectly. This meal paired nicely with the Nero D'avola wine.", "date": "2021-09-17 16:01:10", "user": {"name": "Steve", "review_count": 2416, "yelping_since": "2008-04-21 17:23:42", "elite": "2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.76, "fans": 89}}
{"review_id": "BAb_sl8ozKv8FyEJUrsu7Q", "user_id": "UAZAOST8ivs8Yk0_4Z9hDQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "My boyfriend and I were looking to grab some high-end Italian (special date night).\n\nA die-hard spaghetti fan, I immediately chose the spaghetti and meatballs. We had chosen some nice wine for the night, and I had heard great things about Little Nonna's. After avid contemplation, we opted for delivery.\n\nMy boyfriend, not as well versed in the delicates of Southern Europe, inquired about the ideal choice of entree from such an establishment.\n\nI offered the informed choice of Campanelle Nero because it both looked fancy and had squid. We both received our meals and upon unboxing immediately knew we had made the right choice.\n\nWe had also purchased some garlic bread because we, like many humans, enjoy carbs.\n\nOur spaghetti was a bit cold but hit the spot. Exquisitely flavored sauce covering a perfectly cooked bed of pasta, executed flawlessly. I give my complements to the chef. My boyfriend agrees. If you are looking for a fire plate of spaghetti, look no further. \n\nThe squid pasta was also an adventure for the taste buds. More spicy than I typically get, but worth the fancy name. My boyfriend described the taste of squid as salty but still richly flavored, as if we had just paid $15.00 for it. The garlic flavor completed the noodles perfectly, and peppers brought a good heat. The shrimp tasted fresh like they were straight outta Italian ports. They were meaty too. Nice shrimps, if I do say so myself.\n\nAll in all, great value, great food, great date with my boyfriend. \n\nIf you are looking for strong Italian cuisine and a night with your significant other you won't forget, do yourself a favor and come here with some wine. Don't forget the bottle opener though. You need that. \n\nAlso, smooth jazz. Thank me later.", "date": "2021-09-12 06:47:42", "user": {"name": "Fawn", "review_count": 1, "yelping_since": "2016-07-09 20:49:58", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "I2tzCrjQWQTjEQlUqPoIRA", "user_id": "AnmnLjGURagnzk9PukE-ZQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "Reservation booked for 5pm this past Sunday in their courtyard. We arrived right on time and it took them about 10 minutes to get us seated. It's a cool little stroll thru the alleyway to the courtyard and it is a cute space. Fully covered and some lights. Music at a comfortable level.\nOur server was over to get us water as we reviewed the online menu with the QR scan. You know the drill by now.\nOur server was pretty stiff. No smiles and if I'm being honest, I felt sort of rushed. When we put in our drink order (cocktails), she asked if we knew what we wanted for our appetizer and our meals. We had just arrived a few minutes earlier, and we had hardly settled in, so the plan was a cocktail and then order an app, and then decide on meals, but we went ahead and ordered the appetizer and our meals together. \nThe Charred Broccolini Caesar was just fantastic. Great crunch of textures from the greens and radicchio and those warm polenta croutons were quite sinful. \nMy wife ordered the popular Sunday Gravy meal and I went with the Steak Tagliata (hanger steak). Cooked one way (rare) and it was quite good. Had some unique mushrooms as a side (not listed on the menu) and a few fingerling potatoes, which were quite boring. The arugula and shaved parmesan was refreshing and that aged balsamic was a nice marinade. \nShort rib was the highlight of that Sunday Gravy. I'd prefer a spaghetti over the pasta they used for the dish. It was the type I would normally prefer for a mac and cheese and not this sort of meal. \nFor dessert, we had the tiramisu and it was a good portion for us to share and had a nice cup of coffee too. \nIt was a pleasant meal and a cute space, but not sure I'd be rushing back anytime soon. Stiff service and limited menu in a cramped courtyard was not exactly the ideal dining experience for the price tag. 3.5 stars.", "date": "2021-09-07 13:57:42", "user": {"name": "Tom", "review_count": 409, "yelping_since": "2010-05-06 19:31:26", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.82, "fans": 15}}
{"review_id": "sNc91vqjGDLNRMLLtaVwwg", "user_id": "h1H7Wb7pcVbRS3ZB0q1Quw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Some of the best Italian in center city. Ask to be sat in the back patio for a beautiful dining experience!", "date": "2021-09-07 00:34:29", "user": {"name": "Melissa", "review_count": 10, "yelping_since": "2019-03-20 16:36:26", "elite": "", "average_stars": 4.6, "fans": 0}}
{"review_id": "I-LEibtNsMxcdU1JTjg1vA", "user_id": "Gj9PNiAl8To3rRXbAWRBlA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is the cutest little Italian restaurant I have visited. The appetizer- arancini with mushroom and the pasta are to die for. So smooth and fulfilling! The portions are great for sharing. I hate tiramisu, but their tiramisu changed my life. It was so creamy and not overly sweet, great end to a wonderful meal. They have various sitting, but indoor is what I recommend for an intimate experience! The waiter was so sweet and accommodating to our likings. Everything we had was so satisfying! High recommend the Rigatoni and gnocchi! The pasta was def worth the carbs!", "date": "2021-09-05 23:02:47", "user": {"name": "Khusbu", "review_count": 94, "yelping_since": "2015-02-17 04:18:04", "elite": "2021", "average_stars": 4.22, "fans": 6}}
{"review_id": "UQTZLY-R8ok0xvIDeGRcgw", "user_id": "kHHbvbEmeUea6v6i3-AX0g", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "In Philadelphia on business and this place was recommended. Whole experience was wonderful. Reservations are a must if you want any chance here. Service was excellent, food was even better. Returned the next evening by myself and everything was excellent again. Sunday Sauce is spectacular.", "date": "2021-09-03 16:57:53", "user": {"name": "Chris", "review_count": 11, "yelping_since": "2013-05-22 14:28:47", "elite": "", "average_stars": 3.09, "fans": 0}}
{"review_id": "OWfe3TIB7T_qb0sCg1QMhw", "user_id": "etLA7u9VoTVbuyJ34FUAww", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "As others have said, the food at Little Nonna's is excellent. However, service is also an important component of the total experience, and unfortunately, the service and general atmosphere at LN was cold and perfunctory, bordering on rude. It was a bit embarrassing as our guests were in town from Houston and we would have liked to have shown Philadelphia off in its best light. \n\nAlso, although the outdoor courtyard is lovely, they were weirdly playing loud rock (which I love) and it just didn't go with this setting.\n\nInterestingly, I had a similar service experience at another restaurant owned by this team a couple of months back. I don't know if this is an indicator of the way they treat their staff, or a general lack of training and expectation-setting. In any case, it is a significant area that they could improve, creating an important counterpoint for their impressive food.", "date": "2021-09-01 23:49:05", "user": {"name": "Joyce", "review_count": 30, "yelping_since": "2008-08-06 00:01:22", "elite": "", "average_stars": 4.45, "fans": 0}}
{"review_id": "8WT-F8nc93sC_lfwuR_IRg", "user_id": "lBd2PMaBPdpRbUQEh1hHSg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 10, "funny": 5, "cool": 8, "text": "Make sure to make a reservation! This place is popular and they only have  7 tables for indoor - however they have plenty of outdoor seating.\n\nStaffs were nice - we were seated quickly after promptly arriving for our 6:30pm reservation. We ordered the Wild mushroom Arancini, Rigatoni Alla Vodka, Pan Seared Gnocchi, and Campanelle Nero (squid ink pasta with shrimp).\n\nThe Arancini is amazing!! I have never eaten this before and now I'm obsessed. It's crunchy yet soft on the inside, smothered in delicious aioli sauce. It's a MUST order appetizer.\n\nThe Gnocchi and Squid Ink pasta were delicious. I like the squid ink dish the best - the sauce was light and didn't have dairy. Tasted more tomato-y base. Gnocchi was nicely seared and the corn and mushroom paired nicely. \n\nI did not like the Rigatoni with vodka sauce. The best part of the dish was the sausages which were amazing!! Rest of the dish consisted of carbs and sauce. Maybe some vegetables would have complimented the dish.... The dish was so simple I feel like anyone could have gotten vodka sauce from the grocery store and make it themselves. \n\nOverall had a great experiences. We sat outside in the \"covered\" sitting area that were built on the roads. The downside with those seating is that there were NO airflow!! It was a 90+ degree day in Philly and we were sweating during our meal. I suggest getting an indoor seating or come during a cooler time.", "date": "2021-08-31 02:37:46", "user": {"name": "Anna", "review_count": 227, "yelping_since": "2016-05-28 14:20:28", "elite": "20,20,2021", "average_stars": 4.22, "fans": 19}}
{"review_id": "wji8D72c6T6_Ws6_YhhSCQ", "user_id": "zZLxNZKN7N0MQHfMhqbElg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place was amazing. Service is great, some could call it slow, but I loved the pace i didn't feel rushed. Servers are great food is great. Highly recommend the eggplant parmigiana", "date": "2021-08-30 14:05:38", "user": {"name": "Joey", "review_count": 2, "yelping_since": "2021-01-03 18:34:20", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "GmSvjLAvnJIYpUw_zkAUfw", "user_id": "MqrKK0-EpTNmS9xMYAj7Kg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Amazing service, amazing food!!! Our server was amazing and had the best recommendations. Try as much as you can \n\nTiramisu is one of the best I've ever had!", "date": "2021-08-27 04:32:46", "user": {"name": "Zina", "review_count": 49, "yelping_since": "2016-05-04 21:17:26", "elite": "", "average_stars": 3.8, "fans": 2}}
{"review_id": "KWpWmhIfqNKkIueU2R7p9Q", "user_id": "EQPNIlK1Psc9XkCnJdo2Vg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "We picked this restaurant based on the stellar recommendation on Yelp. OMG , if you are in the mood for Italian food Do Not Go there. Nonna must have passed away a long time ago and burnt up all of her recipes . \nThe food is a poorly plated mush of ingredients which have little to do with Italian food.", "date": "2021-08-22 03:27:47", "user": {"name": "Andrea", "review_count": 2, "yelping_since": "2018-02-17 22:21:05", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "CtM9fPqPIko2MiLWXFquMQ", "user_id": "op2c4RQMptf9pi5KoNltWw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "We stopped here after a day of sightseeing. Our waiter was very helpful and courteous. The food was delicious and it was another excellent meal. \nThe spaghetti and Lamb meatballs were so good and really delicious.\nThe salads were cold, fresh, crisp, and absolutely perfect. The entrees of various pasta were all typical high quality and fresh. \nLittle Nonna's service was personal, attentive, and professional. The place is charming and has a pleasant atmosphere. Will sure want to visit again.", "date": "2021-08-18 05:29:58", "user": {"name": "Elijah", "review_count": 31, "yelping_since": "2021-08-10 02:38:55", "elite": "", "average_stars": 4.36, "fans": 2}}
{"review_id": "NAHMOSpDMZoRGEJLUrsmIw", "user_id": "YcaZNr4HQ5f3ihajDQQLJw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Amazing!!! AMAZINGGGGGG. EVERYTHING WAS A 10!!! Service was great, sitting in the courtyard was awesome and so cozy, the food was so darn good and the 4 carafes of Adult lemonade were *chefs kiss*", "date": "2021-08-18 01:55:56", "user": {"name": "Alana", "review_count": 106, "yelping_since": "2010-05-12 19:48:28", "elite": "", "average_stars": 4.25, "fans": 3}}
{"review_id": "SUUCDkJQVOUXJ-2boAR9ng", "user_id": "m0Z0H_jPvyA5T00Pg6xT_g", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Rigatoni alla vodka was AMAZING. I normally pour a whole handful of parmesan cheese on my pasta, but this did not need it. My boyfriend ordered the spaghetti and meatballs and we weren't huge fans of it. Bummer, because this is what they're known for! Might just be our tastebuds, but it was too strong of a flavor for us. Felt too overwhelmed with herbs. Would come back for the rigatoni!", "date": "2021-08-17 01:08:41", "user": {"name": "Emily", "review_count": 9, "yelping_since": "2018-04-19 17:18:12", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "oC3FtvvevwXwwKauFS4udQ", "user_id": "PDtfRtooFWK9ePR2TTFUaw", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 1, "text": "I wanted to like Little Nonnas. We were in town for the week and it stood out to me when we searched for restaurants. We were seated quickly with a reservation but from that point it was a disappointment. Our server barely said hello, just came over and asked if we knew what we wanted for a drink. Every time he checked to see if we wanted to order a drink/food, it was \"ok, need me to give you 1 or 2 more mins?\" It just felt rushed. Not \"I'll give you a few mins to decide\" we ordered an app and the entrees arrived within mins of that, and we were never checked on during the meal. Same attitude about dessert, didn't ask how everything was, just \"did you want dessert?\" Unfortunate because the waiter who was working outside we could see was quite personable and explaining menu to folks etc. Terrible service is a let down, wouldn't come back.", "date": "2021-08-14 12:32:44", "user": {"name": "Noah", "review_count": 224, "yelping_since": "2013-03-02 00:56:25", "elite": "", "average_stars": 3.57, "fans": 5}}
{"review_id": "glD6uQ1zVTxW1oE-37C-Yw", "user_id": "sPVO0enGxBi8gsxjYjFuzQ", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely horrible service.  Booked a table for 2 for a special occasion went there and were made to wait for half an hour on table, I asked if someone can attend us , still no response.  had to leave and get dinner someone else. wouldn't recommend.", "date": "2021-08-10 12:57:58", "user": {"name": "Sunny", "review_count": 1, "yelping_since": "2017-10-07 00:14:09", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "r3wMN5vvvFBHznrUFx_Ppw", "user_id": "ygQxFoytqvt6W0E2NQPJow", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 2, "funny": 1, "cool": 2, "text": "Love little Nonna's! Authentic Italian food. Service is great. \n\nThe caesar salad and the garlic bread were great starters. The wild mushroom arancini and the pan seared gnocchi were amazing. \n\nFilling, satisfying meal! I'd recommend. Family-style environment.", "date": "2021-08-08 21:57:53", "user": {"name": "Nikki", "review_count": 194, "yelping_since": "2021-06-26 12:29:04", "elite": "2021", "average_stars": 4.32, "fans": 7}}
{"review_id": "wxXlv2dHXEukJFoeO6p-lA", "user_id": "fUqviptMEHEzGr0flP3dKA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Came here on a weeknight around 9pm and was able to dine inside immediately with no reservation required. They seemed to be able to take guests but a few did show up after with reservations. Nice interior dining with glass (I believe?) dividers between every table which is a nice touch during the next phase of the pandemic. My on-again off-again partner and I had the panzanella as an appetizer. It's basically croutons, peaches, veggies, and leaves. I personally didn't think it was anything special and looked like something I could make by throwing a couple ingredients around. I prefer more complex food with different textures but I did like the honey roasted peaches. I could barely taste the extremely thin sheets of parmesan. \n\nWe ended up sharing the Campanelle Nero which is squid ink pasta with shrimp and breadcrumbs. I thought this was very tasty and was happy with the flavors combined with the crunch from the breadcrumbs. My partner and I thought it was enough for the two of us that night but if you're really hungry I could imagine it's possible to eat the whole thing yourself. I would probably recommend this dish to anyone coming for the first time. \n\nI should also add the waitress brought 2 plates out before bringing out each course which was nice and made it easy to share. She also replaced all silverware after each course so there was no peach residue in my squid ink. She came around a good amount and seemed thoughtful which I appreciate. \n\nFor dessert we had the tiramisu which was delicious as well. Another item I would recommend. \n\nAll in all, a good experience which I didn't expect that night since I'm a tough critic. Try it out!", "date": "2021-08-08 09:38:17", "user": {"name": "Kevin", "review_count": 27, "yelping_since": "2014-12-21 23:02:03", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "fjXzchOYygbjQ1U2rRPe6Q", "user_id": "Bt4XKpyOHnx74SKu07k-eg", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Last night I Ordered Little Nonna's to go. It was decent but nothing special in my opinion. I do think we went wrong by ordering takeout, so I would give this place another try but in person.\n\nWe got the Chicken Parmesan, Spaghetti and Meatballs, and the Broccoli Rabe. All of these were extremely salty and my mouth was so dry after eating. If I am in my 20s and think that there is too much sodium... something is not right. Both meals were portioned nicely, enough for me to have some for lunch today. I was not a fan of the Broccoli Rabe it tasted like the vegetables had not been cleaned but my boyfriend disagreed and really liked it. Unfortunately, I don't think this place is very authentic and it does not taste like they make their own pasta. But then again I don't think many places do anymore.", "date": "2021-08-04 16:21:54", "user": {"name": "Angela", "review_count": 13, "yelping_since": "2020-01-06 03:41:25", "elite": "", "average_stars": 4.15, "fans": 0}}
{"review_id": "ZEv6G_R6kBZDvcuB8iVNTw", "user_id": "2s4NXgu_edC7jXa_Kyl21A", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Went here for a casual Sunday night dinner this past weekend. I have had this place on my list to try for awhile now and it did not disappoint. We ordered the garlic bread, \"Sunday gravy\", and spaghetti and meatballs. Everything was great! The service was a bit lacking as they forgot to bring us out some things we had asked for (extra parm, more water) but otherwise a solid dinner spot with nice atmosphere.", "date": "2021-07-27 00:32:14", "user": {"name": "Megan", "review_count": 186, "yelping_since": "2017-02-19 20:46:50", "elite": "2019,20,20,2021", "average_stars": 3.66, "fans": 2}}
{"review_id": "JzokLDdWI2ewpa6PfOBaVw", "user_id": "5QFE-0Tvl2Eqql0sxIEioA", "business_id": "lKU_kljhbEQKIPaM1Zbqiw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great Location and it's a fun place to enjoy! Service was pleasant and the food was delicious!  See our pictures you will not go wrong GREAT FOOD!", "date": "2021-07-21 16:28:03", "user": {"name": "Barbara", "review_count": 6, "yelping_since": "2019-12-14 00:26:12", "elite": "", "average_stars": 5.0, "fans": 0}}
