{"business_id": "7jYC4dxkoiAULgENY7hbMA", "name": "Mondo Dei Dolci", "address": "11903 Bustleton Ave", "city": "Philadelphia", "state": "PA", "postal_code": "19116", "latitude": 40.1214999657, "longitude": -75.0160301104, "stars": 4.0, "review_count": 54, "is_open": 0, "attributes": {"BusinessAcceptsCreditCards": "True", "RestaurantsTableService": "True", "Alcohol": "'none'", "WiFi": "'free'", "OutdoorSeating": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "DogsAllowed": "False", "RestaurantsGoodForGroups": "True", "RestaurantsReservations": "True", "GoodForMeal": "{'dessert': True, 'latenight': False, 'lunch': True, 'dinner': False, 'brunch': True, 'breakfast': False}", "BusinessAcceptsBitcoin": "False", "BikeParking": "True", "GoodForKids": "True", "RestaurantsTakeOut": "True", "RestaurantsAttire": "'casual'", "RestaurantsDelivery": "False", "Caters": "False", "RestaurantsPriceRange2": "1", "Ambience": "{'touristy': False, 'hipster': False, 'romantic': False, 'divey': False, 'intimate': True, 'trendy': True, 'upscale': False, 'classy': True, 'casual': True}", "NoiseLevel": "u'quiet'", "HasTV": "False", "WheelchairAccessible": "True"}, "categories": "Food, Bakeries, Restaurants, Coffee & Tea, Cafes, Breakfast & Brunch", "hours": {"Monday": "8:0-21:0", "Tuesday": "8:0-21:0", "Wednesday": "8:0-21:0", "Thursday": "8:0-21:0", "Friday": "8:0-23:0", "Saturday": "8:0-23:0", "Sunday": "8:0-20:0"}, "category_list": ["Food", "Bakeries", "Restaurants", "Coffee & Tea", "Cafes", "Breakfast & Brunch"], "stratification_tag": "Coffee & Tea"}
{"review_id": "bePgQsZniwktcpuW5g1QZg", "user_id": "1VSXbl7TCTOYTSqhhptU_w", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We went when it was getting busy so it took a while for food to come out. The crepes are buckwheat flour which is different but overall was just okay. However a lot of nice tasty desserts. We tried to use the yelp offer for 15% off our order but they did not honor the offer. Overall it's a cozy place to stop by for dessert and coffee, I'm giving it 4 stars but it's more like 3.5.", "date": "2019-06-16 21:12:24", "user": {"name": "Tina", "review_count": 1, "yelping_since": "2018-03-27 22:32:23", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "CL8DBdFHfLpaLImoqQdXtw", "user_id": "q0jKIIXJerT30zj9koAexg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Enjoyed this cafe. The decor was pleasant and relaxing. We indulged in 2 different crepes and ice cream bowl for the little one.\n\nFirst, the ice cream is generously portioned... 3 big scoops and very cheap.\n\nThe nutella & banana crepe was tasty. A standard dessert done well.\n\nThe poached apple crepe was good, but would try something different next time. I guess I had imagined it would be more like apple pie filling (soft with cinnamon sugar) than harder pieces of apple. Good thing though it wasn't too sweet.\n\nI really liked the crepes themselves, hard to describe the layers and consistency, just know they're tasty!\n\nThe cafe has many interesting desserts, cheat days beware!! :)", "date": "2019-05-12 15:30:24", "user": {"name": "Jason", "review_count": 125, "yelping_since": "2017-07-30 00:05:22", "elite": "2018,2019,20,20,2021", "average_stars": 4.09, "fans": 10}}
{"review_id": "TfM4VTDXwY5ecjyf9kcRgA", "user_id": "FGIDQFOCzxRzf7KCjOp4PA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I stopped in here because it was next to my dentist office and I noticed it seemed to have opened recently. The interior design is pretty opulent, with a big chandelier and grand piano in the corner. It's definitely not what you expect when walking into a cafe located in a Northeast Philly strip mall. \n\nThe desserts all looked amazing. So I choose a few to try. I got the Tiramisu, a few French style macaroons, and a couple little cakes. Everything was impeccably decorated. The macaroons were good. The cakes were very good. I would definitely try some other cakes from this bakery. I would also like to stop in and try their espresso, as it looked like they had all the right equipment to make a good European style cappuccino. The prices were also not super expensive, as you would expect from the look of the desserts. The to go packaging was pretty unique and had that higher end appeal. \n\nThe staff was a little stand-off-ish. It seemed like a place that was more comfortable to for its regulars. But, I wouldn't let that deter me from trying it out.", "date": "2019-04-28 15:02:51", "user": {"name": "Brittany", "review_count": 8, "yelping_since": "2019-04-19 01:37:42", "elite": "", "average_stars": 4.38, "fans": 1}}
{"review_id": "qqEqRYogO9zDtZw-uj_jPA", "user_id": "Mj2t99eE92BL5AZUHwbNGA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Really unexpected place for the location. Super cute interior. Staff are friendly but speak little English so just be aware. Menu is pretty extensive. Foods decent, pricing is fair. Parking lot can be a little tricky.", "date": "2019-04-25 01:59:11", "user": {"name": "Emily", "review_count": 162, "yelping_since": "2016-01-07 03:23:36", "elite": "20,20,2021", "average_stars": 4.05, "fans": 11}}
{"review_id": "B2-QXaK7nyDGO1zN7ZnG2w", "user_id": "38-wFwm9LLVdZxR4yW2OoQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Don't let the exterior fool you. Mondo Dei Dolci brings a wonderfully elegant taste to the northeast. Every bite of the pastries we had ordered was very flavorful, not overly sweet. I highly suggest stopping by and getting a couple things! Will be back again to try the rest of the menu.", "date": "2019-04-16 19:36:42", "user": {"name": "Josh", "review_count": 23, "yelping_since": "2013-04-22 22:26:57", "elite": "", "average_stars": 3.16, "fans": 0}}
{"review_id": "yNVAVDNc9uMvhvF5LjqitQ", "user_id": "4lXwcTkAaoZoO17y9eOljQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 3.0, "useful": 3, "funny": 1, "cool": 2, "text": "Mondo Dei Dolci is one of the very few pastry shops in NE Philly. Let me clarify \"very few\". Of course there are plenty of bakeries in NE Philly. But there aren't enough delicate pastries eatery, where I can buy and enjoy my cakes inside. \n\nLocation wise, not bad. It sits on the bustling bustleton ave. along with few other retailers. It does have a parking lot but spaces are very limited due to being small. We can agree is still better than paid or meter parking. \n\nMondo Dei Dolci's pastries changes daily. So if you ever favor a cake, call to ask before going as they might not have specific ones on the menu that day. So far, we try opera, red velvet, tiramisu, macarons, cookies and cream, bird milk soufle, carrot cake, triton etc.... Our favorite is Cookies and Cream. Of course it doesn't look pretty but it tastes really creamy. The rest meh, we didn't like the taste, like some taste funny. For example, whatever they put in the carrot cake, it alter it's flavor quite a bit. \n\nThey also carry a dine in menu. We finally have time to sit in and enjoy this time. I find out they have meat and sweet breakfast items. Variety flavors of smoothies and milkshakes. Also hot tea and caffeinated drinks. We tried 4 milkshakes that day: Mango, Strawberry, Banana, and Blueberry. We all loved the Strawberry, Banana and Blueberry. Mango MS not my favorite.", "date": "2019-03-30 23:01:03", "user": {"name": "Zhen", "review_count": 219, "yelping_since": "2011-07-20 19:19:07", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.71, "fans": 86}}
{"review_id": "phpNrtFZWbLw70rTP5FK8g", "user_id": "td59mx4jPGvSrTChGgvFlw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 1.0, "useful": 2, "funny": 1, "cool": 0, "text": "My friend and I really wanted crepes and this place was the only place open late so we decided to go here. They advertise that they are open until 11 pm we arrived at 9:30 pm. Stood in line to tell the woman our orders she told us to have a seat. We waited for about half an hour waiting for her to come take our order then we decided to walk back up to her she said she was busy (there was one other table there with 6 people on it) it was about 10 pm at this time. We asked for two crepes and two coffees she she doesn't have time to do the crepes for us. The place closes at 11 and she said she had 3 other crepes in the que for her to do. \nWe just left even though they close at 11 she stopped taking orders at 10. She didn't say she was sorry at all and gave my friend and I a really bad attitude problem. Even if the crepes are good I will never go back and try it because of the rude service we received.", "date": "2019-03-30 20:17:42", "user": {"name": "Hana", "review_count": 83, "yelping_since": "2016-03-31 23:45:27", "elite": "2018,2019,20,20,2021", "average_stars": 4.07, "fans": 13}}
{"review_id": "9TN5ejb7o4BOmDBnthlg6A", "user_id": "dUxRVDGmQT98z7pJkzxQfA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cutest little bakery in the Northeast! The carrot cake was scrumptious! Need to go back and try their crepes.", "date": "2019-03-30 16:11:08", "user": {"name": "Ancy", "review_count": 43, "yelping_since": "2016-06-22 01:59:41", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "Uy9-_rMcwUrH6Hx5UQAyvw", "user_id": "Vpldj9c3EDzCl0Z5ANfkhg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Not sure about this one Jack. The older lady behind the counter did not make us feel welcome,however the younger one was the exact opposite. The deserts tasted pretty good. Ditch the attitude lady you need other customers besides your own kind.", "date": "2019-03-21 00:04:49", "user": {"name": "J", "review_count": 43, "yelping_since": "2016-11-12 16:43:43", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "T9E2R20sQyHIxDAKyZfJKA", "user_id": "a5PVCCTbaDtYmvGz5ex6rg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We wanted a sweet treat on a Sunday afternoon and stopped in at Mondo Dei Dolci. The place is gorgeous inside and very cozy. We did have to wait a bit just because the person behind the counter was helping a lot of people and was by herself. We tried 4 different pastries: an Oreo cake, a Red velvet, and I cannot remember the name of the other two. They were all excellent, though the Red Velvet was a bit dried out. We also got a hot chocolate because they weren't selling any cold coffees. We will definitely go back! Only giving 4 stars because we were told they do not accept the Yelp discount :(", "date": "2019-02-21 01:36:32", "user": {"name": "Jessica", "review_count": 39, "yelping_since": "2016-01-27 22:10:57", "elite": "", "average_stars": 4.13, "fans": 0}}
{"review_id": "ko3dbBwYQsnovDhTjcX-jw", "user_id": "kmkORjrPFwoIG48IJRDc9w", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Beautiful cozy place, relaxing atmosphere.\nGreat latte, delicious cakes. \nPerfect place to spend some time with friends and family.", "date": "2019-02-06 16:12:25", "user": {"name": "Yuliia", "review_count": 1, "yelping_since": "2019-01-21 22:17:34", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "fCaI4k-s0IcPAJstwsgf9A", "user_id": "dR6kw8A6Q06h_5YlrzWSOA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have no words describe this place but perfect ! Foods amazing, environment is cute and friendly and the prices arents as bad as I thought for a fancy cafe like this. Definitely recommend it. Cute for dates and stuff !!", "date": "2019-01-04 08:32:33", "user": {"name": "Joann", "review_count": 1, "yelping_since": "2018-12-22 18:38:27", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "XeffeWQEk0LcE--BsdnsSQ", "user_id": "5WmTpuKwYPw_5LtkD5wglg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really enjoyed the breakfast blueberry cheesecake waffles and caramel latte. The service was great and the place had a cozy yet classy ambience. I highly recommend this cafe", "date": "2018-12-30 18:09:51", "user": {"name": "Devine", "review_count": 1, "yelping_since": "2015-05-28 17:04:46", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "M5QqteGtkmRynweVdsOxpw", "user_id": "hxndbrPeZiYvZHWT4H0qGw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Its over the top fancy with a giant chandelier and crazy chairs. Its on the high end of fancy for what I'm looking for in a coffee shop but I prefer that over some of the cafeteria coffee shops popping up.\n\nHad the cheesecake which was very good. Huge selection of sweets in the display window. And our cappuccinos were excellent.\n\nGreat spot for a coffee and to chill out.", "date": "2018-09-20 11:15:37", "user": {"name": "Robert", "review_count": 96, "yelping_since": "2009-06-22 11:13:59", "elite": "20,20,2021", "average_stars": 4.11, "fans": 4}}
{"review_id": "0Ubie3OUTMqxeCjH3U1hcQ", "user_id": "tKKRsMmiZJy7xUXuTtlVgg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Love the place and my uploaded photos express my review ..went on Tuesday and definitely taking my besties to day to enjoy a delicious coffee", "date": "2018-08-24 09:29:56", "user": {"name": "Olfa", "review_count": 7, "yelping_since": "2014-11-12 14:56:53", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "uo-2oCLmlxuifSgGlODkMw", "user_id": "NMOxipsnXc6olWdHYzXiYA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 4, "funny": 0, "cool": 2, "text": "I enjoy sweets, but not ones that are too sugary. I'd rather have flavor over a large amount of sweetness. Sometimes that is hard to find. Mondo Dei Dolci has very beautiful pastries that fit that bill. \n\nThere is a wide selection of pastries ranging from classic French ones to Eastern European ones that I have never seen before. Most are priced between $3-$4. I got three different ones to go. While they were all delicious, my favorite was the Colombian, a rich chocolate mousse with a little creme center with a layer of almond cake underneath, and then the whole thing was coated with a thin dark chocolate shell. My second favorite was a round pastry coated with hazelnuts with a Russian sounding name. The inside was a dense hazelnut cake. It was not very sweet at all. The Paris Brest was not a bad choice either with a thick layer of praline cream sandwiched between two light round pastry layers. \n\nThe total for those three pastries was $10.55. They also packaged them up nicely in a large take out container so we got them home in mint condition. The eat in area is really nice looking though, so this is definitely a place where you can relax and enjoy some coffee or tea and a nice pastry. If this place was closer, I think I'd go here every week. Be sure to visit if you're in the area!", "date": "2018-07-24 12:05:17", "user": {"name": "Courtney", "review_count": 547, "yelping_since": "2009-11-07 15:29:50", "elite": "2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20", "average_stars": 3.84, "fans": 65}}
{"review_id": "gC81nLCXgAmy3rbNeF-p7Q", "user_id": "o8fbYsa4qKZGea2y4H2wBg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is so pretty and SUCH a gem! All the desserts are amazing and coffee is great! They have crepes, tiramisu, cakes, sandwiches, and much more. Definitely coming back here again asap", "date": "2018-05-25 20:53:22", "user": {"name": "Sally", "review_count": 90, "yelping_since": "2013-05-16 18:10:43", "elite": "2019,20,20,2021", "average_stars": 4.88, "fans": 5}}
{"review_id": "h0Qsg4b8aIck3vdu1Fp-0w", "user_id": "KN-buQnAME-90bszLThpJQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "So after lunch my wife and I were craving something sweet and stumbled upon this little cafe off of Bustleton Avenue and we were quite pleased. The place is called Mondo Dei Dolci and I'm pretty sure it's Eastern European/Russian and it was very very good. The menu is simple with lots of choices of various sandwiches, crepes, cakes, breakfast, lattes, and etc. My wife and I ended up ordering a few cakes and the smoked salmon Benedict and an Americano coffee. The inside of the cafe is really nice and the service is great as well. The place is very children friendly and although it's not the biggest place it's big enough having a few tables and some couches with pillows making it very comfortable. The prices were also very good and just a very clean, friendly, and delicious place with good prices. I will definitely be back when I have that sweet craving for desserts without a doubt.", "date": "2018-05-14 05:03:48", "user": {"name": "Doctor", "review_count": 111, "yelping_since": "2014-05-01 12:03:53", "elite": "2017", "average_stars": 4.03, "fans": 4}}
{"review_id": "LuZEs6teZ7b-WBOY0727hQ", "user_id": "t-9s8xJms8SugxLNnSz4Ow", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Out of this world crepes.  Best desserts ever. I Only went for dessert but will return to sample some of the other menu items.  Nice place to go.", "date": "2018-05-14 03:49:31", "user": {"name": "Margaret", "review_count": 4, "yelping_since": "2014-01-25 18:38:51", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "B9QIkx2cpjJeUyqVpnd5fA", "user_id": "WHqJA3KlqPm-qVqCIP4_HA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The desserts are crazy good, the carrot cake is to die for and be chocolate cheesecake is delicious. It's not that expensive for how fancy it looks from the inside. Everything seems homemade as well", "date": "2018-04-21 02:02:22", "user": {"name": "Dennis", "review_count": 118, "yelping_since": "2017-12-22 17:58:45", "elite": "2018,2019,20,20,2021", "average_stars": 3.95, "fans": 9}}
{"review_id": "guHmjybYcHCG99sqBHH-Xw", "user_id": "RgeU3JYPzIbg3m3jfsdXUQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I came across this cafe when I was searching for crepes on yelp. After viewing some photos, I really wanted to give it a try. I did enjoy my lunch there on my first visit. I would say if you have a craving for dessert, here is a place to be. The cafe looks pretty clean and comfortable. Desserts weren't bad. Worth another visit!", "date": "2018-04-19 04:44:14", "user": {"name": "Cathy", "review_count": 52, "yelping_since": "2011-08-26 13:48:03", "elite": "2021", "average_stars": 4.0, "fans": 1}}
{"review_id": "eQHGpnMlwwC7jyoDTRpWcw", "user_id": "_DW77SkUCXdqrKoWsUDWcQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "What a cute little discovery. Cappuccino was amazing. We came for coffee and cake but they have a variety from sandwiches to sundae", "date": "2018-04-15 22:54:59", "user": {"name": "Carolynn", "review_count": 2, "yelping_since": "2017-07-23 01:01:33", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "pXvFR-lPAqa9CZmLDdzKxQ", "user_id": "YbDXduqWPcuWkODJJLNgXQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Beautiful place, what appeared to be beautiful desserts, but I guess they need a \"too dark to serve\" sign as people behind us were served, seated, and helped while we stood there waiting for someone to at least offer up a menu without us having to ask. \n\nThere are other bakeries in the area, no sweat off my back (or my wallet ).", "date": "2018-04-08 18:02:26", "user": {"name": "Gabrielle", "review_count": 1, "yelping_since": "2018-04-08 18:02:23", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "jPCZaql3-r0cZ6ZtnhR3eg", "user_id": "R5N-R4UHPGC5I0dbWisIqA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Beautiful looking with what looked like beautiful desserts.  I wouldn't know though because I'm Black, and we didn't even get spoken to.  Instead of seating us, they sat the couple behind us and pretended we weren't there.", "date": "2018-04-08 17:45:50", "user": {"name": "Mcdaniella1", "review_count": 2, "yelping_since": "2016-10-22 21:00:55", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "_ya3b1TMfMK8o2dLJIrCag", "user_id": "HAZShChw0VyLC63gbpkdaw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place has great food and great coffee. Pastries are out of this world. The people are always nice and willing to help you select the proper treat. You can't go wrong with anything in this place. Everything is good.", "date": "2018-03-25 19:18:58", "user": {"name": "Ruben", "review_count": 13, "yelping_since": "2012-11-29 01:27:47", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "nM1kP5uL0Fjl_4gCP9kKIw", "user_id": "JVY7EI44a7XXVVr-TBYsMA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This coffee shop/restaurant is a little slice of heaven. \n\nThe decor is very relaxing. You can bring your kids, but you can definitely bring your family/friends to detox and relax after a long workday. They have couches, if you want to relax with a cup of coffee or tea. \nThe service is always nice and friendly, they make outstanding coffee drinks, not to sweet unless you ask. \nThe food on the menu is made to order and alway fresh and delicious.", "date": "2018-03-03 17:17:12", "user": {"name": "Yvonne", "review_count": 85, "yelping_since": "2009-06-27 07:34:50", "elite": "", "average_stars": 4.07, "fans": 0}}
{"review_id": "3OgimwVq5QxSuMO_0D6zHg", "user_id": "n3aKJqRTJM8JjrFn_l6NwQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 26, "funny": 8, "cool": 15, "text": "Finally, finally a cafe that has a good selection of tea! \n\nThe shop is in a heavily Russian/ Former USSR nation populated area, so they know their clientele loves high quality European style, and they have certainly delivered. The interior is gorgeous and for such a small shop, is well designed to have plenty of seating and can even host crowds of 5+. It's also fairly comfortable and you have your selection of chairs, benches and couches. It's such a refreshing break from the usual hipster/ industrial look you get at coffee shops these days. \n\nBut what really sold me was the tea! Finally a great selection of teas! Not just Earl Grey and Green. They have herbal teas and fruit teas and lovely flavors too. The tea is loose leaf and not in a package as well!  \n\nWe didn't order food when I was there but they had a great brunch menu and lots of lovely pastries to snack on. They also make fresh smoothies. \n\nLoving this place and will probably become a regular.", "date": "2018-03-02 19:24:34", "user": {"name": "Katya", "review_count": 200, "yelping_since": "2014-12-12 16:02:50", "elite": "2017,2018,2019", "average_stars": 3.85, "fans": 63}}
{"review_id": "bjOZS8E7845wI8fergAR2g", "user_id": "_H03K-gpTE7OCnRA6cQuYQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "I like this grocery store. Good selection of items, not super crowded, lots of items are on sale, nice layout, friendly staff. Good location with a variety of other stores nearby", "date": "2018-01-30 18:32:23", "user": {"name": "Valentyn", "review_count": 5, "yelping_since": "2018-01-29 17:02:46", "elite": "", "average_stars": 4.6, "fans": 0}}
{"review_id": "0pkjUpAEkw8AICjlujiP6w", "user_id": "4J2w8TmP0r_iDcUP_lv_2w", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice been there twice the first time was for breakfast we had the eggs Benedict very good my wife had the waffle and my son had pancakes all great the second was for coffee and desert again very good not for the snobby anti Russian people in the area. If your open minded give a good", "date": "2018-01-27 23:56:26", "user": {"name": "Kenn", "review_count": 4, "yelping_since": "2018-01-27 23:56:22", "elite": "", "average_stars": 2.75, "fans": 0}}
{"review_id": "PJB8a2b4B4VK4b5LvRrwNA", "user_id": "j3tO-8IfrCJVCP3SmfrSPQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time at this cafe and I ordered the cappuccino, chicken soup and a chocolate eclair.  All was delicious!  I will be coming back soon.", "date": "2018-01-24 21:36:33", "user": {"name": "Teresa", "review_count": 8, "yelping_since": "2014-04-24 16:34:18", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "x0Fr9rbuQ_OyOhQlBJMrug", "user_id": "jWN-BgwCh210KzFUmDi53A", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "I came here because I was looking for some dessert choices for an in house meeting I was expecting to have. I didn't have the opportunity to sit down and have a coffee/pastry but I am definitely planning on coming back to do that. What a cute intimate coffee shop! \n\nA little on the pricey side but their desserts are phenomenal. Makes the price worth it. I was also able to take advantage of a 15% off coupon when I checked in. Yelp to the rescue :)", "date": "2018-01-13 14:46:43", "user": {"name": "Jency", "review_count": 104, "yelping_since": "2015-03-24 01:27:38", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.18, "fans": 10}}
{"review_id": "zg1cvRZL-K8MkzaPneXHAA", "user_id": "X4gYVBIXKv9F9XU5mTsJAw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Finally we got a perfect spot in NE Philly with great coffee and delicious food. I've tried almost everything on the menu and I can't even choose my favorite crepes (everything is so so yammy) Creamy mushroom soup is THE BEST for lunch!!! And of course their breakfast has a lot of options. And such a convenient hours and I can go on an on with only positive things about this place. Definitely will be coming back sometime soon", "date": "2017-11-16 01:39:02", "user": {"name": "Lana", "review_count": 5, "yelping_since": "2014-12-24 15:18:25", "elite": "", "average_stars": 5.0, "fans": 1}}
{"review_id": "L45c5CSZ29H7RhjTtSqoCw", "user_id": "JdEW9udsGIya1khDq8T3tQ", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "It is amazing coffee shop, bakery, and cafeteria! I always have a great time coming here. Large variety of coffee, pastries, they serve breakfast all day and cook French crepes as well! I would recommend this place to every body!!! It is a place where you can meet with friends or enjoy your cup of coffee along using WiFi! I use to do my homework here with my favorite caramel latte!", "date": "2017-11-15 21:37:22", "user": {"name": "Tatiana", "review_count": 6, "yelping_since": "2015-01-21 22:01:19", "elite": "", "average_stars": 4.29, "fans": 3}}
{"review_id": "GTROE8mLYei92fMGeuIlug", "user_id": "B1417mq1xechJ3TElfR3ag", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "So far I don't know how good or delicious this place is: we are still waiting for our 2 cups of coffee and two pieces of cake. When we asked what takes so long, we got explained that orders are being done one after another. It looks like they have one single burner in their kitchen.\nFood arrived. Cake is really good, coffee wasn't worth waiting. It is not Armenian coffee, excuse me.\nAs to conclude: if you have plenty of time, say, half of day to kill, go there. Otherwise opt for \"to go\". But keep in mind that place is tiny and with this snaily-sluggish​ service all sits will be already occupied.", "date": "2017-09-03 18:25:08", "user": {"name": "Elena", "review_count": 42, "yelping_since": "2011-12-25 19:14:51", "elite": "", "average_stars": 4.21, "fans": 0}}
{"review_id": "nQK7AjxxavYEkyHb8faHgw", "user_id": "HzEmzPSHcvCBUzf2d8cNRw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "The cafe has cozy and cute interior. But I wasn't impressed with the breakfast menu . I ordered eggs Benedict and was very disappointed. The coffee is disappointing as well. They have a big selection of pastry and cakes - I didn't try that. The service was friendly but I was the only person in the cafe and waited for my order for over 25 min", "date": "2017-09-03 13:39:11", "user": {"name": "Lidia", "review_count": 88, "yelping_since": "2011-08-18 18:10:08", "elite": "", "average_stars": 3.42, "fans": 1}}
{"review_id": "HV9Zso_I6SbN6kmhF50PBA", "user_id": "yDOioluEd5j7o8R04DP51w", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to have breakfast/brunch/lunch highly recommend the pancakes and crepesThere is limited space so the earlier you go the better opportunity to find a good seat!", "date": "2017-09-02 15:40:07", "user": {"name": "Jackie", "review_count": 4, "yelping_since": "2013-04-21 15:08:41", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "y2TUefTCIG28xlZsrMKJFw", "user_id": "5LonVS9rex0_Vr3RHtj2ng", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I will start with positive part first ! We had breakfast with my husband and my daughter, and ordered some juice blintz and omelets. My daughter got pastry . Waitress was nice , she brought her pastry 15 min later when my daughter ate it they brought her juice ( after she were already done ) then they brought my order and just fork for me first i got sweet dessert and after i got my omelet ( which is was pretty weird why order was backward) by the time i finished all my food my husband just got half of his order . So firs part of our date he was sitting looking at me eating second part i was waiting for him ( it took forever to get order ) we didnt wait for the rest of order that wasnt even ready . I would say i gave just two stars because food itself was tasty but the way they serve everything and how long it takes for them not worse it . How can i do it on my breaks or invite someone for business luch with this time of service?!", "date": "2017-09-01 16:45:36", "user": {"name": "Nell", "review_count": 2, "yelping_since": "2017-09-01 16:30:17", "elite": "", "average_stars": 1.5, "fans": 0}}
{"review_id": "NCUHHseUTh3PQ1z5bIgE_w", "user_id": "O4OFSjEpi_bQrJs0_nQ6sw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Best place to come with friends ,have a coffee and have nice a conversation in peaceful atmosphere .\nGood service and they have fresh cakes everyday.\nI will definitely come back", "date": "2017-08-31 18:51:13", "user": {"name": "Anara", "review_count": 9, "yelping_since": "2017-01-27 22:07:39", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "bdBFwVRsdsEectESUG3Q7g", "user_id": "xv8S0aDPFVMr6c0Ce4K5MA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The place is nice and cozy. They make really delicious paninies, especially the turkey one! And all the cakes are also delicious and beautifully presented.", "date": "2017-08-01 19:24:17", "user": {"name": "Anastasiia", "review_count": 2, "yelping_since": "2016-12-26 23:07:32", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "g7-24tbULBnScWcAAxmDnw", "user_id": "PV5L3t2zaEBYAKCTUYeiPg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cute yet extravagant place. A few tables and couches. Great prices for quality desert and coffee. Crapes were good, too. I wouldn't call this a hangout cafe at all, but a great place to treat yourself.", "date": "2017-06-16 18:45:05", "user": {"name": "Michael", "review_count": 28, "yelping_since": "2007-04-30 17:01:18", "elite": "", "average_stars": 4.46, "fans": 0}}
{"review_id": "y5kdzoeH123aEWWnxcVLNw", "user_id": "1Tt_kBq5Z-cArXkXosHzFA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Cute, decent size, clean cafe. The cup for the cappuccino was huge. The crepes were delicious as well as the circular strawberry cheesecake. The cream cheese in the crepe was amazing! The European chocolate drizzle was a nice touch as well. Compared to the crepes at ihop, I will never order crepes from ihop again. This cafe has the legit ingredients in their food! For an order of two cappuccinos, one strawberry cheesecake, one crepe, and a waffle it came to $24. It's not like I'm going to be going there once a week due to the pricing, but for a decent treat to myself, I'll definitely be back.", "date": "2017-06-03 17:38:00", "user": {"name": "Jo", "review_count": 53, "yelping_since": "2014-04-20 18:41:56", "elite": "", "average_stars": 3.66, "fans": 0}}
{"review_id": "1WqVlcOKTq1E7VgJDkPUFQ", "user_id": "OIaX_WTVzRL_rqr12FPFSw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 1.0, "useful": 7, "funny": 3, "cool": 2, "text": "I stopped by this coffee shop on Saturday when I was jonesing a pastry.  It's a cute little shop, with a decent dessert selection,  La Colombe coffee and an nice seating area.\n\nWhen my party of two arrived there were only a handful of people inside.  I was immediately drawn in by the dessert counter but to my surprise there was no one behind the counter.  We waited a few minutes and mulled over our dessert choices while waiting.  More time had passed and still no cashier.  After about a 10 minute wait I decided to try calling the store number.  The phone rang and rang....and rang.  We gave up after almost 15 minutes of waiting.  \n\nI don't think I will be coming here again anytime soon!", "date": "2017-05-15 19:06:40", "user": {"name": "Shannon", "review_count": 348, "yelping_since": "2015-02-10 20:02:30", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.65, "fans": 46}}
{"review_id": "yFOlvI4mkbtA1yQ-5hBJKA", "user_id": "hvpD3st0ZOA72FKQ5adn3w", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere, welcoming staff and cafe has a clean and relaxing vibe. No wifi unfortunately. The food is quickly served from experience but isn't the best that Iv had.", "date": "2017-05-01 21:38:15", "user": {"name": "Jack", "review_count": 7, "yelping_since": "2016-03-23 19:55:14", "elite": "", "average_stars": 3.63, "fans": 0}}
{"review_id": "DlqrqVBWigSqNG8Dscz74Q", "user_id": "T57CqtZK-Dc3vlnLb4wLmg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you are looking for a great place for  dessert this is the place to go.... Many deserts to choose from.. I got the Trilogy with Expresso to go...", "date": "2017-04-15 01:14:23", "user": {"name": "Andy", "review_count": 68, "yelping_since": "2017-02-24 04:15:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "RLZk4nin2wJexU-iIO9PHA", "user_id": "8eEe_ormN8Wxfs_LpMZqFA", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 2.0, "useful": 4, "funny": 0, "cool": 0, "text": "Very strange place. Dessert looked old. Pretty ambiance but it was roasting and they are serving hot tea and coffee (??). They should have had the air on. It seems like a favorite for the Russian population and I can appreciate and understand that. The two girls working there seemed Russian and most of the customers were. They served Russian \"empanadas\" of sorts with meat or potatoes. We won't return.", "date": "2017-04-09 21:59:35", "user": {"name": "Kathleen", "review_count": 72, "yelping_since": "2009-08-13 13:31:22", "elite": "", "average_stars": 2.87, "fans": 2}}
{"review_id": "2Wi-Hd0LwDimAS5lqwv0aw", "user_id": "39q3netnh14e1wvn7_2Uwg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "It is a cozy place, delicious crepe, I had one with Nutella and banana in it, it tasted heavenly", "date": "2017-03-28 04:55:58", "user": {"name": "CH", "review_count": 4, "yelping_since": "2016-12-01 19:40:57", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "gxQvoIejOg27_4hizlS14g", "user_id": "CZ7qhEHjfIh6M7sjftvyHg", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "We finally got a new nice European type cafe in NE of Philly.\nWe love going there. Coffee is great, all pastries are home made!!! Delicious! Come and check that out.", "date": "2017-03-07 17:45:33", "user": {"name": "Alina", "review_count": 6, "yelping_since": "2016-04-27 02:15:52", "elite": "", "average_stars": 3.29, "fans": 0}}
{"review_id": "6PLwAl-IfdorfMKjl8rHjg", "user_id": "DUcyAtrI0uWfYvVazDeW2w", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was AMAZING!!! So I have never tasted anything so delicious, the pastry, the espresso, YAM! What a clean and beautiful place! Staff are absolute sweethearts! Good for them!", "date": "2017-03-03 16:09:36", "user": {"name": "James", "review_count": 19, "yelping_since": "2016-04-07 05:06:53", "elite": "", "average_stars": 4.81, "fans": 0}}
{"review_id": "jHB_c9dJmOHcEwdGAgOxMg", "user_id": "sJYv9Cr-qY0Nvqf3PmEKgw", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love this place! They have the best desserts, and pastries! The coffee here is amazing! I recommended this place to many of my friends/family and they love it as well!", "date": "2017-02-10 18:24:02", "user": {"name": "Sonya", "review_count": 2, "yelping_since": "2015-10-30 05:03:23", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "I_GmiVSvUX4djGZG68qbyA", "user_id": "5m-AjvUnjJA_w_OuXgRr5A", "business_id": "7jYC4dxkoiAULgENY7hbMA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Place is beautiful, seating and layout is awesome!!!\nDefinitely check it out, everything is awesome, nothing to complain", "date": "2017-02-10 04:44:48", "user": {"name": "Leonard", "review_count": 27, "yelping_since": "2016-11-14 04:56:24", "elite": "", "average_stars": 4.37, "fans": 0}}
