{"business_id": "a-dPw0ISYHoxMmWgd4mK-g", "name": "Starbucks", "address": "347 South Street", "city": "Philadelphia", "state": "PA", "postal_code": "19147", "latitude": 39.941685, "longitude": -75.149059, "stars": 3.0, "review_count": 50, "is_open": 0, "attributes": {"BikeParking": "True", "BusinessAcceptsCreditCards": "True", "OutdoorSeating": "False", "RestaurantsTakeOut": "True", "RestaurantsPriceRange2": "1", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "WiFi": "u'free'", "Caters": "True"}, "categories": "Food, Coffee & Tea", "hours": {"Monday": "5:0-22:0", "Tuesday": "5:0-22:0", "Wednesday": "5:0-22:0", "Thursday": "5:0-22:0", "Friday": "5:0-0:0", "Saturday": "5:30-0:0", "Sunday": "5:30-15:0"}, "category_list": ["Food", "Coffee & Tea"], "stratification_tag": "Coffee & Tea"}
{"review_id": "oChYiEpjvBRGpt1sZ3t2Pg", "user_id": "T4ZkmEOB4f_aZOwZdVb8zg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I created this account just to write this review, Becca is the unfriendliest person I've ever met. She should never have a job where she would have to interact with anyone. Talked down to staff and customers. Never will I go back if she is working here.", "date": "2018-10-20 17:04:15", "user": {"name": "Caleb", "review_count": 3, "yelping_since": "2018-10-20 17:01:05", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "2ULjBMUnxPqP3G0OrLcTSg", "user_id": "1x2nLYqAWFHIzXSYQc5oIw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was the first Starbucks I have ever been to. I had no clue on how to order, so my friend helped me. Needless to say I've probably have had it 2 more times and never by myself because I still don't know how to order. I've never been big on coffee and I wanted to try it for the experience. I got a cold drink (can't remover what it was exactly). It taste good, more expensive than DD. The girl taking more order was helpful. I never knew there was so many different ways a coffee can come. It would be nice if they made a menu for occasional coffee drinkers. I feel like their seasonal drinks are easier to order.", "date": "2018-08-31 17:27:46", "user": {"name": "Michelle", "review_count": 144, "yelping_since": "2015-01-12 18:32:13", "elite": "2018,2019,20,20,2021", "average_stars": 3.65, "fans": 0}}
{"review_id": "lIVvPT5OX_ZoMyJo-JHzJQ", "user_id": "WPbN4-XG4GFqwdJSsR06vg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very ticked off.... drove around for 30+ minutes to find parking only to walk into Starbucks, only a few patrons. Ordered the Mango Dragonfruit drink only to be told it couldn't be made. When asking if the upstairs was crowded, was then told the upstairs was closed for \"game night\"??????\n\nWHAT THE HECK IS GAME NIGHT?\n\nNot even the courtesy of a sign posted on the door to share this information with the public. This is poor customer service for an establishment like Starbucks.", "date": "2018-08-02 23:31:31", "user": {"name": "Amanda", "review_count": 6, "yelping_since": "2011-06-20 15:37:08", "elite": "", "average_stars": 4.0, "fans": 2}}
{"review_id": "mRkgkSifHcW8qFOvo8esfA", "user_id": "HvFrPcEX-Vjqo1N2mPFB3g", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "No decaf, no sugar in the raw or syrup, trash cans over flowing at 11am.  Didnt call when order was ready.  Not impressed.", "date": "2018-06-17 14:57:23", "user": {"name": "Susan", "review_count": 10, "yelping_since": "2013-04-05 17:04:44", "elite": "", "average_stars": 2.5, "fans": 0}}
{"review_id": "8kgIHnuuvz0zjbksVRc5vg", "user_id": "txTkPEZ_Nt7ZSKxeTyW__g", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "The a.m. staff is my favorite. Super friendly people and good to see them every morning", "date": "2018-05-12 03:20:28", "user": {"name": "Stephanie", "review_count": 4, "yelping_since": "2015-08-24 20:49:08", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "slRER71hVUCPAdKZn-vj6g", "user_id": "T6TInNEhz-qm5tT_ZjQEoA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 2, "text": "I'm not sure why Starbucks gets so much bad publicity and poor reviews!  Guessing it's the sheer size and magnitude of a corporation and haters gonna hate.\n\nWell, if you weren't surprised I love Starbucks and I'm a huge fan of founder and CEO Howard Schultz and the work and ethics that go into his company.\n\nImo the coffee is very good, the service is usually very friendly and astute and the app is a game changer. \n\nBeing able to order ahead at a million locations and have your tasty beverage awaiting your arrival and skip the long lines is amazing! \n\nAlso, you earn rewards towards future tasty beverages yay.\n\nAlso, Starbucks offers heavy cream as an option for those of us on low carb diets and also all natural, low carb sweetener.\n\nStop the madness and rate fairly please.\n\nThanks for stopping by :)", "date": "2018-03-18 20:27:51", "user": {"name": "Marcel", "review_count": 157, "yelping_since": "2010-02-14 02:09:36", "elite": "2018,2019,20,20,2021", "average_stars": 4.06, "fans": 23}}
{"review_id": "c8BSM18TBRpRg8Dy8hhKeg", "user_id": "eWFkABNBwFpwzNEUo_sb2g", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "This Starbucks is awesome. Great place to warm up in and grab a wonderful drink in the south Street strip. The bathroom was very clean just make sure you grab the bathroom code from the staff so that you can get in. There is a ton of seating upstairs so do not mistaken the downstairs as the only thing lace to sit or you will miss out on the birds eye view of south street. It is a great spot to sit down and work from a laptop or to read a book. It is not too loud and there is quite a few places where you can get some juice for your laptop or your phone. It really is affordable to grab a coffee or tea as with Gold membership you get free refills and if you are not a gold member you still get free refills on tea or coffee for only $.50. I have been impressed with all their holiday drink recipes and the food is always fresh and they have seasonal options.", "date": "2018-01-07 05:21:01", "user": {"name": "Michael", "review_count": 26, "yelping_since": "2017-03-12 09:54:02", "elite": "2018", "average_stars": 4.54, "fans": 2}}
{"review_id": "7v6nujkz8fe0GBjHpuXcVg", "user_id": "lazq478lkVbd5d29gKWAeg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 1, "funny": 2, "cool": 0, "text": "Really? In 2017, are we really denying pregnant women access to public restrooms? And at a Starbucks no less?\n\nMy wife is 30 weeks pregnant and was seeking relief after a fair amount of eating, drinking, and walking along South Street.\n\nShe walked into the Starbucks at around 8:00pm and asked for a venti cup of ice water and the restroom key. The barista (a white male) told her restrooms were for paying customers only. She showed her belly and explained that being pregnant she really needed to use the restroom and he told her there was nothing he could do because it was store policy.\n\nMy wife walked out visibly shaken and told me what happened. I walked in with her and asked for clarification about the store policy. I've never known any other Starbucks to do this. I was told by the same barista that there was nothing they could do and they reiterated the store policy, saying it was a \"Philly Starbucks policy\".\n\nI told them that was ridiculous and asked if corporate was aware. Another employee (a white female) stepped up and told me that the reason they have this policy in place is because it is a \"safety issue\". My wife and I looked at her perplexed, so she continued explaining, saying that they let people use the bathroom and they end up shooting heroin and there's been an uptick in crime.\n\nThis made me livid... I asked if she really thinks my pregnant wife is coming in their bathroom to shoot heroin and she just kept repeating it's a safety issue.\n\nFed up, I said that I would be calling corporate to complain. She laughed and said I could go ahead and call corporate because they are the ones who made the policy and give them direction. I asked her for her name and she said she was not required to give it to me. I asked the other two employees and they also refused to give me their name saying they are not required to do so.\n\nFrustrated, I said, that I would take a venti Cafe mocha and the restroom key. I figured policy aside, my wife needed to use the bathroom so I'll just buy something. The female employee said that she is choosing to refuse me service and that I need to leave the store or she would call the police.\n\nShocked by her brash reactions and the fact that the other two staff seemed to think this entire exchange was funny, I said this whole thing was crazy and headed out the door. As I was walking out, the female employee cursed at me saying, \"have a great f'ing day\". I walked back in and asked what she said and she kept threatening to call the police if I didn't leave. I took out my phone and snapped a picture of them (see attached).\n\nI called corporate to complain about the situation and they indicated they would follow up with me. \n\nAll in all, I am incredibly disappointed in this particular location and the workers here. They were rude, condescending, and took every opportunity to insult and demean us. And given that the three employees and the few customers in the store at the time were all white and we are black, l can't help but conclude that race played a factor here.\n\nWe spend entirely too much money on a daily basis at Starbucks to warrant this kind of treatment. And given their location on South Street (which gets busy at times), I can understand a customers-only policy, but they should consider expanding that to pregnant women and also people who are regular Starbucks customers. They should also evaluate individual circumstances and make informed, solutions-oriented decisions. \n\nVery disappointed. I look forward to a more detailed response from management/corporate.", "date": "2017-12-23 06:45:47", "user": {"name": "Gerren", "review_count": 21, "yelping_since": "2014-01-06 20:16:14", "elite": "", "average_stars": 3.48, "fans": 0}}
{"review_id": "2QQhPkZ1xLyv1a8_hdCgoQ", "user_id": "wgiVsn5ZtsxULQb2K2gioA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "This Starbucks is decent, not the best or worst I've been too. It's mostly clean considering how much foot traffic there is. The baristas are nice. There's extra seating upstairs, only one bathroom, which considering how large the Starbucks is - it stinks. My coffee was okay, nothing spectacular. I asked for lite ice but they didn't really give me lite. Overall it's convenient if you're in the area.", "date": "2017-05-08 00:46:55", "user": {"name": "Courtney", "review_count": 502, "yelping_since": "2014-03-21 20:05:06", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.69, "fans": 17}}
{"review_id": "wUuzuqZmwcZ4u3c_S75tjA", "user_id": "1kVjDa0lupEe5uhnj28sdw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "I went in here to order a beverage but the line was so long and the employee was moving at snail speed so I walked out. Will not be returning.", "date": "2016-08-13 00:45:34", "user": {"name": "Cynthia", "review_count": 559, "yelping_since": "2011-02-23 04:17:34", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.53, "fans": 12}}
{"review_id": "rVFIukbRP61UFuJd-TpawQ", "user_id": "HEQ_IqHGQ30a_90Gz_hRZw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "This Starbucks was a quick pit-stop on the way out of Philadelphia to head back to DC. Not only is this a gorgeous location if you're considering going for the wifi and to do work, but the employees here are quick and friendly. We were very happy with our experience here, and I'd absolutely go back the next time I'm in Philadelphia. \n\nAlso, parking was easy. Let's be honest, in any major city parking has to factor into the rating of an establishment. Well, way to go this Starbucks! You're great with that. Street parking nearby, and we were leaving on a Monday morning at like 10. So there should have been lots of people trying to park, or so I'd expected. BUT the parking gods were on our side!\n\nAll in all, a beautiful and accessible Starbucks location in a fun, vibrant part of the city.", "date": "2016-07-03 12:48:53", "user": {"name": "Jamie", "review_count": 150, "yelping_since": "2011-01-09 18:14:38", "elite": "2014,2015", "average_stars": 3.82, "fans": 8}}
{"review_id": "oQ3W_6q0sCiRdx0OOzX-sg", "user_id": "2IhBXOOrK3RMck1YWXyiWA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 3, "cool": 1, "text": "So today during my lunch break around 12:40 I went and joined my friend to walk her to Starbucks and she was ordering her ice coffee and we went to the end and got the coffee, and she tasted it and it was very bitter and had no milk and wasn't sweet enough so she's getting sugar so the barista says do you want more sweetener \" it already has 6 pumps\" and she didn't hear him so he's tapping his fingers on the coffee machine and while he was doing that he was like \"take the lid off \" tap tap tap \"take the lid off\" tap tap tap very inpatient and mind you there was only one other person waiting for a drink and Starbucks is usually so friendly I was in shocked like if you don't like your job find another one", "date": "2016-07-01 06:37:55", "user": {"name": "Ana", "review_count": 24, "yelping_since": "2016-05-12 14:12:00", "elite": "", "average_stars": 3.39, "fans": 0}}
{"review_id": "ef0ucoLGGZI0QaOU6_Bl1w", "user_id": "1QEZnD-6L-k63savOkxW2w", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 2.0, "useful": 0, "funny": 1, "cool": 0, "text": "Horrible customer service from a girl with short bleach blonde hair and piercings in her face. It was hard to even to even wait for my drink.", "date": "2016-04-25 18:22:06", "user": {"name": "Jessica", "review_count": 8, "yelping_since": "2016-04-25 18:19:34", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "McRg9bIqhCIbgXD7ErTDfQ", "user_id": "NdYQt5UAb-b5U7WNGowDgQ", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I wasn't going to write a review but this has happened a couple of times already.  By and large, the baristas here are really nice.  They always have my order ready and they are just generally great people.  But there is one European dude who is not nice at all.  And when he is working, my online order doesn't get filled and he is really indignant about it. I mean, I don't expect technology to be 100%, but when I tell you I ordered online and you scream \"NO!\"  like I'm lying, that is offensive.  Especially since I order here damn near everyday.\n\nI still give the place 4 stars because it's overall great.  I live down the street so I can't comment on the bathroom, that seems to be a major theme here.", "date": "2016-02-15 14:13:05", "user": {"name": "Kathlene", "review_count": 49, "yelping_since": "2009-04-22 18:55:36", "elite": "", "average_stars": 3.15, "fans": 3}}
{"review_id": "Ob8kskoilJeUwK-421ylwg", "user_id": "Motfi3V_QrUMnphOcfr8GA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "This place is ridiculous. You have to ask for a key to the restroom. Like a gas station. They might as well tear it down and build an Exxon. The coffee was the same quality.", "date": "2015-12-13 00:25:55", "user": {"name": "Tom", "review_count": 3, "yelping_since": "2013-09-09 19:27:25", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "E-su40-7XHM0iox2QxfBew", "user_id": "5GLB61xLOP6T-pNsr7rslg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty good Starbucks despite the sometimes questionable location. I never know with south st..you either find a gem or you come across crazies.\n\nThe staff here are very nice in the mornings, so I can't vouch for the later times.\nThey're friendly and professional and the wait is not bad compared to other Starbucks locations. They also make my drinks right.\nParking is a hit or miss but in the mornings it's no problem !", "date": "2015-11-19 12:45:14", "user": {"name": "Faye", "review_count": 341, "yelping_since": "2011-02-07 23:29:18", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.31, "fans": 43}}
{"review_id": "_emwvK2L6TXSaLnbzOo23Q", "user_id": "OTy0y0OX1q8_kRxjyJ-5mw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cashier was unenthusiastic and dull. Slightly rude. But they had the Philadelphia mugs which was a huge plus considering we only came into that Starbucks for the mugs.", "date": "2015-08-17 03:56:22", "user": {"name": "C", "review_count": 96, "yelping_since": "2014-02-16 00:49:38", "elite": "", "average_stars": 3.22, "fans": 4}}
{"review_id": "rc38tseaJ2Mlfdd1IughCg", "user_id": "NHQrYpzT9pmXy9klzn5DRg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "At The Starbucks on 4th and South streets, the BARISTAS are a great group of people. They have to deal with so many different types of people(some of whom are very rowdy) and the baristas are always nice. The company has spent so much wasted money on putting locks on the doors that require combinations. The money would have been better spent  for  the baristas' pay. No one is refused entry to the bathroom. That's humane. So, why the locks? There is one thing that I do not like is that this is the busiest STARBUCKS for bathroom needs(especially people who are not customers). Each other starbucks has TWO bathrooms. This one, one of the busiest, opens only ONE of the two that exist in the café. Opening the upstairs bathroom would facilitate the use by the real customers who have made purchases.", "date": "2015-07-10 23:14:23", "user": {"name": "Francis", "review_count": 30, "yelping_since": "2015-04-02 18:14:37", "elite": "", "average_stars": 2.77, "fans": 0}}
{"review_id": "HcK0ubWgG23cE5JNDBXoLQ", "user_id": "M6lYbYEL66cyL7ssHBGD7A", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 1, "funny": 1, "cool": 0, "text": "While I was waiting for my order, I had to listen to a debacle amongst guests who didn't like that the bathroom had a passcode, and you had to ask the barista for it.  Was strange.  I don't care about a passcode if it keeps it clean enough, and it lessens the chance of someone ODing in there, but that's just me sayin'.\n\nUpstairs is cozy.  Grab a seat by the windows and people watch while you sip your coffrapamochacinolattea.", "date": "2015-05-14 21:41:20", "user": {"name": "Charlene", "review_count": 62, "yelping_since": "2013-04-10 11:24:29", "elite": "2015,2016", "average_stars": 3.73, "fans": 5}}
{"review_id": "2Ng8jsCsKQWq_QJYQfKxVg", "user_id": "sFqImuZBqT43URa3kMcC4w", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 3, "funny": 2, "cool": 0, "text": "To some this review may seem like nitpicking but I stand by it. My go to drink is Americanos. I get them just about everywhere, typically iced. When you make an iced Americano it's important to put the ice in the cup first and then pour the piping hot expresso overtop. If you don't do this you have a hot liquid in a plastic cup made for cold liquids. When you put hot liquids into these types of plastics there is a high probability the plastic is going to release chemicals into the drink that will do God knows what to you. \n\n\nI've been to this starbucks twice, both times they made it adding ice after. Both times I didn't say anything because I don't want to sound like a D but to date I've wasted $6.50 because I'm not drinking that ish. Try to poison me once shame on you. Try to poison me twice, shame on me. I'm being over dramatic but for real doe, I'm not going back.", "date": "2015-03-21 16:02:16", "user": {"name": "Noah", "review_count": 170, "yelping_since": "2008-09-27 21:40:27", "elite": "2012,2013,2014,2015", "average_stars": 3.58, "fans": 23}}
{"review_id": "mQRc1jMa_vpLpxzSYPJwyQ", "user_id": "NOI4oOTV1R56MHsY_HTfag", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "As a gold card holder, I LOVE Starbucks coffee! I live near this location, so I've waited to write this review to make sure that nearly every experience I've had sucked. Well, it has. This is the WORST Starbucks I have EVER been to! Their service is absolutely terrible, unable to handle one customer, let alone a line with (oh my gosh) 2-4 people in it.  They only ever have pike place brewing, and the one time I opted to wait for a pour over, it took what felt like forever and my car was ticketed. Today, they ran out of pike place, and instead of giving me an immediate refund so I could be on my way, the girl behind the counter was flirting with her co-workers and diddly farting around behind the counter. I had to ask for her attention for my lousy refund! Anyone, Bueller? I can safely say that after countless bad experiences I will not be returning to this Starbucks.  If you're reading this, you know that Starbucks is on top of their game normally, this is not what you would expect.  Even if you're just walking by on South street, be prepared to wait and for them to be out of what you want. They were out of caramel macchiato's and coffee today, how does that even happen?? Shame on you, Starbucks! This location SUCKS!", "date": "2014-12-12 19:45:02", "user": {"name": "Alanna", "review_count": 12, "yelping_since": "2011-12-04 22:16:11", "elite": "", "average_stars": 2.92, "fans": 0}}
{"review_id": "dthMh0_D3wmkmQNy64awOA", "user_id": "KbLfnuqdsaIq8lB7vhwAVg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great location! I came to this location when I was seeing a show across at the TLA. It is right across the street and I enjoyed getting a drink to warm up. It is just your typical starbucks, assuming that you know about Starbucks. They have a variety of lattes, coffees, teas, and pastries. They sell cute cups and other small merchandise items which can come in hand if you have a last minute gift to grab. Best of all about this location is their public bathroom. Another perk of being right across from the TLA. After a few hours in that line a bathroom is essential! Plus, when I was waiting in line for the bathroom (just one stall) I was able to chat with a few of the members of one of the band I was seeing that night! Great experience and I have the selfies to prove it. Again, this is just a normal starbucks in a great location. The staff spelled my name correctly on my cup too!", "date": "2014-12-04 02:37:37", "user": {"name": "Anne", "review_count": 775, "yelping_since": "2011-05-02 17:03:44", "elite": "2014,2018,2019,20,20,2021", "average_stars": 4.23, "fans": 687}}
{"review_id": "TkInDlAC-iGO9qny9kD90A", "user_id": "eR1R8fMejHoexVWhRJ8rug", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went in around 330pm on a Sunday, the place was pretty dirty and they had hardly any pastries left. Perhaps they were just rushed but I doubt it since there were only two other guests inside. However The baristas were very friendly and my coffee taste just like all the other Starbucks I have been too. If it would have had food then I would be rating it a 4", "date": "2014-07-15 11:04:28", "user": {"name": "BethAnne", "review_count": 6, "yelping_since": "2014-06-26 22:03:07", "elite": "", "average_stars": 3.83, "fans": 1}}
{"review_id": "aTUGVgjts8vcE13qCzsqnQ", "user_id": "3JqQXfJfLnE83LVtCpUYYg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "3 stars because the service here is dismal at best. I've been to this location more than 10 times because 8th very close to my apartment but if I have the time I head west 6 blocks to the next closest location.  \nNo matter what you order or how many people are in front of you you will wait at least 5 minutes for a very simple drink (ie black coffee) and if it's busy I've waited up to 15 minutes. Normally I'd walk out but when I'm craving iced coffee magic the more hip local establishments fail miserably every time. \nThe only saving grace to this location is the upstairs area, which is bright, with a good view of South St for people wqtching, and has a lot of seating and tables to read relax or do work.", "date": "2014-06-03 16:26:09", "user": {"name": "Rachel", "review_count": 5, "yelping_since": "2014-04-21 00:28:57", "elite": "", "average_stars": 4.6, "fans": 0}}
{"review_id": "ZkhPHWfrEWSJdnaXxFZ7Cg", "user_id": "Y1ofWWHWYOclROg7m9pf8A", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Arguably the worst Starbucks I have ever visited. Unfriendly baristas, very slow service, and dirty throughout. Do not recommend.", "date": "2014-05-17 19:03:01", "user": {"name": "Emily", "review_count": 5, "yelping_since": "2013-10-11 23:43:19", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "P3OLmZwspCUe4ZrEq3anUw", "user_id": "hTEKSL52x8cUUlHpUEx4lw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 3, "funny": 1, "cool": 2, "text": "\"Now, this is your first lesson in coffee. Without anything in it, it's black coffee. Can you say black coffee? Then, there's coffee regular. That means two sugars and milk, which they have forgotten, so can I borrow some of yours? Ah, coffee regular.\" -- Look Who's Talking (1989)\n\nWhat a great little Starbucks - and I mean little. We walked in after eating across the street and were in need of a cup of coffee and a sweet snack for dessert.  We ordered and then looked around and realized there was no place to sit - at all... then the young lady behind the counter said there was more seating upstairs... what?\n\nWow - we took our coffees and snacks upstairs and had a great space to sit and chat for an hour until it was time to close the upstairs for the night.\n\nThe service was good, the drinks were prepared properly and the overall atmosphere was nice.  Also, it was quiet, but it was also at night - so not a true test.", "date": "2014-04-25 01:23:16", "user": {"name": "Lindy", "review_count": 1029, "yelping_since": "2007-12-12 14:49:19", "elite": "2008,2009,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.82, "fans": 186}}
{"review_id": "w2FqapXhW0YEUzIPTmf0LA", "user_id": "ASqQL6lqs-k45voglB3PTA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "A simple espresso over ice took 10 minutes. I was the only one waiting for a drink. Strange. Not sure what was happening.", "date": "2014-04-08 21:15:55", "user": {"name": "Matthew", "review_count": 7, "yelping_since": "2013-04-30 23:17:10", "elite": "", "average_stars": 2.71, "fans": 0}}
{"review_id": "6uE4JfX0OUJENE_V57QdNw", "user_id": "EQpFHqGT9Tk6YSwORTtwpg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "A lot of seating...Cool upstairs spot for studying, internet-ing, or South Street people watching from the second floor. I can sit here for days...if I can find parking. haha", "date": "2014-03-06 16:24:18", "user": {"name": "Alex", "review_count": 731, "yelping_since": "2012-07-08 20:24:04", "elite": "", "average_stars": 3.96, "fans": 58}}
{"review_id": "3RERApMjWI3T2_SaJeLVrw", "user_id": "WS1E9U-iCT7G3w0_MDJv9A", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Picked me up a double shot, had great service, one of the finer Starbucks I've visited to date ;) #stardizzle", "date": "2014-01-24 21:31:32", "user": {"name": "Ken", "review_count": 42, "yelping_since": "2014-01-22 21:07:28", "elite": "", "average_stars": 4.61, "fans": 0}}
{"review_id": "VGX64BwycAat8OxOkSHEGg", "user_id": "REFGsoLynoBWxdTEJeXYfw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Found myself on South Street and needing coffee, so stopped into this Starbucks. It's pretty much like most Starbucks I go into. The line tends to move a little slowly but the latte was good and overpriced in typical Starbucks fashion. The condiment station was a little messy and could have used a little attending to.", "date": "2014-01-18 15:10:34", "user": {"name": "Greg", "review_count": 918, "yelping_since": "2009-05-23 03:26:20", "elite": "2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.34, "fans": 26}}
{"review_id": "UlMQrSRKS15eLkIh1-WhNQ", "user_id": "iul6_z-zKaohHyz4XlYI9w", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "It was 5:15am, pouring down rain and freezing cold when I was trying to catch a cab on South Street. There were none and I was standing under the Starbucks awning for a few minutes when an employee opened the door and told me I could wait inside for my cab to arrive, even though they weren't open. It was so nice and thoughtful. I'll continue going there on my way to work :)", "date": "2013-11-27 17:05:44", "user": {"name": "Elaina", "review_count": 2, "yelping_since": "2013-02-06 05:28:36", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "AegzZvTeKxJFtYjc4UXmIw", "user_id": "ey5tvSRod9Hsor_fw_jCEg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Settle down everybody.   It's a Starbucks.   We get it.   You hate corporate coffee.  \n\nAs far as Starbucks goes, this place is now part of my morning routine.    It's pretty simple.   I want coffee.   They have good coffee.   And the morning crew knows their regulars, knows their usual orders, are pleasant and attentive to everyone, and manage to crack a few jokes in the process.", "date": "2013-11-05 14:21:52", "user": {"name": "Vince", "review_count": 84, "yelping_since": "2009-08-03 14:04:50", "elite": "", "average_stars": 3.83, "fans": 1}}
{"review_id": "JQyqQy-_m5YeOUpR3OO4ow", "user_id": "Q5aU9yAxTEeoE4M4BGzCxw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The service was alright; nothing to write home about, but this review mostly deals with the upkeep of the shop. I was here on a Saturday evening when it was not busy. There was one couple sitting on one of the tables and the three male employees in behind the counter. The shop looked like it had not been cleaned all day. The bathroom was dirty and there was no toilet paper available. The counter was sticky and dirty. I have never been in a Starbucks so unkept before.", "date": "2012-10-31 20:10:56", "user": {"name": "Berta", "review_count": 36, "yelping_since": "2010-08-23 13:30:11", "elite": "", "average_stars": 2.61, "fans": 3}}
{"review_id": "LCbczWv8OmBnbcGxaE10lg", "user_id": "d67zTET_2IuVoWcUU0aWaQ", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 2.0, "useful": 1, "funny": 1, "cool": 0, "text": "This Starbucks is located directly across from Jim's.  Jim's was pretty crowded so we decided to head over to Starbucks, grabbed a drink there, and sat down to eat our Jim's sandwiches here.  BIG MISTAKE.  This Starbucks is the motherland for flies. It was disgusting!!! Instead of enjoying my sandwich, I was fighting off more than a dozen flies. I don't know why this place has so many flies. Even Jim's did not have any flies and their doors are always open due to the long lines!\n\nFor coffee drink purposes, this Starbucks is great. Service was fast and my drink was good.  But if you want to sit and rest, think twice!!!", "date": "2012-10-19 23:10:03", "user": {"name": "Janet", "review_count": 2241, "yelping_since": "2008-12-27 19:38:12", "elite": "2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.04, "fans": 217}}
{"review_id": "NIKHwjKmrzgX1h7xfS1kEw", "user_id": "FQ-zmWPEG_pjSQx6pt3Efw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I frequent this Starbucks about 3x a week and I have to say the staff always greet me and take an active interest in conversation. The service is very fast and my drinks have been prepared correctly. I enjoy the South Street atmosphere. It's only downfall is at times, the seating can be limited and being physically disabled, stairs are not my friend. The other thing is the bathroom, there is a forever wait and it's disgusting. Aside from those two factors, I love it there!", "date": "2012-08-05 13:20:23", "user": {"name": "Jimmie", "review_count": 293, "yelping_since": "2009-11-20 17:23:00", "elite": "", "average_stars": 3.9, "fans": 9}}
{"review_id": "t74arNfBvmZLD_Cn39imww", "user_id": "rDy5a0ZIYxVuShBzX96jYQ", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Stopped in later in the night. The service was fast and the people were very friendly. I didn't spend too much time in the place, and wouldn't typically write a review without more details; however, I got great service and wanted to boast about it.\n\nMy review (4 out of 5 stars) is based solely on the customer service I experienced.\n\nThe drinks were typical Starbucks fashion, nothing great or different.", "date": "2012-07-27 21:08:53", "user": {"name": "Louis", "review_count": 75, "yelping_since": "2012-01-11 13:40:11", "elite": "2013,2014", "average_stars": 3.49, "fans": 6}}
{"review_id": "WQzNx3bNJr_UkzIbMuLenw", "user_id": "ZptGk-V-K-jWNm0O18PuQw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The standard for which I judge all others. Yes, I'm a code snob.", "date": "2012-07-25 06:24:49", "user": {"name": "Mike", "review_count": 50, "yelping_since": "2011-04-25 21:05:09", "elite": "", "average_stars": 4.27, "fans": 4}}
{"review_id": "hzfSbW-ATjz9RcSkx8L1WA", "user_id": "FQ-zmWPEG_pjSQx6pt3Efw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Always a fun place. Fast service and interesting folks. Once again.. just the bathroom is NASTY! I really wish as in other cities they'd mandatory key use for the restrooms.", "date": "2012-05-24 14:14:11", "user": {"name": "Jimmie", "review_count": 293, "yelping_since": "2009-11-20 17:23:00", "elite": "", "average_stars": 3.9, "fans": 9}}
{"review_id": "CWtv3qpu_f_3vfH7dgPq7A", "user_id": "ei3O4gS4YaEfQW2vpDdYkA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this Starbucks for their drinks always being consistent. I do hate a lot of the times that the upstairs becomes Hipster Freeloading Haven and then you can't even sit in there because of the shortage of tables downstairs,though. A friend and I once sat at a table and used the windowsill as chairs on a very frigid winter night. They could also be more considerate and clean up sometimes,too.", "date": "2012-02-19 02:14:53", "user": {"name": "Marissa", "review_count": 572, "yelping_since": "2011-01-23 00:58:18", "elite": "2014,2015,2016", "average_stars": 3.93, "fans": 20}}
{"review_id": "dulQAMyL3L89E_as0Y46xw", "user_id": "uDNkwTSWMsLMlfUKumKlXg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I mean if you went here for coffee, you blew it. But there are a lack of public restrooms in the area, so, you know.", "date": "2011-03-22 01:09:24", "user": {"name": "Sean", "review_count": 175, "yelping_since": "2009-07-13 18:54:15", "elite": "2013", "average_stars": 3.81, "fans": 7}}
{"review_id": "iBQlKz9aUhwHEdwq9jWoAg", "user_id": "hl812QcYcZ0cRP3Hxa52dA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not really much to say... I mean, it's a Starbucks.  Thought I'd throw in a three-star because I love that they have the upstairs.  Pretty nice view of the shenanigans on South St.", "date": "2010-12-28 01:14:27", "user": {"name": "Wei", "review_count": 159, "yelping_since": "2010-07-02 14:41:29", "elite": "2011,2012,2013", "average_stars": 3.65, "fans": 10}}
{"review_id": "9_5EwDlPd68gqye5KoTchQ", "user_id": "6s-g2vFu12OemhiK3FJuOQ", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 8, "funny": 5, "cool": 6, "text": "Due to their South Street location, this Starbucks is usually more crowded than dead. It's not the biggest Starbucks ever, but there's space upstairs, and the staff are fine. The place is clean enough - including the bathrooms - at least when I was there.\n\nIt'll do if you have a hankering for Starbucks, otherwise I recommend hitting up a local coffee shop instead.", "date": "2010-09-03 14:26:01", "user": {"name": "Dave", "review_count": 2388, "yelping_since": "2007-02-14 14:51:38", "elite": "2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.8, "fans": 1139}}
{"review_id": "iLzAzXOwcwkuMZM13J5MUA", "user_id": "CGr5Xgt3_HYVIpXGsXjcUg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic upstairs area for people watching.  It's a chain so everything tastes the same as it does everywhere else in the country.  The Bathrooms were pretty dirty but thats to be expected when there is a 15 minute wait.", "date": "2010-08-15 20:20:15", "user": {"name": "J", "review_count": 31, "yelping_since": "2009-04-17 03:27:00", "elite": "", "average_stars": 3.39, "fans": 3}}
{"review_id": "r0fvtoX_3O7z-ZpgFn1Wlw", "user_id": "vR986-cV86ts62yiXkPjzg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'm not a coffee person by any stretch of the imagination. In fact, I always order a green tea at Starbucks, but that's neither here nor there. The thing that I love about THIS particular Starbucks location is that it's a shoe's-throw away from the TLA, so you can kill some time here (upstairs, of course) just hanging out before or after hitting up a show. \n\nSo, essentially, this review has nothing to do with the quality or the service of the Starbucks itself.. but just how it's convenient for my superficial killing-time needs. ;)", "date": "2010-08-11 23:46:34", "user": {"name": "Kim", "review_count": 119, "yelping_since": "2008-07-24 15:05:32", "elite": "", "average_stars": 3.64, "fans": 3}}
{"review_id": "PJ62cHBPcFmfVWXnXRuW4g", "user_id": "7kMfuFh7h8PYbcHrqSyqZg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "Great area upstairs to socialize with friends or relax with a drink.  Also, keep an eye out for events they have going on.  I've caught a couple musical acts and a touring author while I've been there.", "date": "2010-03-10 08:15:03", "user": {"name": "Heather", "review_count": 302, "yelping_since": "2010-03-10 04:32:08", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.27, "fans": 29}}
{"review_id": "0RAw1nocjcmyGofDkgOCCw", "user_id": "8wQIoFapkegkC5fcVYg_Iw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 3.0, "useful": 2, "funny": 1, "cool": 1, "text": "I've been to many a Starbucks in my time, so I have quite a bit to compare a visit to.\n\nThe service in here was great, a tad slow, but okay nonetheless. \n\nThe issue I had with this trip was my visit to the bathroom. After I got my key from one of the baristas, I opened the door to see the nastiest bathroom. There was toliet paper all over the floor, the trash can was overflowing, and the whole place had an air of dirtiness.\n\nI felt like I needed to sanitize my skin after using that bathroom. Gross!", "date": "2009-09-07 22:37:01", "user": {"name": "Jamie", "review_count": 1148, "yelping_since": "2009-05-31 17:22:28", "elite": "2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.68, "fans": 104}}
{"review_id": "_Ic0nzRCV5gNejd31leDSQ", "user_id": "_NBVFt_RvD9fKceDT_9Hcw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am aware of what Starbucks is; what it represents and conveys, especially here in Philly. I always feel a hint of guilt when I go into this place and once I leave, that feeling stays for a little while longer. Anyway, the Starbucks on South Street is what it is; it's a chain coffee shop. There is nothing fancy or original about it and their products taste like every other one of their locations, so don't expect anything new on South Street either. However, the single, somewhat good and redeeming quality about this place is the lounge/sitting space on the top floor. I really enjoy reading a paper, or mostly, just looking out the window watching everything that is going on out at the corner of Third and South. It is relaxing, fun and allows for time to fly while you are staring through the glass. Aside from that it is basically your typical, generic Starbucks, nothing more and nothing less.", "date": "2009-08-24 16:29:35", "user": {"name": "Cerpin", "review_count": 39, "yelping_since": "2009-08-18 14:54:58", "elite": "", "average_stars": 3.85, "fans": 1}}
{"review_id": "nF0YP0YUFBXMrnMhArS74Q", "user_id": "bJ5FtCtZX3ZZacz2_2PJjA", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 1.0, "useful": 5, "funny": 10, "cool": 7, "text": "Ah, 666 - The Mark Of The Beast. A number so sinister that it has hellacious written all over it. When you reach this milestone on Yelp you clearly have to write about something that represents your idea of hell (or Johnny Brenda's if your Dave H. -1- but he's still the man). So it sounds like the perfect time to sum up exactly how I feel about Starbucks. And since I already spelled it out for you many moons over (http://www.yelp.com/list/i-hate-starbucks-philadelphia) you know exactly where this one is going.\n\nMy overall thoughts of Starbucks has nothing to do with service or product. I've had decent service in plenty, and in spots like the one that I'm dropping this review on (you'll go anywhere if certain people suggest it) I've had better than decent. And you can't go wrong with the diverse selections of beans that they bring in, assortment of Tazo teas, and delicious treats that they offer for the most part. Although a lot of the prices can be pretty damn horrendous (there's good reason why I affectionately call them Fourbucks). And they do provide a spacious decor that gives you plenty of room to get some work done if your in a bind (I like the upstairs that this one offers).\n\nBut in the land of lush and vibrant indie coffeehouses that is Philadelphia, Starbucks is pretty much the Soulless Empire. When you walk into a place like Chapterhouse that turns it's surroundings into an art gallery; a spot like Last Drop that's packed to the gills with good music, listings for local shows, and gratuitous people watching; or a spot like TBar that hooks up Scrabble and an amazing book exchange; the atmosphere brings you to life. But by comparison the atmosphere of Starbucks manages to suck the life right out of you. Every time I walk in and see the same typical looking art, the same cold plain decor, and total lack of vibrance, I can't help but feel like a corporate slave digging a hole towards a corporate grave no matter what I'm doing. If you ever hear the words \"Grande soy latte two sugars\" coming out of my mouth feel free to slay me.\n\nBut the main reason I hate Starbucks is because, just like rats in the city, they're freaking EVERYWHERE. If you walk down any major Philly street and see a Starbucks, and then it's more than likely that you'll come across another three blocks away, and then ANOTHER! It borders on the unnecessary, but rather than do something to lessen the amount (even when Starbucks announced the closing locations) it feels like their building more (http://www.yelp.com/biz/macys-philadelphia#hrid:6dm686CWJQrzhJAfGOcEwQ). Damn the Empire!\n\n-1- Dave H. did review Johnny Brenda's as his 666. But it wasn't because he found it evil. It was because he didn't put the same significance into the number that I did. and after going to a good show he just felt that it was time to.", "date": "2009-03-04 00:40:53", "user": {"name": "Bill", "review_count": 1512, "yelping_since": "2007-07-13 04:00:59", "elite": "2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.17, "fans": 287}}
{"review_id": "YpEcJHXcqqi-W1vRgNPnig", "user_id": "iKYMEEF2eoz2chhIJN7Lyw", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 5.0, "useful": 4, "funny": 0, "cool": 1, "text": "Staff is very efficient and know their stuff, the downstairs is a bit crowded but they have a very large upstairs that makes for a great place for a book club or poetry reading.  I used to live around the corner from this Starbucks and it was the only place I could go, very early in the morning to sit and read or write in peace.  The upstairs windows are a great people watching spot for the loony tunes that frequent South Street.", "date": "2008-07-15 16:22:17", "user": {"name": "Mrinteresting", "review_count": 89, "yelping_since": "2008-07-02 11:55:19", "elite": "2009,2010", "average_stars": 3.71, "fans": 10}}
{"review_id": "iTg5rHWGeueMYsE5DY75Ng", "user_id": "rUV1FUhji5xMjNBpcq5SXg", "business_id": "a-dPw0ISYHoxMmWgd4mK-g", "stars": 2.0, "useful": 2, "funny": 1, "cool": 0, "text": "This is a small Starbucks that receives heavy foot traffic due to the location. \n\nNot the cleanest either.\n\nThe bathroom gives me the heebie jeebies. \n\nPeep the pix.", "date": "2008-06-02 17:58:57", "user": {"name": "Enjella", "review_count": 754, "yelping_since": "2008-02-14 05:59:50", "elite": "2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019", "average_stars": 3.15, "fans": 144}}
