{"business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "name": "McDonald's", "address": "5020 City Line Ave", "city": "Philadelphia", "state": "PA", "postal_code": "19131", "latitude": 39.999385686, "longitude": -75.229440406, "stars": 1.5, "review_count": 57, "is_open": 1, "attributes": {"GoodForKids": "False", "RestaurantsTakeOut": "True", "WiFi": "'free'", "RestaurantsGoodForGroups": "True", "RestaurantsReservations": "False", "RestaurantsPriceRange2": "1", "RestaurantsTableService": "False", "RestaurantsAttire": "'casual'", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': False, 'brunch': False, 'breakfast': False}", "DriveThru": "True", "Ambience": "{'touristy': False, 'hipster': False, 'romantic': False, 'divey': False, 'intimate': False, 'trendy': False, 'upscale': False, 'classy': False, 'casual': False}", "BusinessAcceptsCreditCards": "True", "RestaurantsDelivery": "True"}, "categories": "Fast Food, Coffee & Tea, Burgers, Restaurants, Food", "hours": {"Monday": "0:0-0:0", "Tuesday": "0:0-0:0", "Wednesday": "0:0-0:0", "Thursday": "0:0-0:0", "Friday": "0:0-0:0", "Saturday": "0:0-0:0", "Sunday": "0:0-0:0"}, "category_list": ["Fast Food", "Coffee & Tea", "Burgers", "Restaurants", "Food"], "stratification_tag": "Coffee & Tea"}
{"review_id": "7hqvMYWWUP1tmjRl97ThIw", "user_id": "IVCFxnw634V9fZsQKf9VPA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This McDonald's and the other one nearby on City Ave are now regularly closing to people and only serving DoorDash and UberEats. Don't waste your time driving here just to be told that they won't serve you. You can read more about their new deal in this article: https://restaurantbusinessonline.com/financing/mcdonalds-announces-new-deals-doordash-uber-eats", "date": "2022-01-16 04:18:21", "user": {"name": "Bert", "review_count": 3, "yelping_since": "2009-08-31 02:19:40", "elite": "", "average_stars": 2.33, "fans": 0}}
{"review_id": "23wErB6lpKvy64KkdBOl1A", "user_id": "hR0MSAbNqZwXmuYD2TuBeg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Honestly this is LITERALLY THEE WORST MCDONALDS IN HISTORY OF WORST MCDONALDS! At this point why is it open? WHY? I don't even know why I play myself when I go here. There is ALWAYS A PROBLEM like it ALWAYS! I live around the corner so when I say I know OH I KNOW! First off they're always closed. It's literally been a long time coming with this review. I live about 4 blocks away so when I say they need to SHUT IT DOWN LITERALLY SHUT IT DOWN! THE STAFF IS ALWAYS RUDE, SOMEBODY ALWAYS HAS AN ATTITUDE! What broke me today and brought me here after yearsssss, here are how my last THREE VISITS went \n\n1.) I pull up the manager is yelling stop we closed, I'm looking at her like she's joking I'm like huh what do you mean why are y'all closed? She goes \"I have no staff, nobody showed up\" Like I understand you can't work yourself but always coming to McDonald's between 9-10 and they're always closed is it because staff isn't showing up? \n\n2.) I pull up start ordering, the workers are literally laughing playing around where I had to repeat my order 4 TIMES! Like pay attention I understand they might be young but you have a job to do, might I add one you're getting paid for so do it! Management seemed to not care, my order was wronG AND COLD! Fries were so bad like they hadn't changed the oil bad after taste. \n\n3.) TONIGHT! Now I pulled up to order a snack Oreo McFlurry so this literally just happened and her name was Asia - I go to order we are out of Oreos (okay that's fine, I'll just add my own Oreos) can I just get the ice cream in a cup? She goes no I'm like huh well can I get a snack size m&m mcflurry with the m&ms on the side (which I have done multiple times by using the \"ask me\" tab WHICH BY THE WAY IS FUCKING ALLOWED ITS FUCKING MCDONALDS! she kept telling me she couldn't do it , her manager refused at this point I'm so frustrated I leave because WHY IS THERE ALWAYS A PROBLEM?????? WHY DOES EVERYTHING HAVE TO BE A PROBLEM HERE!! \n\nLiterally throw the whole staff away, and get new management, and maybe a new owner because this shit is horrible! Might I add I've lived in the neighborhood 20+ years and it's been horrible consistently the last 5 years SHUT IT DOWN!", "date": "2021-11-10 02:47:50", "user": {"name": "Rickia", "review_count": 4, "yelping_since": "2015-08-27 03:30:51", "elite": "", "average_stars": 2.75, "fans": 0}}
{"review_id": "RhyAp51Xk7-Xq-m9X_4z5w", "user_id": "PPdFYuEEdAHCi7KcAuz03Q", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I would give this zero stars if possible. The employees have invented every excuse possible to not accept any orders every time I arrive, no matter what time of the day/night. For months. I've complained to corporate but the issue has never improved. It is ridiculous. There basically is no McDonald's at this location.", "date": "2021-10-16 02:25:27", "user": {"name": "Chris", "review_count": 7, "yelping_since": "2019-05-21 11:41:08", "elite": "", "average_stars": 2.43, "fans": 0}}
{"review_id": "_czLkecUDjssJ32vjg3m8w", "user_id": "JqGhfLsRhv4nOskuij1yVQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was absolutely blown away by the customer service here. The manager was very kind and accommodating when she realized my food hadn't been delivered yet after a short wait. Very happy I chose this location.", "date": "2021-10-10 01:50:49", "user": {"name": "Chris", "review_count": 5, "yelping_since": "2020-07-24 06:21:01", "elite": "", "average_stars": 4.2, "fans": 0}}
{"review_id": "AoUAyMZghO_WXNYHRIfIgQ", "user_id": "qWV9Z6D-FfQBg8ZZ0Y5fkg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Hands down the worst McDonalds I have ever been to. From closing 30 min early to randomly closing for 30 minutes in the middle of a lunch rush, this McDonalds is sure to waste your time. I have never seen a place on Yelp more deserving of a 1-Star rating. Avoid this location if possible.", "date": "2021-09-07 19:20:12", "user": {"name": "Chance", "review_count": 3, "yelping_since": "2019-05-01 20:24:59", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "LWYzraYjDzp00Hf6E5Gdvg", "user_id": "FtPAHOk2aJcDChh1VdKqDA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "this mcdonalds is literally horrible. for the past 2 weeks they have been \"accepting cash only\" but they have a sign that says come inside to use your debit card. when trying to go inside, the workers refused to unlock the door and were extremely rude through the window saying go through the drive through. clearly we tried that but we had debit and not cash. how are the machines working inside but not out? horrible mcdonalds horrible service:  don't waste your time", "date": "2021-08-19 12:07:19", "user": {"name": "Robin", "review_count": 10, "yelping_since": "2020-04-27 16:09:51", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "73z2Jnf-1Vof4MRLDh55cQ", "user_id": "8qMk_oaPJnBkCxDTrGUGmg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 1, "text": "Horrible. Service is EXTREMELY slow. Employees are rude, and totally incompetent. That must be a prerequisite for getting a job here. I've never been there that the order was filled correctly. The ice cream machine is off line more than on, and for two weeks they haven't been able to take credit cards, only cash.   Do yourself a favor...STAY AWAY.", "date": "2021-07-25 00:44:35", "user": {"name": "Jack", "review_count": 6, "yelping_since": "2019-01-04 01:41:55", "elite": "", "average_stars": 3.17, "fans": 0}}
{"review_id": "QRzaXM-toXOaMcrJGb2EOw", "user_id": "hgamj8NivEvxyIkYthEdTA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Update -\n\nAfter 9 months of avoiding this Mcdonalds despite driving past it daily I decided to give it another try. Ordered breakfast on the mobile app, got there at 6:30 am (breakfast starts @4:30am), pulled up to the drive through monitor and ended up waiting....\nafter waiting 5 minutes and repeatedly asking if anyone was there, an employee answers rudely \"the store is closed\". \nAT 6:30 ON A MONDAY??? FOR A 24/7 MCDONALDS??? \nI could clearly see at least two employees through the drive through window. The employee refused to give me an explanation and said they couldn't process my mobile order since they were closed - in the most rude and infuriating encounter to date. \nI stand by my previous review - Please do not let this location's shining golden arches tempt you - you will only find disappointment, frustration, and lost faith in this entire establishment.  \nMy Mcdonalds cravings will forever be tainted by this dumpster fire of a fast food restaurant.", "date": "2021-06-08 10:38:46", "user": {"name": "Daniel", "review_count": 6, "yelping_since": "2013-05-05 20:41:59", "elite": "", "average_stars": 3.57, "fans": 0}}
{"review_id": "QRIQ2LzcodP4SgR_fl-_oA", "user_id": "cOl5Zx-q-ZHNq6EX-DaMaQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a perfect example as to why these workers do not deserve $15 hourly rate.  Corporate needs to shut this location down!  Horribly ran store!", "date": "2021-06-06 21:46:41", "user": {"name": "James", "review_count": 32, "yelping_since": "2013-10-25 19:33:12", "elite": "", "average_stars": 4.09, "fans": 1}}
{"review_id": "xpNl0aDKqrUfTqAH4vEKcg", "user_id": "bKzRaHF0HmGti_4ROJxJ0g", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Always missing items with every order. Bad attitude when confronted with their mistakes. The fries are usually stale. Avoid it if you can.", "date": "2021-05-07 21:37:01", "user": {"name": "Jessica", "review_count": 22, "yelping_since": "2016-07-28 19:26:27", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "ic4158ZR-RKyJke20HhkBg", "user_id": "9HozDVLfO3y1cpK08jfCig", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "honestly this is probably the worst mcdonald's i've been to, awful service, never fail to mess up orders and forget orders. Would not recommend.", "date": "2021-05-07 19:48:51", "user": {"name": "Evan", "review_count": 1, "yelping_since": "2019-12-26 19:09:26", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "4Oiuw0PaLD47I95IBQYNkg", "user_id": "i9cdW7wPTaSTZiU2xnJPAA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "Slowest \"Fast food\" I have ever experienced anywhere! I mean you really have to work to be this slow. 45 min and counting to get our food. Go anywhere else, not worth it.", "date": "2020-10-10 05:44:40", "user": {"name": "Taylour", "review_count": 8, "yelping_since": "2015-10-31 19:08:17", "elite": "", "average_stars": 2.89, "fans": 0}}
{"review_id": "lAG0RvwkEVkuzHOKLGJo7w", "user_id": "hgamj8NivEvxyIkYthEdTA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "This McDonalds is one of the most incompetent fast food drive thru I have ever experienced. I have had multiple orders (mobile/drive thru/ in person) missing items or having wrong items. \n\nit is also one of the SLOWEST McDonalds I have ever experienced. I have spent 20 minutes in the drive thru REGULARLY. Just sitting waiting for them to get my order wrong.  then when i get my wrong order the food is the poorest quality fast food \n\nWhy do i keep going back? answer : it is in a very convenient location right off City Ave. HOWEVER, at this point i have had so many infuriating experiences at this mcdonalds that I now travel 15 minutes out of my way to stop by a different mcdonalds to get my food without the annoyance. \n\nRecommend to everyone to not waste their time waiting to get food from this location until management is changed to be more efficient.", "date": "2020-09-18 23:42:12", "user": {"name": "Daniel", "review_count": 6, "yelping_since": "2013-05-05 20:41:59", "elite": "", "average_stars": 3.57, "fans": 0}}
{"review_id": "izGakj26LzvjIoSgKucpsw", "user_id": "mMb34YtY-9fyGnHwT4BTSw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I don't know why I tried this place again.  For the second time, I was refused service.   This really is the worst McDonalds.   Not worth the stop.", "date": "2020-09-17 09:35:47", "user": {"name": "Jodie", "review_count": 2, "yelping_since": "2018-05-11 23:06:45", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "Dl-ajeUqzkTUYwrcKre6Rw", "user_id": "VA5_RKlYceLmNlwHSC3D_g", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Umm i waiting ina drive thru for about 25mins i paid for a hot chocolate then i gets to the window they say the machine down ! instead of saying that before i paid then my boyfriend says sprite with no ice they gives him\nsprite with ice then we asked for our money back for the hot chocolate because they told us they had no cookies to replace it so then when we asked for our money back they say wait two mins for cookies we had to pull over wait about 5mins finally gets my cookies then our fries are all over the bag just fucking terrible", "date": "2020-09-12 01:13:55", "user": {"name": "muslim", "review_count": 2, "yelping_since": "2020-08-29 10:09:33", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "C0mmmGp626O8yGDd3ok97A", "user_id": "F1UhhhEAiR89lmxnwktQoQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I live around the corner and have tried this place more times than I'd like to admit just due to proximity. I can't anymore. Not only will they 100% of the time not get your order right, but they got 2 24 hour drive thru signs, a lady sitting at the drive thru window not doing anything, yet I sit at the drive thru order spot for twenty minutes saying \"hello\" and they act like they can't hear. The service her just plain sucks and they can't\nGet my money anymore.", "date": "2020-09-08 03:58:26", "user": {"name": "Shawn", "review_count": 1, "yelping_since": "2020-09-08 03:58:24", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "jJrIzDokQjAX48HLx9Inhw", "user_id": "mMb34YtY-9fyGnHwT4BTSw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Can I rate at a zero star?    Never got service to rate.   20 minute wait at the drive thru. It's 6 am on Sunday. I'm the only car in line. And you say hold on for a minute.  Turned into 20.  I wish I would've went to the Starbucks.", "date": "2020-09-06 10:47:13", "user": {"name": "Jodie", "review_count": 2, "yelping_since": "2018-05-11 23:06:45", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "FArJLITM2-MZ1paHFd0JGA", "user_id": "zzfdOXALn161r4ZlMWc_vw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "had to wait in the drive through for more than a half a hour (45 minutes) service was bad, could've been way better food wad lukewarm/cold would not recommend.", "date": "2020-07-30 22:30:04", "user": {"name": "IamGabrielles", "review_count": 4, "yelping_since": "2020-07-30 22:21:40", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "7oDes-3ZxFfHe9bRTc3L_g", "user_id": "RNkZU4v92u5lIa6fbQNEQg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I want to start by saying I've NEVER taken the time to write a negative review before. But after being turned away by the drive thru for the 3 billionth time, I feel it's necessary. I typically hit the drive thru anywhere from 5-6:30 am. Time and time again I am told the system is updating and it will take 15-20 minutes, or today at 5:45 I was told they were transitioning and weren't quite ready yet. But the best is when they don't reply at all. I once actually (and foolishly) came back a 1/2 hour later once only to be told the system was updating. So it's pretty clear the people inside just have no interest in working. Wonder how interested the owner would be to know how much money he's given away to the Wawa on Rock Hill Rd. thanks to his employees ineptness. Because I've literally seen lines of cars turned away.", "date": "2020-06-14 10:42:12", "user": {"name": "Michael", "review_count": 2, "yelping_since": "2017-10-22 22:19:46", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "C3qiHHLIJeWcVBTs7GegdA", "user_id": "lkGnrES4-g7SzmvorwlUrQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place is THE WORST.The BS attitude they gave my aunt was immature as hell. I don't know what's wrong with these people. They accused my aunt for lying about finding a wood chip in my grandpas hamburger. WHO HAS THE TIME AND ENERGY TO WASTE GAS TO GO LIE ABOUT SOMETHING TO GET $5 BACK. Like come on, these people need a common sense class or something.", "date": "2020-03-08 17:40:29", "user": {"name": "Eric", "review_count": 1, "yelping_since": "2020-03-08 17:32:59", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "dO9QIBPvETrr2rboecbIbg", "user_id": "4wml2xh8tN0F89ZLY1hDpw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "if i could rate this mcdonald's lower than 1 star, i would. this mcdonald's was the grossest place i've ever been to. not to mention, the employees were rude and fisty. so it was a nice sunday afternoon and my uncle was picking up some food for the family. when he got home, my grandpa took a bite into his burger and you best believe there was a whole ass wood chip in there. the size was 3/4 of a patty. i am very surprised he didn't chip a tooth lol!! so my mom drove herself back to mcdonald's to complain for my grandpa and they first went to the back to talk about her, they then got 4 employees to come out at yell at her and accuse her of lying. i promise you, the employees were one of the rudest group of employees i've ever met. first of all, WHO HAS THE TIME AND ENERGY TO WASTE GAS TO GO AND MAKE UP A LIE TO GET $5 BACK. anyway, long story short, don't go to this mcdonald's unless you're looking to get sick or choke on something :) have a good day!!!", "date": "2020-03-08 17:18:58", "user": {"name": "Nolan", "review_count": 1, "yelping_since": "2020-03-08 16:56:15", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "vHRWkO7BZE5BoAfkF_o-qg", "user_id": "et7Ndr07Kz-4wX8bbmQjWg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 3, "funny": 1, "cool": 0, "text": "I used to smirk when I would see 1 star ratings for McDonald's because...c'mon, it's McDonald's, what do you expect? But yes, this place is on a whole other level of bad! Tried to order from the drive thru at around 2 in the morning after a night out. There was clearly a McDonald's employee inside working, but she refused to answer after I repeatedly called out \"hello\" in the speaker, trying to place my order. After a while, multiple cars started piling up in the drive thru as we sat there confused on why this 24 hour McDonald's wasn't providing drive thru service. We drove around a couple times, calling out \"hello\" into the speaker for placing orders in case the worker hadn't heard us the first time. Eventually, an Uber drive who was in line for the drive thru banged on the order pick-up window until the worker opened the window. The Uber driver was there to pick up her orders and this worker did not care! Instead, she proceeded to yell really aggressively about how they were closed because they were switching from dinner to breakfast (at 2 in the morning? Yeah, ok). I tried to ask her why they're closed when it's a 24 hour McDonald's only to get more aggressive yelling as a response. Aborted mission and went home. Whoever ordered Uber Eats from McDonald's that night definitely didn't get their food. Super rude service.", "date": "2020-01-14 02:23:40", "user": {"name": "Araba", "review_count": 141, "yelping_since": "2012-12-26 01:33:17", "elite": "2019,20,20,2021", "average_stars": 3.86, "fans": 4}}
{"review_id": "6whCJIvDb9ySCsDkiGOcsA", "user_id": "xBxmS40TM2BUU41cWy67KQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "Never fails smh not one time has an order from Uber eats been delivered and it's been correct", "date": "2019-12-22 14:47:40", "user": {"name": "Sarah", "review_count": 4, "yelping_since": "2013-07-18 11:54:52", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "XAFyh7MjxdNew00Szj65hw", "user_id": "D8yTdU1ATAN3CovSpA0pxg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "When it comes to services! This is one of the worse places I've ever been. From the management to the employees. They all need to retain and work on their attitude. \nFrom the minute you walk into the place you feel that vibe of their negativity, rudeness way they look at you. It feel like you're inconvenient their working clock time.. \n\nWORSE STORE EVER! \nNASTY ATTITUDE \nRUDENESS AND DISRESPECTFUL TO OLDER FELLOWS.\n\nTHEY SHOULD BLESSED THEY HAVE A JOB. \nUNAPPRECIATED RUDE PEOPLE.", "date": "2019-12-08 20:46:02", "user": {"name": "Doug", "review_count": 1, "yelping_since": "2019-12-08 20:46:00", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "IZCuXnw3-mey5RFCFzFtdg", "user_id": "2UKTDARaAPE5cgXYCVTsIQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "They claim to be open 24/7 but denied my friend and i in the drive through. Claimed they were getting ready for breakfast. Very rude.", "date": "2019-11-24 07:34:41", "user": {"name": "Caitlin", "review_count": 2, "yelping_since": "2016-12-08 22:07:43", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "ZCzTK53rleSd0C2ljwvT0A", "user_id": "MCdNO9oTAiE62ZVAapVViw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 3, "funny": 2, "cool": 0, "text": "This isn't the first time I pulled up to the drive through (after waiting in a long line) and nobody talked on the speaker. I waited almost half hour last night and then could not even order my food. I left, came back, and the same thing happened. People were blaring their horns and everything. Get your sh*t together. Then you hear these establishments want $15/hr !!LMFAO. If reheating frozen food and dropping things in a fryer is too complex for you maybe find a new job.", "date": "2019-09-14 16:27:19", "user": {"name": "Kaitlin", "review_count": 30, "yelping_since": "2016-09-27 14:57:56", "elite": "", "average_stars": 3.26, "fans": 0}}
{"review_id": "oGSC0H9V3UmgZQgIRZswoA", "user_id": "zzW56xgATvt0CouuDYxkrA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "The wait was waaaaaaay too long! No one came to the window to service me and my family.", "date": "2019-08-16 00:14:46", "user": {"name": "Aundrea", "review_count": 12, "yelping_since": "2017-12-30 22:54:18", "elite": "", "average_stars": 1.46, "fans": 0}}
{"review_id": "qg0ujkRi-qpv13alu5r4VQ", "user_id": "LDw_VP9a22nnxueeCe7BHw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is the worse place on the planet, every time we go there they miss up our order. Today is the last time they will my car pull up there. I had a coupon for a McGriddle but one get one for 0.10. They wouldn't honor the coupon so I had to pay full price. My wife takes insulin then opens her meal and the egg and one griddle is missing, now she has to worry that she took to much meds. Today is the last time they will see my car pull up in their lot.", "date": "2019-07-15 13:41:51", "user": {"name": "Hakim", "review_count": 11, "yelping_since": "2014-03-29 08:07:08", "elite": "", "average_stars": 2.82, "fans": 0}}
{"review_id": "PesT0eTveNI7z03L8FFd8g", "user_id": "qzllk7aBxUCyMvhMb5bJJg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is the worst McDonald's I've been to in my entire life!!!! After my friends and I have been waiting 15 minutes for our food to come out we finally approach the register and question the staff on what is taking so long. About another 5 minutes go by until we finally receive our food. We are finally in our seats for about 2 minutes until a worker comes up to us and tells us we have to leave because they were closing. Almost like some sort of sick joke! Knowing they were going to kick us out ( it was 11pm) they did not put our food in to go bags so we had to get bags to wraps everything up. While we are waiting for our to go bags two of the workers begin to fight with each other! The one finally said to the other, \" if you are going to sit here and do nothing, leave!\" And the girl quit and walked out!!!! Such a bizarre night it almost felt like we were on some type of \" what would you do\" show. It was the worst customer service I have ever experienced in my life. This innocent happening reminded me on why I never eat or go to McDonald's. Do not come here unless you want to wait 20 mins for a small French fry or laugh at how poorly established the restaurant is run.", "date": "2019-04-11 21:03:56", "user": {"name": "Jess", "review_count": 1, "yelping_since": "2016-05-19 16:28:13", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "70d2HygdEjSwUA7QW87VAQ", "user_id": "ifigTCDdPZNh69Mz5a58BQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Horrible service, drive thru is never fast service. Around 10pm you can wait in line forever waiting to get served. They leave the window and just stop working.", "date": "2019-03-09 04:16:43", "user": {"name": "Brianna", "review_count": 2, "yelping_since": "2017-08-19 17:50:06", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "evlzuOR0o7Kn0FC_wxKgzQ", "user_id": "aSF7asD343AQ72xI7VbmDw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "This is a horrible ghetto food establishment..drive by the drive thru..the worker was talking thru headsets to the co-workers in the store.heard their whole conversation..fish sandwiches must have been setting there all day.\nHorrible !!!", "date": "2018-12-28 04:21:24", "user": {"name": "Cynthia", "review_count": 1, "yelping_since": "2015-08-20 13:29:32", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "zvIX8hhZ-htc3A6VKwroig", "user_id": "USfovyfryenT69j_tGmI-A", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 2, "funny": 1, "cool": 0, "text": "This is one of the slowest McDonald's I've ever been to. Not busy. Tons of staff standing around. Three people yelling about a Big Mac without cheese which someone made with cheese. Could use more people actually working.", "date": "2018-12-18 00:17:44", "user": {"name": "Joe", "review_count": 226, "yelping_since": "2013-02-10 00:09:00", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.51, "fans": 8}}
{"review_id": "fj58zVjWPUDIEhNyi80fSQ", "user_id": "nrW9PyZaExaOvPh37trS1g", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Yikes actually 40 min drive thru with 4 cars, legit slowest drive thru I've ever seen and slowest take out all in one day in the lowest rush hours.", "date": "2018-10-27 07:52:55", "user": {"name": "Aman", "review_count": 1, "yelping_since": "2016-01-04 17:59:00", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "6HY9RgPhZ2nTKbLxXBNQ1g", "user_id": "ruFtdPJfRR8ZMQkfjHqlhA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 2, "cool": 0, "text": "Like watching a train wreck in sloooooow mooootion. This place could not be any more disorganized.", "date": "2018-10-20 06:10:53", "user": {"name": "FJ", "review_count": 2, "yelping_since": "2012-01-22 21:50:56", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "XvxCegbW_q-M3DicPvf3gQ", "user_id": "QOIqH25Cp31Z8D9sQmGZUw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 5.0, "useful": 2, "funny": 2, "cool": 0, "text": "Went in for some fries & the manager came over to help me order on the kiosk so I wouldn't have to wait for the person to finish in front of me. She was very nice, stayed with me & showed me how to use it. It was a cool experience. The employees seemed to all get along & everyone was working together. Oh yeah... the fries were on point!!!", "date": "2018-10-11 22:50:30", "user": {"name": "Cee", "review_count": 107, "yelping_since": "2017-09-02 12:10:15", "elite": "2018,2019,20,20,2021", "average_stars": 4.43, "fans": 6}}
{"review_id": "qrmboFbN-LMF3RXMpwGGsQ", "user_id": "o4LQnpUh0li5RKyE9KxomA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Pure incompetence. There's a reason McDonald's is failing. It's establishments like this. No focus on customer. No focus on \"fast\" part of food. No focus on quality. Shut it down until management can get their act together. Never again will I visit this location.", "date": "2018-09-30 04:47:52", "user": {"name": "Chris", "review_count": 5, "yelping_since": "2018-09-30 04:47:50", "elite": "", "average_stars": 1.8, "fans": 0}}
{"review_id": "6AfrZbQGyLmeVEjfTMdJaw", "user_id": "aW0DlNzbj_uafH8opfL14Q", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This location is a prime example of why the employees don't need to earn $15/hr. Absolute imbeciles!!!", "date": "2018-09-15 10:25:05", "user": {"name": "Madison", "review_count": 1, "yelping_since": "2018-09-15 10:25:03", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "uk9Z0j1_93XGz-HWMR10cw", "user_id": "izgBI2fVWBsMspdt-jOWJw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is the worst McDonald's I have ever been to!! I ordered a coffee and they asked me to pull over so they could bring it out. I sat and waited for about 25 mins and notice nobody was coming out with my coffee. I finally go inside and the cashier said that she thought someone sent my coffee out to me cause they never saw me out front......really???? The cashier made me my coffee but I asked for a meal ticket for lunch since I waited so long for my coffee and had to come inside to get it. When I explain to the manager what happened and if I could get a meal ticket for waiting so long she told me it wasn't lunch yet and was very rude with a nasty attitude. The manager told me I need to come back during lunch as if I was a bum begging for food. All I wanted was to get some kind of free meal ticket for waiting so long for a coffee that they forgot to send to me. I don't need they food at all. I can buy my own food but it's just the principle of the situation. This is the second time this has happened to me at this same McDonald's. They will NEVER get my business again!!!!!! You don't treat people like that. The customer service at this McDonald's is TRASH!!!!!!!!!!!", "date": "2018-06-29 14:09:22", "user": {"name": "Tiffine", "review_count": 1, "yelping_since": "2017-01-16 01:22:45", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "glVnKybQ7SxfjHCIglxhMg", "user_id": "E8Brau7LHw454accaAHnnQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "This is not the worst McDonald's in Philly but it's up there on the list... waited 35 min in the drive thru for 10 nuggets and a sweet tea. Total waste of my day. I would have gone inside but it was too late and I already ordered. It's also 2:20 in the afternoon with 4 cars in the line. Is there a party happening inside and no one cares ‍", "date": "2018-06-21 18:21:26", "user": {"name": "Ron", "review_count": 139, "yelping_since": "2014-01-06 19:36:26", "elite": "2018,2019,20,20,2021", "average_stars": 3.47, "fans": 5}}
{"review_id": "IX0MZcqMNr0ATeNuDMKwQw", "user_id": "Jeq4HR0jc30QvWociwi6tw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Took too long for a basic order. Employees talking loud with phones out. No order established. It was not busy a all. No sign of care from the manager on duty on Wednesday's @ 6pm", "date": "2018-06-20 22:01:32", "user": {"name": "Nicky", "review_count": 39, "yelping_since": "2017-01-29 06:50:43", "elite": "", "average_stars": 1.85, "fans": 1}}
{"review_id": "JFuMjW5gY1sUopvN9D7TZA", "user_id": "M7Gt-G3dpEaj7ReEd-Livw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Worse McDonald's I've ever been to.  Ordered 3 iced caramel macchiato. They were all bad. Called and asked for our refund. They hung up on us in the middle of a conversation.", "date": "2018-06-06 03:53:12", "user": {"name": "Cindy", "review_count": 32, "yelping_since": "2016-09-27 15:45:11", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "KOmIAaVUKFcFBZMirAb6Yg", "user_id": "MmRqGchSh-4988oD__30uQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 2, "cool": 0, "text": "HORRIBLE. And this is from the past 5 years. I don't even know how they are still a franchise. Tonight i got a fish sandwich on a hard ass bun,fries were to salty and soda was all ice. Atleast is a step ip from previous time when the would say....\"our system is down\". \nWhy didn't i take my food back? Because.", "date": "2018-05-24 07:06:59", "user": {"name": "Jackov", "review_count": 17, "yelping_since": "2017-03-16 03:28:23", "elite": "", "average_stars": 3.17, "fans": 0}}
{"review_id": "gspvuTQT3-pVOpZGhfWm7g", "user_id": "OfzVx_h1UfaCuQPb2zQf2w", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Waited 20 mins for my food and when it came out it was wrong. Will never come here again.", "date": "2018-04-22 19:15:54", "user": {"name": "Delco", "review_count": 33, "yelping_since": "2017-05-06 18:59:19", "elite": "", "average_stars": 3.15, "fans": 1}}
{"review_id": "KHNH6KzaZv2su5sHR2U8Zw", "user_id": "BDROFsEL8mn5mP_4Ilb5Hw", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Do not even expect you can get your food. I am now in the store and have waited my food for 40 minutes. I saw two ppl asked a refund for their order and I am about to be same.", "date": "2018-04-07 14:59:37", "user": {"name": "Amy", "review_count": 8, "yelping_since": "2014-07-06 01:13:38", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "OZdMuwRrqqQduOloMHKH3A", "user_id": "sJhMSkBe-OrN-Y1k4MFCog", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 1, "funny": 2, "cool": 0, "text": "They make their fries fresh everytime and I applaud them for that but COME ON! Why is it ALWAYS so slow?! And why do the people working there seem to just not give one shit about their jobs. It's very disheartening.", "date": "2018-02-28 05:49:29", "user": {"name": "Jonathan", "review_count": 2, "yelping_since": "2015-09-11 14:55:23", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "jM33bYZePQrS2IZ2R_jjRA", "user_id": "AdMHuCOmqBky-Ti3mAiZOQ", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fix your customer service ! Got a guy At the window who thinks he doesn't have to speak to anybody. That is not hospitality. #manners #expectations", "date": "2018-01-27 05:11:27", "user": {"name": "Judy", "review_count": 11, "yelping_since": "2011-11-30 05:35:30", "elite": "", "average_stars": 3.09, "fans": 1}}
{"review_id": "XwbVemJvvqtyfrm4_wRiBQ", "user_id": "rxTmC__cJC72010PQaqvsA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Managers understand mistakes but medium wage employees need to learn customer service .ill give her a hint\"you ain't gettin no fries\".at that point my handicapped son in the back seat heard this and began crying.this drive thru employee needs to be fired.", "date": "2017-07-28 17:35:36", "user": {"name": "Howard", "review_count": 39, "yelping_since": "2016-03-29 20:42:20", "elite": "", "average_stars": 2.39, "fans": 0}}
{"review_id": "e0zSgFKA7ST3vLEnbauAgg", "user_id": "2LQ0EYNjDAPzOgHOtU2kEg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 3, "funny": 3, "cool": 1, "text": "If they're taking a while to ring you up, it's because they're swiping your credit card info. Beware!", "date": "2017-05-07 11:18:58", "user": {"name": "Liz", "review_count": 2, "yelping_since": "2011-11-26 23:23:40", "elite": "", "average_stars": 2.5, "fans": 0}}
{"review_id": "y-kP_valqulxYh6TV6FxwA", "user_id": "oFurXRjfO3Ea-Q2ntdWyXA", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is the worst macdonald everrr, just bad customer service. Im Not returning to this location again.if i was to give them a negative i would", "date": "2017-04-24 01:32:17", "user": {"name": "Salote", "review_count": 18, "yelping_since": "2017-03-13 03:04:12", "elite": "", "average_stars": 4.22, "fans": 0}}
{"review_id": "QcS_GiWNs3avbfeBTBKAOQ", "user_id": "YDvL5CHBpQe1nprcmUMUVg", "business_id": "D8NEBGvh1DVHbyEs2cWVAQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great Customer service, foods made quick and efficiently. This is a great location for them. Keep up the good work", "date": "2017-02-25 18:05:05", "user": {"name": "Jordon", "review_count": 1, "yelping_since": "2017-02-15 03:42:27", "elite": "", "average_stars": 5.0, "fans": 0}}
