{"business_id": "2Q5gjf_K68145UdUyKGAaw", "name": "Café L'Aube", "address": "1512 S St", "city": "Philadelphia", "state": "PA", "postal_code": "19146", "latitude": 39.938817, "longitude": -75.182574, "stars": 4.5, "review_count": 75, "is_open": 0, "attributes": {"RestaurantsReservations": "False", "RestaurantsTakeOut": "True", "RestaurantsDelivery": "False", "OutdoorSeating": "True", "RestaurantsAttire": "u'casual'", "Ambience": "{'romantic': False, 'intimate': False, 'touristy': False, 'hipster': False, 'divey': False, 'classy': False, 'trendy': False, 'upscale': False, 'casual': False}", "RestaurantsPriceRange2": "1", "GoodForKids": "True", "RestaurantsGoodForGroups": "True", "Alcohol": "u'none'", "BusinessAcceptsCreditCards": "True", "HasTV": "False", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "WiFi": "u'free'", "NoiseLevel": "u'quiet'"}, "categories": "Coffee & Tea, Desserts, Food, French, Creperies, Restaurants", "hours": {"Monday": "7:0-19:0", "Tuesday": "7:0-19:0", "Wednesday": "7:0-19:0", "Thursday": "7:0-19:0", "Friday": "7:0-20:0", "Saturday": "8:0-20:0", "Sunday": "8:0-18:0"}, "category_list": ["Coffee & Tea", "Desserts", "Food", "French", "Creperies", "Restaurants"], "stratification_tag": "Coffee & Tea"}
{"review_id": "hkNqapT_JrfrPFMNFH0ocQ", "user_id": "D1iycpz8ajw5Ph-vfM2brA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 3.0, "useful": 0, "funny": 1, "cool": 0, "text": "Owner is nice, food is decent, but nothing about this place stood out to me. It was your average cafe. I definitely didn't leave feeling like I would need to return if I was ever in the area again.", "date": "2011-09-07 13:40:16", "user": {"name": "Haley", "review_count": 92, "yelping_since": "2011-07-25 15:10:02", "elite": "2012,2013,2014", "average_stars": 3.47, "fans": 8}}
{"review_id": "5EYTQwTE3r9a6veZRvUAhg", "user_id": "0A0Za7HudAy7-C3lygSBYA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "When you step inside this little cafe shop please:\n\nDon't be disappointed by their simple look.\n\nDon't be disappointed by not seeing a huge big menu on the walls or anywhere else in the shop \n\nDo check out their printed menu filled with lots of delicious crepes, french sandwich, and waffles. \nTheir drinks choices is small but their high quality teas and coffee will definitely satisfy your need and exceed your expectation.", "date": "2011-08-21 18:05:42", "user": {"name": "Vinh", "review_count": 64, "yelping_since": "2008-08-07 01:56:25", "elite": "", "average_stars": 4.27, "fans": 2}}
{"review_id": "KiNwfbRUhJaQUwEKaE9xbg", "user_id": "YRWbsCC3eNhTZfjV7e1Cmw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Jean Luc! french crepes, coffee, sandwiches! Def my favorite spot!", "date": "2011-07-22 14:45:37", "user": {"name": "Evelyn", "review_count": 102, "yelping_since": "2010-01-29 22:57:09", "elite": "", "average_stars": 3.75, "fans": 0}}
{"review_id": "a155W_DCyKG8CB_xVYissQ", "user_id": "ostuzmLU5xwe7wmChCjMiw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you are looking for the Philly creperie scene, it's pretty limited, but Cafe L'Aube brings the city of brotherly love a good balance of sweet and savory. It's a great spot for a lunch date, but they do close early on weekdays, so don't head over mid-day to grab a cup of coffee, set up your laptop and eat a sweet cinnamon and butter crepe. The staff is super friendly and accommodating. I'd recommend it to a close friend if they were looking for something new to experience on South Street.", "date": "2011-07-21 21:57:56", "user": {"name": "Laura", "review_count": 54, "yelping_since": "2009-08-30 21:47:16", "elite": "", "average_stars": 3.93, "fans": 4}}
{"review_id": "OZrgLHok62c4rQu5vkxRWg", "user_id": "ow1Kh_m8t-Bn3l7l1McjVA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've ate here twice now, both times with a friend. We usually end up ordering a crepe each and sharing them; so all in all I've tried four different kinds and all of them were delicious. Goat cheese & fig jam crepe are to die for. Staff is friendly, the atmosphere is great and you can enjoy an intimate breakfast with your partner. Definitely will be returning.", "date": "2011-07-18 07:19:49", "user": {"name": "Rachel", "review_count": 61, "yelping_since": "2010-06-08 03:13:42", "elite": "", "average_stars": 3.38, "fans": 2}}
{"review_id": "qbWg4UKscQbuPyhCpH_qGg", "user_id": "VEj1OuO6QrQMXFhuMZJ8cQ", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "Cafe L'Aube is bringing crepes back.\n\nWhether you're in the mood for simple or complex, you will most certainly find an appetizing crepe. \n\nSimple is Best? A simple BROWN SUGAR crepe accented the delicious crepe dough - slightly sweet - and cooking technique - slightly buttered - perfectly. Order this if you want a taste of the paragon crepe-iness. \n\nCraving Complexity? The Preferé offered a genius insight into the oft overlooked leek and bacon pairing. Crisp bacon and garlicky fresh leeks were folded into all 3 (or 4) layers of buckwheat crepe-y goodness. And this crepe-y goodness was then smothered in Swiss cheese...If France were a crepe, it would be The Preferé: a complementary world of flavors and textures letting none overpower the other. Aww. Peace.\n\nThe double shot cappuccino was just okay- a little too bottom-of-the-bag espresso-y for my liking. Save your money. Buy another crepe.", "date": "2011-06-19 21:59:36", "user": {"name": "Ettya", "review_count": 705, "yelping_since": "2011-03-16 14:44:46", "elite": "2011,2012,2013,2017", "average_stars": 4.25, "fans": 90}}
{"review_id": "Bm859-R3hZUpMoSIVxaTtQ", "user_id": "WfTw3RiS_toS58bsWUWScA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I would have walked right past this place had I not seen someone seated outside on a beautiful day, enjoying a coffee.  \nI'm a fan of coffee, and I like small places, so I checked in.  Having already had a coffee a few minutes prior, I opted for the single cappuccino as opposed to my usual double.  \nThe coffee is smooth and impressively made.  The microfoam could be a bit finer, but this is an esoteric notice.  The proprietor is friendly and humorous, an welcome change from several of the owners, employees of various trendy spots that I have experienced throughout Philadelphia.  I really enjoy this place, and I think I may have to come back when I am less caffeinated to enjoy my usual double cappuccino.  \nIf you're in the area, don't walk by.  Stop in, order a drink and savor a moment in the city.", "date": "2011-05-26 14:31:08", "user": {"name": "J", "review_count": 31, "yelping_since": "2010-12-13 21:04:09", "elite": "", "average_stars": 3.52, "fans": 1}}
{"review_id": "Qkn_PSWV3Wich8bsBLnYhQ", "user_id": "fR5x6zfrcWuOV74fx5oIMA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 2, "funny": 1, "cool": 2, "text": "A small & quiet cafe with a nice menu and good food, but a bit expensive for such few fillings.\n\nI wanted to try the Preferé & my friend Le Fromager but the barista told us that he had no bacon, how sad..\n\nSo I settled for Normandy and Chai Latte while my friend Le Quotidien and Cappucino. \n\nI don't know what I was expecting, but definitely not the deli-looking turkey meat in my Normandy.. I guess it's because I'm so used to crepes with nice chunks of meat that make them more filling. Regardless, I really liked my crepe ! nom nom nom.", "date": "2011-04-29 03:36:09", "user": {"name": "D.", "review_count": 97, "yelping_since": "2008-11-04 23:42:03", "elite": "", "average_stars": 3.65, "fans": 1}}
{"review_id": "mrbrlrid0oZcm-VW3rhy6w", "user_id": "Q78yoP89c4EWYjUEzju9tA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cute place, great service!  They have super tasty creepes and waffles and good coffee.  The only downside is that they're a little slow when it gets crowded because there is usually only one person working there.", "date": "2011-04-27 16:41:55", "user": {"name": "Jordan", "review_count": 191, "yelping_since": "2011-02-21 22:21:25", "elite": "2012,2013,2014,2015,2016,2017,2018,2019", "average_stars": 3.8, "fans": 27}}
{"review_id": "UclWy0ltFTeFV9QPP2DhOQ", "user_id": "I0ezkVvCcBnavJf2soWHjA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 2, "funny": 7, "cool": 2, "text": "I'll put it to you this way: There are about four coffee shops within two blocks of me but I'll be passing them by on my way to Cafe L'Aube. I'll take that twelve minute walk. I mean, I wouldn't if there was some storm or something. I'm not risking life and limb over here. I'm just making a pompous gesture about my L'Aube dedication. I like Cafe L'Aube a lot.\n\nI think that their coffee is very good. I'm a fan of their crepes as well. I spent a significant amount of time in this place early this past Winter as I was in need of a little wi-fi. I was having a bit of the temporary Internets troubles at home and I had a fantasy football team to manage, dammnit.\n\nOn quiet Thursday afternoons at Cafe L'Aube I hoped that other customers might think I was a writer, writing hard...feverishly composing a novel or something....ya know...instead of sweating over fantasy football line up decisions. No seriously, I did actual real work-work there too. I did, OK? \nI enjoyed many a cappuccino or cafe au lait...and perchance a crepe...like \"The Prefere,\" with bacon, fondue of leeks, swiss cheese and creme fraiche...Delicious. There are many to choose from. \n\nMy wi-fi difficulties have since been resolved but  I continue to return to this peaceful, friendly spot. I don't lug my laptop with me but I find it a kind of serene place to do a little writing, even if said writing is simply a very intense grocery list.", "date": "2011-04-20 02:42:31", "user": {"name": "Kathleen", "review_count": 383, "yelping_since": "2011-03-03 10:04:41", "elite": "2011,2012,2013,2014,2015,2016", "average_stars": 3.97, "fans": 72}}
{"review_id": "Pa6PBE9_oymOB3gTzcRzsw", "user_id": "lrJiNm60MQdaZyM0PslY6Q", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cozy, friendly, neighborhood cafe.  \nCrepes were okay but not the best we've had, and they weren't very liberal with the crepe fillers.\n\nAnother downside was getting charged full price for a coffee refill.", "date": "2011-03-13 18:01:17", "user": {"name": "CityGirl", "review_count": 3, "yelping_since": "2011-03-13 17:59:47", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "evPzwUBIjgVkCjklPT3n_w", "user_id": "KnPrhgAtSuUEA4PYSLFDVg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 3.0, "useful": 2, "funny": 0, "cool": 1, "text": "I have to say, I don't have any glaring issues with Cafe L'Aube. I had coffee, which I thought was delicious, and a breakfast crepe with bacon, eggs and cheese. The crepe was good, but way too expensive. I will return, because of the comfortable atmosphere and good food/coffee, but would prefer they had slightly lower prices (or free coffee refills for those ordering to stay, which I think should be standard when it's all that expensive).", "date": "2011-03-04 14:46:01", "user": {"name": "Nicole", "review_count": 324, "yelping_since": "2010-09-10 13:21:44", "elite": "2011,2012,2013,2014,2015,2016", "average_stars": 3.83, "fans": 20}}
{"review_id": "_GKxla-5fDdo-QPZPoTdmw", "user_id": "P9hbcVoZIPKF4gV8KH427A", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "one word BRENTON !!! we arrived and were welcomed by the owner and the friendly counter girl :) This place is a BYOB and they provided us wine stemware and an opener ( Nice Touch). After scanning the menu i decided on the BRENTON and i was so glad that i did. the sandwhich was  amazing..the combination was like comfort food at its best. Brie grilled with apples, coconut,honey and almonds made this one of the best things i have eaten in my life. It came with a side salad that featured a dijon dressing (that i almost drank from the container it came in). after two glasses of wine and an amazing sandwhich i finished up my meal french style with an espresso. will def be returning to cafe l'abue.", "date": "2011-02-28 01:30:15", "user": {"name": "Aaliyah", "review_count": 590, "yelping_since": "2011-02-07 13:54:35", "elite": "2011,2012,2013,2014,2015,2016,2017", "average_stars": 3.84, "fans": 79}}
{"review_id": "1bHys39FC7-HVfFZ4uJ1HA", "user_id": "WpCPD0rY1FqmY7myHLS74w", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Yum!\n\nThe perfect study spot. Not pretentious. Quiet. And French food! My croque monsieur was délicieux--I felt like I was back in Paris.", "date": "2011-02-25 21:15:19", "user": {"name": "Sofia", "review_count": 2, "yelping_since": "2010-06-18 01:15:40", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Y--hX4dnYStO28YiUC8EAQ", "user_id": "uIHibXqmjvijB7alLMCS0Q", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My favorite little haven for when I want a  bite to eat in a quiet location. This place is the reason I want to move in the South Philadelphia area. It's just one of those great little restaurants that give exceptional service and quality food at affordable pricing.\n\nI'd recommend this to anyone interested in trying something different while chatting casually with a friend or a special treat for your significant other. Hint hint!", "date": "2011-02-12 02:03:02", "user": {"name": "Sabrina", "review_count": 51, "yelping_since": "2011-02-12 01:54:47", "elite": "", "average_stars": 3.63, "fans": 1}}
{"review_id": "2PWVyGvqejFbJygpmZQ6zw", "user_id": "W1PwuOqzqRE6YdH4YC24LQ", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "A perfect place for brunch with your girlfriends to chat and gossip over a delicious cup of cappuccino and indulging in their savory or sweet crepes without feeling guilty. Their crepes are light. What a great place and not overpriced.", "date": "2011-01-24 17:37:18", "user": {"name": "Micaela", "review_count": 114, "yelping_since": "2009-03-27 15:12:51", "elite": "", "average_stars": 4.25, "fans": 8}}
{"review_id": "aE2PhYWm-y6i7S3yHzLWkw", "user_id": "KgN-TlzBr-n_4pXx9C7slw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 1, "cool": 1, "text": "two words: \nNutella Crepes\n\nsix words:\nInternational flavor, friendly francophones, decent coffee", "date": "2011-01-19 02:38:05", "user": {"name": "Pauline", "review_count": 28, "yelping_since": "2010-05-01 15:26:19", "elite": "", "average_stars": 3.79, "fans": 3}}
{"review_id": "VMGRWt9Q7_1YMLs18_N-Zw", "user_id": "3sTWQT6KKjDeHxNnNWvVng", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Solid food, casual, laid-back.\n\nThe best way to enjoy according to me (because really, that's what Yelp is all about, isn't it?):\n\n1.  Grab a seat in the rear part of the cafe with the low bench-like couches, which are the best seats for a small group to hangout and drink some good coffee while waiting for crepe orders to come out.  \n\n2.  We almost exclusively order the Preferé (bacon, leeks, creme fraiche and swiss cheese) because frankly we can't get enough of this goodness.  \n\n3. We are also known for placing an order for a dessert crepe as the Preferé arrives, so that we can cap it off with a sweet nutella ending.\n\n4.  We live close by and have found that calling ahead for a pick up order is an awesome way to go if you don't have the time to hang out but still crave the yummy crepes, or if you suspect that it'll be crowded.  Weekend mid-mornings on a not-so-bad weather day will make for a cramped cafe and a long wait, since they are a small establishment.   I wouldn't recommend take out unless you live close enough so that the crepes are still nice and warm when you get home, but for those of us lucky enough, this is an awesome option.", "date": "2011-01-11 23:53:11", "user": {"name": "Lucy", "review_count": 26, "yelping_since": "2010-07-12 23:12:46", "elite": "", "average_stars": 4.4, "fans": 0}}
{"review_id": "AP9dpmTaLT5HhzL4OmIPVA", "user_id": "ET8n-r7glWYqZhuR6GcdNw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 7, "funny": 3, "cool": 5, "text": "I've been spending a whole lot of time in coffee shops lately and I've been especially charmed by L'Aube. My skim latte last Monday morning was absolutely dreamy. I can only imagine how amazing the crepes are - the smell was intoxicating! \n\nNext time I'm in the mood for a little French rendezvous, I know exactly the place to go. Wonder if I can convince anyone to sing The Beatles' \"Michelle\" to me?", "date": "2010-12-20 04:59:06", "user": {"name": "Michelle", "review_count": 2256, "yelping_since": "2008-03-28 13:26:38", "elite": "2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.05, "fans": 1353}}
{"review_id": "eq-cOV7apFca6QRWbY-sgw", "user_id": "UySHFL1nPHt9Etqs-Tvi3A", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "With absolutely delicious crepes and a decent cappuccino you can't go wrong with L'aube. While it is not an overly large spot, don't expect to bring a large group, for a solo morning or a date it's perfect. I frequently get the legume crepe and a cappuccino and have never been disappointed. In fact, I usually leave with an \"all is right with the world\" sort of meditative feeling after enjoying the deliciousness held within. Definitely give it a try if you are in the area.", "date": "2010-11-18 21:33:57", "user": {"name": "Justin", "review_count": 8, "yelping_since": "2009-08-08 22:54:24", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "UuHqAtpbgDM9DXr1InBIeg", "user_id": "if-6FnW2g8Y47PWQCismFQ", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 3, "funny": 2, "cool": 3, "text": "I came to this coffee shop recently to get my fill of caffeine with a fellow Yelper. He asked to meet near Rittenhouse Square, a request I took all to literally by picking a spot near the area instead of in it.\n\nWhen I entered the nearly empty shop, I grabbed a quick soft drink and informed the barista that I was waiting for someone. She did not need to know this but I felt compelled to tell her. There was something about the cafe's atmosphere that made me feel comfortable talking to strangers.\n\nI sat down facing the front door and looked around. The only other patron was a woman who appeared 20 years my senior. She was a professional test question writer and an aspiring author. Her sole novel was about the people of West Philadelphia. It remained unpublished.\n\n\"The things I write about don't appeal to publishers,\" she said.\n\nShe loves Korean dramas and writing about the everyday aspects of life. Those seemingly mundane details that we tend to overlook are beautiful to her. I admire that.\n\nShe sat there with her binder, writing test questions. Her only lament was that her job did not allow her to write on her own nowadays.\n\n\"Someday, I hope to return here for one of your book signings,\" I said. \n\nShe smiled politely, knowing full well that it was unlikely the fates would conspire in such a fashion. After all, I never even asked her name.\n\nManon, the barista, began talking with us about her work visa problems. She came from France and studied at Temple, focusing on human relations. We tried to think of good job opportunities for her.\n\nAfter a couple of minutes, we said our goodbyes. The writer left and my drinking companion arrived. It was only a brief conversation that we had but one that I imagine happening regularly at Cafe L'Aube.", "date": "2010-11-17 00:36:08", "user": {"name": "Marcello", "review_count": 123, "yelping_since": "2010-08-26 01:16:12", "elite": "2011", "average_stars": 4.27, "fans": 19}}
{"review_id": "Ci6KY3DHpQdCXUMFFTDYgw", "user_id": "3QWhxTsiMU2WSJmCnJVjMw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "There should be more places like Cafe L'Aube.  Quiet, free wi-fi, good drinks and a fairly extensive menu of crepes.  Like all good crepes, they're not cheap, but L'Aube's prices are a bit more reasonable than Beau Monde, and it's more of a place you can \"hang out,\" as opposed to \"going out to eat.\"  It's in somewhat of a random location, but still close enough to other areas that are more densley populated with restaurants to justify walking a bit to go there.\n\nThe friendly young Frenchman that was working there (the only person there) made me a pretty decent latte (I was offered the option of one, two, or \"up to ten\" shots) and nutella crepe with strawberries.  The crepe was well-prepared and the plate was brought out to me, complete with \"L'Aube' written in chocolate sauce around the top.  The only other customer in the place was a shaggy woman with an even shaggier dog that sat chewing at her jacket.  So if you like to bring your dogs places with you, apparently they don't mind here.\n\nI look forward to trying some of their savory offerings.  Hopefully they're busier at other times then they were when I went.  Otherwise I'd be concerned about them staying in business!", "date": "2010-11-01 23:44:19", "user": {"name": "Mortimer", "review_count": 114, "yelping_since": "2010-09-01 20:33:56", "elite": "", "average_stars": 3.35, "fans": 4}}
{"review_id": "X4UOa3-boCEoh1eWMV-GAw", "user_id": "KnAr1FnvYyT0jRYlIVj_gA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "What a lovely breakfast spot.  Cute space.  Delicious crepes -- I wanted to try more than one but I settled with the lemon/sugar crepe, which was extremely delicious.  And more importantly, the coffee was great.  Delicious French espresso.  The outdoor space was nice too, although we were more or less required to sit outside since it was way too toasty inside.  Next time I'm back in Philly, I'll return for sure!", "date": "2010-10-19 15:46:15", "user": {"name": "Victor", "review_count": 314, "yelping_since": "2007-07-03 06:01:22", "elite": "2010,2011,2012,2013", "average_stars": 3.96, "fans": 24}}
{"review_id": "GpQMdvGv4dbeg-QwEYzhbA", "user_id": "VGi5Jb-cGc5--lh4fvwblg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Philly, after having tried supposedly your \"best\" coffee at La Colombe, I was, might I say, missing Brooklyn gravely, and thinking that perhaps Phlidelphians might have, let's say, less superior taste buds when it came to coffee. ;)\n\nHowever, Cafe L'aube revived my faith in Philly's coffee scene. Cute, good coffee (that they roast on their own), and good nibbles, this is a great cafe to just chill out and enjoy a lazy morning. \n\nAnd those nibbles - those are their crepes. And might I add, they are the best crepes I have ever had in my life. Thick and pillowy, but still very light in texture. I was in love.", "date": "2010-10-18 01:37:33", "user": {"name": "Rebecca", "review_count": 218, "yelping_since": "2008-10-22 22:41:43", "elite": "2009,2010,2011,2012", "average_stars": 3.41, "fans": 27}}
{"review_id": "illY8QmwBDe9qlmlmNC1kw", "user_id": "ub9rjg285VVkCPISGO9Hmw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I used to live two block from here, and the friendly service, one of a kind coffee, and delicious crêpe, always have us leaving Café L'Aube with the biggest of smiles. The other day we got a 1lb of their coffee to go, and it was only then that we noticed on the label that the owner is involved in making the coffee, thats special. I've tried 3 or 4 other crêperies in the city, and this place is hands down the best.", "date": "2010-10-05 16:35:42", "user": {"name": "Hayduke", "review_count": 2, "yelping_since": "2009-06-16 22:09:40", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "My4odNVurfy1mGo-R6QbHw", "user_id": "LHWtjTG7e1NzNPYUbUo-9w", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going to Cafe L'Aube for a while now - ever since they pretty much opened in fact.  I used to live in GHO and I loved it.  I don't live in GHO anymore - and I travel to there JUST to eat these crepes.  The owner is super nice - and he sure does know his crepes.  The crepes are predicatably - ALWAYS good.  ALWAYS.  Sweet, savory, you name it - they are delicious.  I've tried a variety of them, but I've never had a bad one yet. Cheese, no cheese, mushrooms, spinach, tomatoes, avocado, DELICIOUS.  All of it is great. \n\nThe sweet crepes - the nutella, the strawberries, etc. are great.  I'm a huge fan.  \n\nI'm not a huge fan of the waffles - but the pastries, bagels, and the croissants are delicious.  Big fan.  Definitely go here to eat crepes, drink coffee, enjoy good convo with some friends, and enjoy a great, light, airy space.  The service is great, the prices are fair, and the fare is great.", "date": "2010-10-04 00:50:44", "user": {"name": "Aruna", "review_count": 564, "yelping_since": "2010-02-27 18:46:56", "elite": "2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.15, "fans": 30}}
{"review_id": "tTQA60WJs58_NVHq3hPWlw", "user_id": "iFhS15esm1T13cpbsgEF4w", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Perhaps, the best crepe place in the city and, on top of that, Cafe L'Aube has great coffee. I love the place is just a simple/no frills French-influenced/French-speaking/French-run cafe. Quality service, environment, food, and drinks. However, this place may not be suitable for xenophobes or those with anti-French sentiments. Since I'm a lover of all things French, this place suits me just fine.", "date": "2010-10-02 15:28:05", "user": {"name": "P", "review_count": 85, "yelping_since": "2010-08-29 01:01:27", "elite": "", "average_stars": 4.21, "fans": 6}}
{"review_id": "AJxWIGPdCG2-qHQkjPFBgw", "user_id": "TlSXysnwyqkMSTqWpQkg_Q", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "This place is great.  Excellent coffee, tea, and food.  Always good music playing and friendly people.  Eat their crepes- they're amazing.", "date": "2010-09-30 16:20:21", "user": {"name": "Me", "review_count": 57, "yelping_since": "2010-09-30 16:05:20", "elite": "", "average_stars": 4.14, "fans": 0}}
{"review_id": "Dvo5EiuuFngll3ZSPjre4A", "user_id": "-diePajeU2qg_MKPEo92kw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Whoa. I went there on a warm Wednesday morning before a marathon day of baking for some coffee. I only found this place because of Yelp and I'm so glad to have found it. Yet, like others have said, I almost hate to write such a glowing review because I might not get a seat next time I go.\n\nIt's on an odd block between ritzy Rittenhouse and patchy Graduate Hospital, a strip where cheap nail places and cheaper greasy spoons rub uneasily against farm to table foodie meccas and gastropubs. It doesn't look like much from outside, but inside it's a slice of what's best about Euro cafes. I had a cafe au lait and the Classique crepe. Amazing. It was like being back in Paris without the B.O. The crepe is perfect and the fillings top notch with none of the overstuffed crassness that's become so commonplace. The cheese and ham and mushrooms were just enough for all to shine and yet take nothing away from the perfect buckwheat crepe that can only be managed with more practice than I will ever get. \n\nYou'll spend at least $10 for a drink and a crepe, but it's worth it. Anyway, isn't Starbucks getting up there anyway? And it will never manage food like this. \n\nThe walls are painted in cheery, bright hues that light up the narrow cafe. There's WiFi but I didn't use it. I couldn't bring myself to do it. I read an old fashioned paper and ink magazine and enjoyed the moment. It's a hike across town for me, but I'll be back. It's a perfectly charming place. It makes me regret not getting that place in GradHo I was considering when I moved last. Is it too late to change my mind?", "date": "2010-09-29 22:20:22", "user": {"name": "N", "review_count": 47, "yelping_since": "2009-05-16 01:35:19", "elite": "", "average_stars": 4.25, "fans": 4}}
{"review_id": "KZA_W3VVvsNmoinV98hN-w", "user_id": "74UCB3QqU9ZiWW8fT5sVKw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cute neighborhood bistro that we never would have found if it weren't for Yelp. \n\nThere was only one person working so service was a little slow, but we didn't mind. The person working knew nearly everyone who came in, which told me that this was a friendly neighborhood place. \n\nIf I visit Philly again, I'd go back", "date": "2010-09-20 19:27:49", "user": {"name": "Monica", "review_count": 40, "yelping_since": "2010-01-19 23:26:05", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "n7ZBLmYrQAuvPoz9eqNnDA", "user_id": "IinC5q9AMBX6w9DJc43lSg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "First impressions are everything. With every cafe, deli, and Salad Works using their wall space for mediocre local crap-art, we were immediately impressed with L'Aube for its choice of awesome featured works. Edith Piaf resonated throughout the air. A kind, thick French accent ran the show. A light perfume of crépe tickled our noses. Surely, we could not still be in Philadelphia. We suspended disbelief for that hour or so, and dove in head first. She had the \"Le Malin\", a savory crepe filled with brie, turkey, honey, and almonds. As a frequent dabbler in the turkey/brie cheese combo, she named this one to be the most enjoyable in life...like, ever. He had the \"Madagascar\" , an INTOXICATING crepe concoction with Grand Marnier, vanilla beans, cinnamon, and maple syrup.  \"Magnifique...tré magnifique\", he reported. nomnomnomnomnommnomnom", "date": "2010-09-14 18:19:48", "user": {"name": "Patrick", "review_count": 11, "yelping_since": "2010-09-09 20:36:42", "elite": "", "average_stars": 3.91, "fans": 0}}
{"review_id": "DYz4rU2bdxnGsDhsxLBWiA", "user_id": "5V7zJZBnz_fyIeHj2fJAzw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This little cafe is great for brunch.  The crepes are delicious and the coffee is amazing.  They have a few tables outside and the inside is nice too, with French music playing in the background (and free Wi-Fi).", "date": "2010-09-06 17:17:13", "user": {"name": "Dima", "review_count": 15, "yelping_since": "2008-07-20 17:57:59", "elite": "", "average_stars": 4.44, "fans": 1}}
{"review_id": "y2s0Orc_2HfF5Mqz1muKjg", "user_id": "5adYZXIY5-ZvdKSfC4QIDg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'm hesitant to leave this stellar review coz I really don't want this place to get crowded! But I can't resist raving about this place, so here goes...\n\nI found this place on yelp while searching for a good cafe to read/chill, so I dragged two friends with me on a lazy Sunday afternoon. There was plenty of parking (free on Sunday! yay!) nearby, which is a huge plus. Despite the small size of the place, it wasn't crowded at all. The three of us ordered la vanille (sweet crepe), salmon & spinach savory crepe and avocado+mozzarella vegetarian sandwich, plus regular coffee, hazelnut coffee and latte. \n\nIt took a while for the food to come...but as soon as I saw the crepes, all impatience melted away. They were perfect looking! Slightly crispy on the outside, with that beautiful lace-like caramelized pattern, and soft on the inside. Unlike most crepes here in the US, these were NOT filled with insane amounts of filling such that you can't taste the crepe itself. My friend's comment about his salmon & spinach crepe: the salmon was fresh it was emotionally touching. The veggie sandwich also looked very fresh and perfect for summer. \n\nThe only reason I knocked a star off was because of the coffee, which was too bitter for my taste. But it's not the type of over-extraction bitterness you get from Starbucks, this was bitterness from deep roasted coffee, so more of a personal taste issue than misstep. \n\nService was very friendly, not overly attentive, nor ignorant. The owner was very friendly and chatty. All-in-all, a great experience. This is now my new hang-out place!", "date": "2010-08-30 15:08:29", "user": {"name": "Jennie", "review_count": 578, "yelping_since": "2009-01-19 05:21:38", "elite": "2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.68, "fans": 46}}
{"review_id": "2dQOooYRhIlnBW7vMjouFA", "user_id": "0mYNAVDIzW4fzgAQ5opGWg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 3, "funny": 3, "cool": 2, "text": "Had a great first experience at Cafe L'Aube. Have been wanting a crepe ever since my friend's internet show about food trucks featured the crepe truck over at Drexel's campus, but I just couldn't get myself to make a trek all the way across town just in the name of crepes. However, I could get myself to Cafe L'Aube, and I couldn't be happier that I did. \n\nThe place is quaint, and new, and nice. My crepe was delicious, and fresh, and different. I asked for ketchup (I knew they weren't going to have it) and I was right, they didn't, but in truth my egg, crispy bacon and goat cheese crepe didn't need it. I couldn't help but ask. Sometimes when I'm hung over I desire ketchup with my eggs even though I usually don't use it.\n\n[sidebar] I apologize because I think some of my reviews make is sound like I drink too much and am always hung over on the weekends- this is not true. I swear. it is just how it seems in my reviews. [end sidebar]\n\nAnyway, my bf had the strawberry and nutella crepe, and we basically shared each, and had some DELICIOUS coffee. As I was sipping my coffee after we had eaten the owner came and sat next to us and a conversation about Philadelphia erupted between us. I don't really talk to people I don't know (funny since I never shut up on here). But the owner was friendly and knowledgeable and we talked about what we love about Philly and what we'd like to see change, and about how horrid the prices of houses in the actual city in nice areas are, despite there being no public schools you could ever send children to. It was a nice conversation, and he was very entertaining. The food and coffee was great. And I will definitely be looking forward to a repeat visit some time in the future.", "date": "2010-08-24 18:34:28", "user": {"name": "Mary", "review_count": 218, "yelping_since": "2010-03-10 17:22:09", "elite": "2010,2011,2012,2013", "average_stars": 4.08, "fans": 17}}
{"review_id": "MkSGud-zQ0wlKCfhfOpjqA", "user_id": "kX8VElJe7Pj-cJ-yZAzHdA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've never really been crazy for crepes before, mainly because I so rarely have them and the ones I ate before were lackluster. Still, I was curious when i heard such good things about L'Aube, and last Saturday I decided that crepes were exactly what I needed at noontime.\n\nWas I right. I thoroughly enjoyed my strawberry and Nutella crepes, which was to be expected. My gf's omelette-eseque crepe was the game changer though. Egg, crispy bacon and goat cheese... this is what I'll get next time I'm there. Decently priced, not too filling, and just enough to handle in one sitting.\n\nThe coffee was also noteworthy, coming out nice and hot and maintaining its taste to the last sip. The kicker was the owner, Jean-Luc, talking to us at length about anything that came to mind, from the layout of the city, to the American education system, to why the French don't like ketchup. You can't get that glorious type of pure Frenchness anywhere else.", "date": "2010-08-09 15:25:14", "user": {"name": "Alexander", "review_count": 117, "yelping_since": "2010-05-10 19:06:34", "elite": "2010,2011", "average_stars": 3.94, "fans": 9}}
{"review_id": "mheAnwJO8q8ay3stBikS0Q", "user_id": "YwMD-AVT67fmYRGxnlRSPA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really liked the vibe of the place. Laid back but with good food and drinks. I was able to read my book here in peace, despite there being 7-9 other patrons.", "date": "2010-08-08 17:23:44", "user": {"name": "Dan", "review_count": 262, "yelping_since": "2009-12-30 08:43:10", "elite": "2010,2011,2012,2013,2014", "average_stars": 3.89, "fans": 12}}
{"review_id": "_dLzA_oO6Ll_ph2FnAdLmw", "user_id": "oGhFfL-ag6SYT2v1L-SakQ", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Here's definitely a case where giving half stars would be brilliant, cuz it's very much a 3.5 star-worthy place. L'Aube is nice to have in the neighbourhood, it's great that they roast their own beans, and it's generally a very nice café experience.\n\nUnfortunately, those beans always leave a bit to be desired. While better than a Dunkin or a Starbucks, it always feels like there is something missing, like it should be better and more interesting. This is particularly true of their iced coffee, which is just kind of meh. Pumpkin, up the street a bit, is significantly better.\n\nTheir pastries and baked goods are typically quite delicious, however, despite the bagels occasionally resembling paving stones.\n\nThe crêpes, most importantly, are very, very good. Worth the trip in and of themselves. Plus the staff is always quite nice.", "date": "2010-08-07 14:41:47", "user": {"name": "Sam", "review_count": 25, "yelping_since": "2009-08-30 15:02:36", "elite": "", "average_stars": 3.31, "fans": 1}}
{"review_id": "WbLySxecQ1yn_rahik-gMQ", "user_id": "ouODopBKF3AqfCkuQEnrDg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The crepes are amazing and they have so may varieties.  The hollandaise is my favorite, followed closely by the nutella, depending on whether I'm in a salty or sweet mood.  The coffee is nice and strong, and there is free wi-fi.  Nothing like caffeine and good food to get you in a studying mood if you have work to do.", "date": "2010-07-31 19:42:41", "user": {"name": "Danan", "review_count": 2108, "yelping_since": "2010-04-09 05:28:01", "elite": "2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.57, "fans": 134}}
{"review_id": "eQd_3AsEag2rRWa8EZP7AQ", "user_id": "yM_tCmo2RtprduuF5lwVCA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 5, "cool": 0, "text": "I was stuck in the bowels of Temple for far too long when I finally discovered the lovely Cafe L'Aube.\n\nA small cafe that is easy to miss if no one is sitting outside. This whole East Coast thing of just having a single door still trips me out. (Calfornnia gurl at heart. oh haaay). \n\nThe inside of the cafe is cute and small with free Wi-Fi. But most importantly, the food is DELICIOUS. I had the Nutella, banana, and strawberry crepe and a savory crepe with bacon, spinach, and mushroom. Modestly priced around $5-8 per crepe and a delicious espresso for only $2.\n\nBest part of the shop? The owner Jean-Luc. Extremely personable and asked us how we discovered his store (TY Yelp). And when we asked him about how he got into the crepe business he said \"Well I'm a Black man who was born in France. The French exploited my people, so now I exploit their cuisine!\" \n\nFantastico Jean Luc, keep up the good work exploiting those who have wronged you. My inner fat child, Bertha approves of your delicious, delicious crepes.", "date": "2010-07-23 19:28:55", "user": {"name": "joyce", "review_count": 57, "yelping_since": "2007-10-25 20:32:43", "elite": "", "average_stars": 3.98, "fans": 3}}
{"review_id": "F-fi3O9TY5pLvxMiHqQz_A", "user_id": "tt1UXc0bC0pVY4WmRxIs4w", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nowhere satisfies your crepe craving better than Cafe L'Aube.\n\nMy friend and I came here a few months ago after we had a mad craving for crepes. The good reviews were also a deciding factor to try this place. It was a great decision! Yay!\n\nI ordered a sweet crepe, Nutella Strawberry. DELICIOUS! My friend ordered... uhh... well, that's not important. I know she enjoyed it too!\n\nNot only is it delicious, but it's also very well-presented. \n\nI'll definitely be back! :)", "date": "2010-07-21 05:27:31", "user": {"name": "Jennie", "review_count": 65, "yelping_since": "2010-03-05 02:49:42", "elite": "", "average_stars": 3.15, "fans": 6}}
{"review_id": "Cw0kVL3pNV9LgQftpZUl0g", "user_id": "mXsINkCBoe9KGBpDg5zqeQ", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "this is the cutest place i have ever been. the owner is the sweetest man ever; so talkative, attentive & personable. we talked about new york, & he was familiar with where my friend & i went to school! before us, he talked to this couple about belgium. his iced teas have simple syrup in them already--just a warning if you don't like simple syrup. i told him i wanted a strawberry & cinnamon crepe & he told me i should get this strawberries and cream one instead & it was AMAZINGGGG my friend got a nutella crepe & loved it too, but i think nutella is gross, so i cannot corroborate her story. moral of the story is: we walked for miles in the scorching sun on the hottest day of june to get to this place, & it was WELL WORTH IT. if you're in philly, you need to go to this place. & eat some delicious crepes & make a new friend while you're at it! also: FREE WIFI!", "date": "2010-06-23 03:02:57", "user": {"name": "Debby", "review_count": 145, "yelping_since": "2008-01-05 22:02:20", "elite": "", "average_stars": 3.59, "fans": 3}}
{"review_id": "MZnKE7vNBMyBYwbevK4TVw", "user_id": "FcihLVh-6UqNPGoekY_ceg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best croque monsieur I've ever had, and an excellent crepe.  Also a delicious frappe although I'm not sure the difference between that and an ice coffee at this particular place.  Also a delicious homemade cookie for dessert.  Friendly staff, will definitely return.\n\nOnly 4 stars because service was S-L-O-W and we were the only customers with an order at that point.   Don't go here if you're in a hurry, it's not fast food.", "date": "2010-06-22 14:17:15", "user": {"name": "wonderful", "review_count": 48, "yelping_since": "2007-09-30 18:51:05", "elite": "", "average_stars": 2.65, "fans": 2}}
{"review_id": "BnEjUbpX217Zpwz329mefg", "user_id": "HDiU7ZlOUaNOoflQb1sEtA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "One of the few coffee shops  in the city that roasts its own beans. Great espresso drinks + as before - great staff - super welcoming + friendly. None of the 'tude of the other good places to get coffee around the city. Plus crepes too!", "date": "2010-06-10 13:57:08", "user": {"name": "Andrew", "review_count": 87, "yelping_since": "2006-04-06 20:25:51", "elite": "", "average_stars": 3.46, "fans": 5}}
{"review_id": "rcuyde5agzZQL5M5Qv44DQ", "user_id": "vVDIUaGtHaPnw4zBHQPNVQ", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place is not nearly as good as everyone is claiming it is.\n\nMy issues with it? The boss. The health code violations. The pretension of it in general. \n\nI have been here a few times and each time have been greeted with sarcasm, condescension and overall rudeness. The employees for the most part have been okay, but the owner is not friendly. Furthermore, while on a trip to the bathroom one day, I saw that the \"sinks\" they wash their dishes in are not set up according to health code. You are meant to have a sink full of hot water, a sink full of the blue water with tablets to sanitize and then a sink to rinse. All they do is use soap and old sponges, etc. to \"clean\" their dishes.\n\nSomeone should report them.", "date": "2010-06-04 04:30:41", "user": {"name": "Sarah", "review_count": 1, "yelping_since": "2010-06-04 04:26:26", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "n9VFsJWh6KhBPpytuL0nMA", "user_id": "FzgeSPVonioMutmnyIMnyA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nestled in a grungy spot on South St. next to Tritone and Bob & Barbara's is an unpretentious Parisian-influenced cafe with a surprisingly good menu and a quality cup of coffee. I say \"Parisian-influenced\" because the atmosphere isn't evocative of a Parisian cafe, but the flavors certainly are. It's easy to miss, but follow the sound of French music and you'll find Cafe L'Aube.\n\nOne of my favorites on the menu is the Breton, a toasty, buttery baguette with brie, apple, honey, almonds, and coconut. As fantastic as it sounds. The coffee doesn't disappoint either, it tastes like a medium roast, but strong and full-bodied. Jean-Luc and crew are friendly and happy to make suggestions from the menu, which is surprisingly large for a small cafe. \n\nWhen I want to avoid the crowd and decibels of some of the hipper cafes, or I want to get some reading or work done, Cafe L'Aube is one of my top choices. You won't feel like you're in Paris at Cafe L'Aube, but it'll taste like you are.", "date": "2010-05-10 14:49:35", "user": {"name": "Jason", "review_count": 47, "yelping_since": "2010-05-08 14:45:21", "elite": "2010,2011", "average_stars": 3.82, "fans": 13}}
{"review_id": "XlV53MuuiZCBprYQrfmk3A", "user_id": "pIME52EWdvbJxj-l7cB5Pg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I just tried L'Aube today on a lunch-hour whim (after stopping in at Sweet Freedom Bakery down the street) and was delighted by what I found. \n\nL'Aube is brightly colorful, with a relaxed and friendly vibe. They have a nice broad menu of sandwiches and sweet or savory crepes. I went with the Croque Monsieur Vegetarian, and was entirely satisfied: melted mozzarella, fresh avocado and a generous amount of basil on golden toast. I don't usually go for white sandwich bread, but this one was slightly herbed or something, and seemed just the right thing. Crispy, warm, and well-balanced. Came with a small mixed green salad , a tiny pitcher of balsamic on the side. Very fresh. Again, just right. I was there for the eats, and am not a coffee connoisseur, so cannot speak to the beverage selection.  \n\nWas about $8 for sandwich + salad. Pretty standard for the neighborhood. I'll be recommending it to others, and am sure I'll go back again.", "date": "2010-05-05 20:44:33", "user": {"name": "Allegra", "review_count": 1, "yelping_since": "2009-06-13 16:42:06", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "ZL-rkZ0TKo-LtE61dXl2rQ", "user_id": "RgDVC3ZUBqpEe6Y1kPhIpw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 7, "funny": 0, "cool": 4, "text": "A delicious little Parisian café with all the traditional trimmings. Eye opening espressos, belly satisfying crepes, and a darling Frenchman to serve you. \n\nGreat spot to do some reading or tap away on your laptop. Reminds me of La Colombe with quality beans and that charming feel. With a location around 16th and South, you can be sure that this place isn't fraught with people and thus, a perfect spot to spend some alone time.", "date": "2010-05-04 18:14:18", "user": {"name": "Monica", "review_count": 1282, "yelping_since": "2009-02-23 14:08:31", "elite": "2009,2010,2011,2012,2013,2014,2015,2016", "average_stars": 4.17, "fans": 804}}
{"review_id": "4MPBDOmKGUFPVbTMOQbzYw", "user_id": "B3SZr_nId2n7tEaT88Nopw", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love coming here for crepes of all sorts.  I come here in the summer to meet with my friends all the time in the summer.", "date": "2010-05-03 16:30:51", "user": {"name": "Y", "review_count": 54, "yelping_since": "2010-03-23 13:59:51", "elite": "", "average_stars": 3.7, "fans": 3}}
{"review_id": "zrsqz2rESZtGl70VHzqWeg", "user_id": "0PRaHvbYfeANSUxw1CFIvg", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "My new favourite crepes and coffee place in the city. Very inviting place, excellent crepes (Jean-Luc does not hold back on stuffings) and really good house roasted coffee.\nIt's a small place, so be prepared for a slow casual meal especially when they are busy.", "date": "2010-04-24 03:46:45", "user": {"name": "Ange", "review_count": 38, "yelping_since": "2009-01-05 21:25:34", "elite": "", "average_stars": 3.98, "fans": 1}}
{"review_id": "qFQk4y7SNnllzpGEIG75JQ", "user_id": "WQe6P6Sp1RUT5Lc5jUDGwA", "business_id": "2Q5gjf_K68145UdUyKGAaw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Woo! Just ate here this morning for the first time. They have that fancy pour to order coffee...don't know the technical term for it. So delicious. I also had a fruit crepe...really really good. I'll definitely be going back!", "date": "2010-04-16 13:36:55", "user": {"name": "Jenna", "review_count": 16, "yelping_since": "2009-11-12 18:07:05", "elite": "", "average_stars": 4.5, "fans": 1}}
