{"business_id": "Ku2b7oA9s56mHoflb5lJ2w", "name": "Alma Del Mar", "address": "1007 S 9th St", "city": "Philadelphia", "state": "PA", "postal_code": "19147", "latitude": 39.9373099378, "longitude": -75.1580101624, "stars": 5.0, "review_count": 80, "is_open": 1, "attributes": {"RestaurantsTableService": "True", "BusinessParking": "{u'valet': False, u'garage': False, u'street': None, u'lot': None, u'validated': False}", "OutdoorSeating": "True", "BikeParking": "True", "Alcohol": "u'none'", "WheelchairAccessible": "True", "BusinessAcceptsCreditCards": "True", "BYOB": "True", "WiFi": "u'free'", "RestaurantsTakeOut": "True", "Corkage": "False", "RestaurantsDelivery": "None"}, "categories": "Coffee & Tea, Seafood, Restaurants, Fish & Chips, Food, Mexican, Salad, Breakfast & Brunch, Sandwiches, Comfort Food", "hours": {"Monday": "8:0-20:0", "Tuesday": "8:0-20:0", "Wednesday": "8:0-20:0", "Thursday": "8:0-20:0", "Friday": "8:0-20:0", "Saturday": "8:0-20:0", "Sunday": "8:0-20:0"}, "category_list": ["Coffee & Tea", "Seafood", "Restaurants", "Fish & Chips", "Food", "Mexican", "Salad", "Breakfast & Brunch", "Sandwiches", "Comfort Food"], "stratification_tag": "Coffee & Tea"}
{"review_id": "bgeyhcBN8f7-14PTW9rEvA", "user_id": "Dc7jv17Gkm6YunWbKYaQ0A", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 4, "funny": 0, "cool": 4, "text": "Finally made it over here for brunch this past weekend. What a great experience! \n\nServers were very friendly and nice. If you go for brunch \"early\" think like 1030AM, there was NO ONE there which was great. We sat outside which was nicely decorated. Very spacious. Good menu choices but not overwhelming. We had the breakfast burrito and the tres leches bread (\"pan\" on the menu). Fantastic! The refried beans instead of rice in the burrito was really great and kept it from being dry. And the home fries were great too. The pan was delicious. Not overly sweet honestly, although it was quite a large helping of food. Fresh strawberries and pecans finished it off nicely. I also had a mango lemonade which was nice and not overly sweet. \n\nPrices were reasonable, service was quick. Whats not to like! Finally a place that does brunch just differently to make it feel familiar yet better than many other brunch experiences around here. Check em out! And go early, because it does get super crowded later. Oh, they also were setting up live music as we left, which we've heard from walking around the street and is great.", "date": "2021-12-15 22:36:00", "user": {"name": "Solomon", "review_count": 268, "yelping_since": "2016-12-26 17:33:45", "elite": "2018,2019,20,20,2021", "average_stars": 3.79, "fans": 9}}
{"review_id": "i9KiRPoBjZ2nyT2ykMXvVg", "user_id": "l1BxkplUwWczHNulfYEkIg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Glad my friend decided on this place cause they are definitely worth a try! Tucked away between Italian market stores, this place has both indoor and outdoor seating options. My friend and I came on a chillier day and it wasn't too bad sitting outside since it's tented and has individual heating stands. The staff were welcoming and quickly showed us to our seats. I loved the extensive menu that covers all day meals from breakfast to dinner. We ended up sharing a few items including guac and chips, calamari tacos and lobster benedict. We had come during the day time and it wasn't terribly packed but in terms of service time, the food did take quite a while to prepare. We got our guac and chips and finished the whole serving of chips, got a refill of chips and almost finished that, all while we were having more lengthier casual conversations, before we got our other foods. The guac was really refreshing though, though a bit chilled. As for the calamari itself, that was really yummy and had a nice batter ratio. It didn't necessarily need the taco piece of it though as the two didn't quite fit together. For the benedict, the lobster was a bit dry and tough but otherwise can't go too wrong with lobster. Overall, a solid restaurant with some potentially good menu options but would only come here on less busy hours.", "date": "2021-12-15 11:04:14", "user": {"name": "Jeffrey", "review_count": 151, "yelping_since": "2014-08-07 12:40:14", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.84, "fans": 6}}
{"review_id": "N9ZcwMZ1g827jyEYNJlL-Q", "user_id": "hQjN1FuYaB4pQACZwfrclw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 2, "text": "Alma del Mar has been on my list for the better half of a year, and I finally made my way for dinner with a friend this week. Food is a solid 4-4.5/5 and the service is a 5/5.\n\nThere were so many items on the menu we wanted to try, so we opted for ordering a bunch of things to try, versus any entrees. We ordered the grilled kale salad $15, crab and corn chowder $10,  grilled cauliflower $13, elote $4, calamari $18, and had the pineapple water $3. In total our bill came to $69 before tip and we both went home with 2 full boxes of leftovers. \n\nThe crab and corn chowder was flavorful, and full of crab. The grilled kale salad was delicious with the char, but slightly overdressed, the shrimp was good. The cauliflower was delicious, loved the salsa rosa and salad that it came with and the portion was lovely. The elote was one of the best I've had, get it. The calamari had such a nice light batter and was well fried and seasoned. Our server forgot our pineapple water, and kept apologizing and was so kind through our night. The pineapple water brought me back to my travels in Central America, would definitely recommend, it will ship you straight to the tropics. Also, since we shared everything - I figured they would bring us 2 spoons for the soup but they divided the portion into two bowls which was so thoughtful and cute. Lastly, at the end of our night we were brought out flan for dessert on the house. Also *BYOB* no corkage fee!\n\nApparently they were also featured on queer eye, I had no idea. But I loved the food, the service, and the happy smiles of the lovely staff at this family owned restaurant. I would definitely recommend a visit and I can't wait to go back to try some actual entrees! (Although I swear some of their appetizers like the cauliflower can stand alone as an entree.. we ordered enough food for 4 people hah)", "date": "2021-11-12 15:20:48", "user": {"name": "Tiffany", "review_count": 655, "yelping_since": "2011-03-23 20:49:36", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.55, "fans": 58}}
{"review_id": "6EGn6lzxguCW8ThPZIfS3Q", "user_id": "Y8feumhKHDt8f7O1Zlsurw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is the BEST kept secret in all of Philly. There is absolutely no doubt that if this restaurant was on Broad St or Rittenhouse Square, they would blow Parc and Capital Grille away. If there was a taste test, my money would be on Alma Del Mar's plate. I kinda want to keep this a secret, so I can enjoy their Surf & Turf and Lobster Benedict with the same convenience I always have. Do not underestimate this humble mom & pop shop. The quality and portion is a phenomenal value. This place is consistent, friendly, and a jewel to Philly food. Shhhh  Check them out, you're guaranteed to be thrilled, but don't tell anyone!   P.S. It's a BYOB... what are you waiting for?!", "date": "2021-10-12 18:39:17", "user": {"name": "L", "review_count": 38, "yelping_since": "2012-06-16 22:56:07", "elite": "", "average_stars": 3.28, "fans": 0}}
{"review_id": "zlxvyaEGBfCEKl9c0zLjXw", "user_id": "Yi9SBOp4R9EMY2QLQ_Obwg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 2, "text": "Excellent breakfast on a gorgeous weekday morning. I had a very good, spicy (which I love) Seafood and Grits. The two others dining with me got eggs their choice: (1) poached and (2) omelette with tomatoes and carmelized onions. Came with home fries with peppers and multigrain toast. Waited on by owner and she did a great job in serving us and our requests for lemons and straws, for example. Would definitely go again!", "date": "2021-09-30 18:16:20", "user": {"name": "Joe", "review_count": 17, "yelping_since": "2011-04-22 04:47:07", "elite": "", "average_stars": 4.12, "fans": 1}}
{"review_id": "R1VfgqZ7Hyt8hKA6erpLhA", "user_id": "EOajY1L3ole3gLTCZ2xw1g", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This was excellent octopus. The outside was well charred and smoky. The meat was tender. The portion was the largest I've ever seen. The price was a bit high. But not crazy.", "date": "2021-09-12 16:49:22", "user": {"name": "Jack", "review_count": 1146, "yelping_since": "2014-10-17 13:45:20", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.82, "fans": 100}}
{"review_id": "xnrNyDBFmUXk_MhyFp2sPQ", "user_id": "VN3apynnuv00bFwNOnXqqg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "If you haven't been here yet, you are missing out! My boyfriend and I have seen their Queer Eye episode a bunch of times and have been dying to come all year. I have to say that I didn't have a single thing that I didn't enjoy. You read that right: everything was delicious!\n\nWe started with the calamari, which had its own unique texture due to the maseca coating. I was really surprised at how well it worked! My boyfriend had the swordfish, which he ate all of so I guess it was good. My shrimp tacos had to be one of the best I've ever had--that aioli was EXQUISITE. We finished off with churros, a true classic. Because of the heat warning that day, they also supplied a free glass of an agua fresca of your choosing. This family is truly so caring about their business and only want to feed people good food, so definitely give them a visit!", "date": "2021-08-30 13:04:37", "user": {"name": "Jada", "review_count": 300, "yelping_since": "2014-09-05 04:24:48", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.97, "fans": 20}}
{"review_id": "grwmYs0N6DOpHW6srby5Ig", "user_id": "5qm00VCxtFHxG2jkC1k-WA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "I have looked at the Italian market for years but admittedly never looked twice at this place until after we saw it on the queer eye episode. \n\nThe outdoor area is lovely and the fans make it refreshing even on a hot summer night. We got the shrimp and octopus ceviche to start which was slightly sweet with generous probs of seafood. I got Alma's branzino and my husband the airline chicken. The fish was well cooked and flavored gently so it's not to overpower the delicate fish. The chicken was satisfactory but not stellar. Given that the place is specialty is seafood this was probably not the best choice. \n\nThe real star of the experience was Alma herself. From the moment we stepped in we felt welcome as though you read a table in someone's home. \n\nFor three courses we spent $80 and given that the place was BYO this felt very reasonable. Will be back soon.", "date": "2021-08-07 19:02:38", "user": {"name": "Phillip", "review_count": 4, "yelping_since": "2012-08-03 17:11:12", "elite": "", "average_stars": 2.17, "fans": 0}}
{"review_id": "9L0rhEbtcD2d9UrCVVCN5g", "user_id": "B7jkcVMabicI4yloopGKVQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 4.0, "useful": 3, "funny": 1, "cool": 1, "text": "My husband and I both tried the Crab and Corn Chowder, and split a Mango Salad for lunch. The soup was our favorite. It was creamy without being overly rich, and the corn was perfectly crisp and fresh. The salad was ok, but the crab lacked flavor. It seemed like it came from canned or frozen. I wouldn't order it again. \n\nWe tried to come again for breakfast the next day. At 8:30 am, the restaurant was closed. Maybe next trip.", "date": "2021-08-05 14:16:45", "user": {"name": "Jessica", "review_count": 218, "yelping_since": "2011-09-10 12:28:05", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.53, "fans": 38}}
{"review_id": "muM4RysUsGloNLgiH0eZNg", "user_id": "nNrdU3_w8KPFasq0RCPlvw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ew frozen milly yucky lobster on my Benedict and the breakfast nachos were not great. The coffee was lovely and the patio cool but the food was just so so", "date": "2021-07-29 01:49:47", "user": {"name": "Anne", "review_count": 64, "yelping_since": "2008-05-13 03:46:28", "elite": "", "average_stars": 3.14, "fans": 0}}
{"review_id": "H5AQlC3dL1j7psSd_P1NmQ", "user_id": "RkY3bDoxG4a1FSA_tuD3Eg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "Lobster eggs benedict is a must.  and the tres leches pain perdu (french toast) for dessert if you have room.\n\nA cute place to people-watch and dine outside in the Italian Market. The service was warm and friendly on a Friday morning, food came out quick, and was very fairly price. \nThe lobster meat was heavily seasoned and cooked to juuuust-until crispy, no mush factor. There were a couple claws in the dish too--they didn't skimp.\nFriend got a hibiscus iced tea which was very good, though also very sweet if you're into that. The iced coffee was just okay.\n\nI would actually come back for that lobster benedict...and I don't return to many places twice.", "date": "2021-07-11 23:32:06", "user": {"name": "Suji", "review_count": 324, "yelping_since": "2012-09-11 06:17:18", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.09, "fans": 24}}
{"review_id": "PU6LJ1w-RUK9hlWHoaPAgA", "user_id": "9ySxikrRB0ZSnwVm7hO_MA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Big fan of this place! The pulpo is divine--I've been to the restaurant twice but have ordered the octopus three times. Perfectly cooked and charred. Comes with grilled watermelon, which pairs beautifully with the octopus. Generous serving of silky avocado, too. Highly recommend. \n\nThe ceviche anticuchera is also fantastic and also comes with generous heaping of avocado. Make sure to ask for additional chips--you'll need it to devour the dish!\n\nVery intimate and wonderful service. Was able to speak to Alma afterwards and learned about the queer eye episode! Watched after my first time, of course!", "date": "2021-06-29 17:25:08", "user": {"name": "Raymond", "review_count": 4, "yelping_since": "2021-06-27 18:05:10", "elite": "", "average_stars": 4.75, "fans": 0}}
{"review_id": "sYkR7JahUPtBffqPqJqTuw", "user_id": "kdoaIx7_URwOJl9i_irPsA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Every single dish was hit after hit. From the ceviche to the crab chowder, to the amazing fried branzino to the generous portion of wonderfully charred octopus -  DELICIOUS. This food must have been cooked from the soul. I washed it down with a refreshing horchata - just what I needed to finish off what proved to be an incredible anniversary dinner. I would definitely come back again if ever in the Philly area. This place is just special.", "date": "2021-06-20 00:35:13", "user": {"name": "Eliza", "review_count": 171, "yelping_since": "2011-06-08 02:05:42", "elite": "2013,2014", "average_stars": 3.58, "fans": 4}}
{"review_id": "kgs8nbG3NKs0bCAoUp-4rw", "user_id": "3n0_L8nKX4LcQG1yF61wtA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Decor/service: mostly outdoor restaurant with a nice vibe in the middle of the outdoor market. They had live music going which is not my favorite thing but if it's your's then this may be the place for you. Servers were friendly but they deff need a better reservation system as they called me about being late even though I was sitting at our table already. Looks like they were using pieces of tablet paper to keep track of reservations.\n\nFood: the brunch was excellent. Everything I tasted was flavored well and cooked well. The shrimp Benedict was above average and the home fries have a bit of a kick to them which I love. Deff a must try for brunch.", "date": "2021-06-13 04:51:45", "user": {"name": "Kyle", "review_count": 442, "yelping_since": "2017-08-04 15:48:45", "elite": "2018,2019,20,20,2021", "average_stars": 3.35, "fans": 3}}
{"review_id": "HU9gD0HE409vCLuMS26k5g", "user_id": "hmTCHIW3DEuO1UyKe_ZXkQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 1.0, "useful": 0, "funny": 4, "cool": 0, "text": "Service was horrendous. It's like they went out of their way not to attend to us.  Literally everyone else had water except our table.  They took so long with our food (again many seated after we were and got their food ahead of us) I didn't even get to eat it.  I ended up throwing it out as I was too angry to eat.  I'm sure the food is good but don't go expecting decent service.", "date": "2021-06-06 20:18:03", "user": {"name": "Eve", "review_count": 1, "yelping_since": "2021-06-06 20:18:02", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "P61n9J6-Gl9GrbfAsa2YGQ", "user_id": "xF8VbLP7zTeC2HTqOpclnA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "AMAZING food would be an understatement.\nWonderful customer service. My family came here around 11am for brunch seeing the wonderful reviews. We were a group of 5, and had the following: \nStrawberry Explosion Smoothie\nWild Strawberry Smoothie\nVeggie Burger (pictured)\n2 X Eggs your way\n3 Egg Omelet\nSide of Fruit\n\nNot to mention live music\n\nI wish we found this treasure sooner and would come come all days we visited Philly.", "date": "2021-06-05 16:29:35", "user": {"name": "Milly", "review_count": 19, "yelping_since": "2019-09-16 20:28:25", "elite": "", "average_stars": 3.86, "fans": 0}}
{"review_id": "MDAFFYCe7wtfEz1P_EY4XQ", "user_id": "4a_xeOpwjczDQhHR5mvkyg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This cute place is a gem! Great customer service, live music and amazing food! Definitely worth a visit when in Philly", "date": "2021-06-05 16:26:46", "user": {"name": "Mary", "review_count": 17, "yelping_since": "2016-06-12 13:31:49", "elite": "", "average_stars": 4.39, "fans": 0}}
{"review_id": "_5-m3Lean2BtXYnj7_RjNg", "user_id": "5apWVR7R45quFUWbN0r7kg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Strolling the Italian Market and stopped here for lunch with a friend. It's only a year old so I never saw it due to being locked away for the past year. \nIt is a KEEPER! We shared molletes and a pear and Gorgonzola salad. \nThe molletes is an open faced sandwich with chorizo, avocado, cheese and more. It is to die for!! A bit spicy and so tasty I was blown away with every bite. It's big enough to share. \nThe salad was dressed perfectly and was loaded with Gorgonzola and perfectly roasted pears. \nService was great and outdoor space was great. \nDon't miss this little treasure.", "date": "2021-06-03 21:56:24", "user": {"name": "Fredi", "review_count": 37, "yelping_since": "2015-03-27 19:32:13", "elite": "", "average_stars": 4.08, "fans": 1}}
{"review_id": "XggI_03zrpyHjXpnGCMVAQ", "user_id": "statZgQzKdGg0S6WrU5KmQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The food was amazing. Loved the outdoor seating and service was great. Will come back again next time I'm in Philly.", "date": "2021-05-25 15:48:47", "user": {"name": "Melissa", "review_count": 6, "yelping_since": "2012-01-26 21:20:19", "elite": "", "average_stars": 4.17, "fans": 1}}
{"review_id": "_8cz38s5rer-acfNryk3tw", "user_id": "qwscL6BjnpPwxZMPt4sfnQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I had my graduation brunch here with my family and friends and they were super accommodating. The food was DELICIOUS and the place was super cute!! I cannot recommend this place enough!", "date": "2021-05-21 00:41:34", "user": {"name": "Ale", "review_count": 4, "yelping_since": "2019-05-21 21:25:02", "elite": "", "average_stars": 3.25, "fans": 0}}
{"review_id": "0nEADCUk1pIe8emwwosvFg", "user_id": "29K-usmZfVDeIaQ85EG54A", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 7, "funny": 3, "cool": 5, "text": "An absolute hidden gem, skip the apps, go straight for the fish! This is the place to visit if you want to experience a pre-covid authentic restaurant dining experience. Dress warmly if it's later at night. BYOB.\n\nMust get: octopus*, bronzino, mango salad\nMeh: calamari\nMissed out: all the fishes\n\nIt is so refreshing to write a restaurant review after the long covid hiatus. It is without a doubt that many establishments have struggled to balance a traditional restaurant experience, amazing quality food, and shortening each dining experience to allow for appropriate sanitation. However, Alma Del Mar figured it out...and it does so by having only 1-2 people take on the role of the cook, waiter, and greeter. They march at their pace, and your job is to enjoy the show.\n\nI gotta say, before even going further into the experience, I really loved this place - we went during cinco de mayo and they had (slightly loud) live music playing and the overall energy was intoxicating. \n\nFor food, the (everything) is very fresh, and I still can't stop thinking how Alma managed to put mustard on fish, and made it so unforgettable. Seriously, the food here is so filling and amazing that the price is entirely justified. My friend got the beef + seafood option, and they were quite pleased with both the quantity and the quality of the meats. Finally, the octopus - it was so perfectly cooked, but just a bit too salty. However, the grilled watermelon was so wonderfully paired to dilute the saltiness, sigh, it was so amazing.\n\nOverall, I could go on and on, but you won't go wrong if you spend a little extra to try out the main dishes. Seriously, call to make your reservation and go already!\n\nFood: 5 stars\nService: 4 stars (can be a little slow)\nPrice: 5 stars\nAmbiance: 4 stars (it's really just a space between two buildings covered by a tent...but hey, it's got style.", "date": "2021-05-19 19:03:58", "user": {"name": "Xiao", "review_count": 1198, "yelping_since": "2012-02-18 20:35:28", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.8, "fans": 80}}
{"review_id": "6aOjcas_MAQtdXF1ri0FAg", "user_id": "9df-damifLcVV4tHTRyaIQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food was good. What I found to be annoying were the horse flies, music so loud my date and I had difficulty hearing what the other said and the homeless guy that walked right up to our table to panhandle and proceeded to go to each of the outdoor tables before he was asked to leave. Not the ambiance I was looking for.", "date": "2021-05-17 02:44:21", "user": {"name": "Malea", "review_count": 37, "yelping_since": "2014-07-28 20:38:14", "elite": "", "average_stars": 2.22, "fans": 0}}
{"review_id": "BxPaFTHK7DfIOE5nPi5mwQ", "user_id": "OwWOl11P1Dg6qP_vEiXHQw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 4, "funny": 0, "cool": 3, "text": "Loved this place!  Unbelievably delicious food, great portions and fresh as can be. Fantastic service and a wonderful atmosphere. Loved the owner, his wife and daughter at first sight but even more after we saw the Fish- Phila épisode all about the making of Alma Del Mar on season 5 of Queer Eye. \n\nThis is a don't miss kind of place.", "date": "2021-05-01 22:58:39", "user": {"name": "Beth", "review_count": 469, "yelping_since": "2011-10-28 03:01:45", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.1, "fans": 74}}
{"review_id": "b3SjpxQLQQa4k2_kjfM1Tg", "user_id": "phKN6_FbZuzPR40a1CSjpg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing food and smoothies !! Love the outside area :) nice af waitress!! Love it here and the market", "date": "2021-04-21 15:02:42", "user": {"name": "Jen", "review_count": 22, "yelping_since": "2016-08-01 17:55:59", "elite": "", "average_stars": 3.36, "fans": 0}}
{"review_id": "jDTNt5Ufegkag0Md6ySexw", "user_id": "B01V2LhskzNo2hqmfy6kfA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Delicious variety of tamales! The fresh tomatillo salsa is great, especially when served warm. The mole one may be the best mole I have had in a few years. The Roja (with chicken or cheese) is also well flavored. 3 for six bucks is a great snack to share! The people who work there are also very friendly and the sitting area is well ventilated.", "date": "2021-04-02 22:10:15", "user": {"name": "Sonali", "review_count": 34, "yelping_since": "2013-05-09 17:44:01", "elite": "", "average_stars": 3.94, "fans": 0}}
{"review_id": "9IZU3MRnyobBB-GBy-stJQ", "user_id": "0it9kPX7JHO7wtBktKDeDA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Get the tamales deal, these tamales are fantastic! Highly recommend every tamale they have(Roja, Verde)- but their Mole sauce is some of the best I've had. Get some extra mole sauce to drizzle  (or dump on these). Surprisingly filling and 6 dollars for 3 will solve a meal problem for you.", "date": "2021-03-31 21:40:33", "user": {"name": "Raj", "review_count": 62, "yelping_since": "2011-03-10 00:23:38", "elite": "20,20,2021", "average_stars": 3.98, "fans": 0}}
{"review_id": "W24s8jd21XTFJHop8mVeCQ", "user_id": "_jqB3o8PypvsdWPrTYL-ZQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'm amazed how good the food is in this simple but amazing place , I like the concept of the food and it is delicious, we are definitely coming back to keep trying different plates", "date": "2021-03-28 17:37:50", "user": {"name": "Rosaina", "review_count": 4, "yelping_since": "2020-11-15 01:20:40", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "wrBV9YpuO8zdgIFEw45Cpg", "user_id": "jQk3MOrdoT9rKNsvS03miA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place was saved as a place I wanted to go ever since seeing this family on Queer Eye. Yesterday I took a day trip to Philly and decided to finally try them for breakfast. I was seated in their outdoor space which was equipped with heaters. I decided to try their seafood and grits and I got an order of tamales. Baby when I tell you these were the best grits I ever had. It was absolute perfection. It was topped with fried whiting? 2 jumbo shrimps and scallops. The sauce just tied everything together perfectly. I don't care if I have to drive an hour and half the trip was so worth it. The tamales was just a greedy addition to my order. I ate them later and it was really good too! Also their orange juice is freshly squeezed. Everything just tasted so homemade and good. I'm so happy their business is still thriving and I will definitely be back!", "date": "2021-03-22 21:44:19", "user": {"name": "Tasha", "review_count": 155, "yelping_since": "2013-12-30 19:42:23", "elite": "2017,2018,2019,20,20,2021", "average_stars": 4.07, "fans": 11}}
{"review_id": "3VXjhY2XKRXwCoJ7K-IBkA", "user_id": "tjc-aJ2zLNFeN-3SMatYlw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "It's true - 50 Yelp reviews with an average of five stars! Almost unheard of.\n\nCute ambiance. I forgot I was in South Philly.\n\nHomemade lemonade with different fruits added. Tasty!\n\nAnd super-tasty grilled shrimp in the very reasonably-priced Greens and Seafood Salad.\n\nThe owner is very nice too. And great chicken mole tamales!", "date": "2021-03-15 22:31:02", "user": {"name": "M", "review_count": 88, "yelping_since": "2009-05-12 07:54:21", "elite": "", "average_stars": 4.87, "fans": 0}}
{"review_id": "9fbkwz3D6hH0OPtS2WPZfA", "user_id": "QwKB9b-pMm-yhb_n4amSHA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Amazing food and great Covid safe dining. Service was great and BYOB. Will definitely return plenty left to try.", "date": "2021-03-13 01:45:20", "user": {"name": "Owen", "review_count": 8, "yelping_since": "2011-07-10 13:43:29", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "2A-Y4I3_mxw2Z5ymkiyytA", "user_id": "zUxAaduqHhUpR20NiRoHUQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great food, local business owners.   Best lobster benedict around.  The outdoor dining is pretty good, even on cold days!   Breakfast and dinner are both great.", "date": "2021-03-08 15:14:26", "user": {"name": "Michael", "review_count": 25, "yelping_since": "2012-10-27 21:56:35", "elite": "", "average_stars": 3.24, "fans": 0}}
{"review_id": "eUN0k26H8V7KTfXdYPCkTw", "user_id": "693jtVYzvhwbATcoGxTgaw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I have been dying to try the lobster benedict from Alma Del Mar (I lived in VT for a while and there was a diner just over the border in NH that did them SO WELL), so we ordered brunch this past weekend. \n\nMy benedict was wonderful - large pieces of lobster, arugula was a nice touch, hollandaise was dreamy, and the potatoes were well seasoned! Total 5 star dish! \n\nMy partner got the huevos rancheros, which he liked quite a bit. You should know that the tortillas come in pieces, under a lot of sauce, so got a little soggy... and this came with corn mixed in, which he is not a fan of (and the menu didn't mention). 4 stars. \n\nBut the menu is amazing, we're excited to try some of the sweeter options, and I know I'll be craving that lobster benedict again!", "date": "2021-03-03 18:01:36", "user": {"name": "Cat", "review_count": 208, "yelping_since": "2010-11-04 01:28:08", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.95, "fans": 14}}
{"review_id": "Eoa9EJ7DpPtEzEdouJ7jWA", "user_id": "f4eODkTXIqUdCGvAwkrM1Q", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Delicious food and a warm atmosphere! We started with Ceviche Anticuchera which was beyond good. Not sure what exactly they put in the marinade but it's perfect. I wish there was some bread with it so you could dab it in the sauce. They gave us freshly made tortilla chips with it which were really good and nothing like those plain store bought ones. We then got Pulpo al Carbon and Alma's Branzino which were both amazing but I must say the octopus was a winner for me. It was so soft and perfectly seasoned and charred. Every bite was like a trip to heaven. The branzino was also very good but I wish it perhaps had garlic or cilantro. I would definitely come back to try some brunch items too.", "date": "2021-02-28 01:52:08", "user": {"name": "Katarina", "review_count": 223, "yelping_since": "2017-04-15 21:36:52", "elite": "2018,2019,20,20,2021", "average_stars": 3.94, "fans": 6}}
{"review_id": "jkmA0rrOqz13nKYyP26ucw", "user_id": "AA_UajK8_43gfKKpRaInBw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "I was amazed at the food, the service, and the absolute phenomenal family itself. The family was so kind and clearly so skilled at their craft. We ordered the salmon burger, lobster benedict, and 3 leches french toast and we're blown away! Definitely coming back!\n\nNos encantó todo sobre este restaurante! Increíble servicio y comida! La familia también es super buena gente y hasta se tomaron una foto con nosotras! Definitivamente vamos a regresar!\n\nLobster Benedict", "date": "2020-12-06 20:57:49", "user": {"name": "Nadia", "review_count": 5, "yelping_since": "2014-05-19 20:47:05", "elite": "", "average_stars": 4.6, "fans": 0}}
{"review_id": "XtjmozzNlO5gofxUOPal-A", "user_id": "PcoeVMyUkgOyROjWQEo2Zg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 16, "funny": 3, "cool": 11, "text": "Was shopping around the Italian Market with my mom when we decided to pop in for an early brunch. We have walked by this place so many times and now I totally regret not stopping in beforehand!! The restaurant is 95% outdoor as the inside is super tiny, but there is a huge tent up which is nice especially as the colder weather approaches. All of the servers were friendly and following COVID guidelines. \n\nWe started off with some coffee and OJ and we were pleasantly surprised to find out the OJ is fresh squeezed!!! Sooo refreshing and I'll need to bring some champagne to go along with it next time. We ordered the Lobster Eggs Benedict and Bacon Banana French Toast and both were delicious. Highly recommend the Lobster Benedict - the portion is huge for only $14 what a steal!?! It was so flavorful and I can't wait to come back and order it again.", "date": "2020-12-02 01:36:21", "user": {"name": "Samantha", "review_count": 134, "yelping_since": "2017-06-16 15:45:11", "elite": "2019,20,20,2021", "average_stars": 4.34, "fans": 14}}
{"review_id": "SROeTUQg6SclpKk5qyUDAw", "user_id": "EO4goAgwcbaRx3x-eQf4dg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "We got the Lobster Benedict and a Waffle with strawberries, bananas, and chocolate chips. They actually put the chocolate chips in the batter which everyone knows that's the way to do it!! This was my first time having a lobster Benedict and it was delicious. It was very well seasoned from the lobster to the potatoes that came with it. They added peppers and onions with a creole seasoning so it had a little kick but not overpowering! The staff was super friendly and nice. During COVID-19 they have the seating set up 6ft apart and the staff is always wearing a mask. The outside seating now has a tarp about two story's overhead and heat which is a nice alternative to inside giving you more air flow. Definitely want to go back and try some of their sweet breakfast items!!", "date": "2020-11-15 13:42:45", "user": {"name": "Kathryn", "review_count": 80, "yelping_since": "2017-01-05 01:14:49", "elite": "2019,20,20,2021", "average_stars": 4.65, "fans": 4}}
{"review_id": "K4HYgXhTSvKq28ebInkPDQ", "user_id": "yMbC4zHwBVOqiRaxZ_Z3iw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I've been to Alma Del Mar twice for dinner, first as part of Latin American Restaurant Week and second to introduce a friend to the Italian Market area. I love this place. I felt comfortable sitting in their outdoor patio which is fully covered and available in all weather conditions! I know going into this winter it will be difficult to find comfortable places to eat outdoors, but they have such a great set-up for COVID times. I recommend the corn on the cob, the crab & corn chowder, shrimp ceviche, octopus, and red snapper!", "date": "2020-11-11 20:09:27", "user": {"name": "Joey", "review_count": 7, "yelping_since": "2014-10-03 18:23:21", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "j87YQ4HhordGFMUkIt-L-Q", "user_id": "CjJhEzdWQNEKa7grwPRQyg", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 8, "funny": 2, "cool": 7, "text": "I really enjoyed my brunch at Alma Del Mar last weekend! The food was fantastic, the outside patio was so cute, the live music was fun (but a little too loud). I'd love to come back here!\n\nMy Huevos rancheros was delicious, and my friend loved her lobster Benedict. Surprisingly the lobster Benedict was only $14! What a steal! I guess that's the benefit of the owner also owning the seafood store attached to the restaurant. \n\nThe waitress was amazing. It was my friends birthday and I did not tell anyone at the restaurant. I gave my friend a gift bag, and sure enough an hour later a tres Leche's cake with a sparkling candle was delivered. This waitress was soooo attentive to notice the gift bag that she got us birthday dessert on the house! And the live music guitarist started singing \"happy birthday\" and the entire restaurant was clapping. How amazing of that waitress!! \n\nOverall great experience. Delicious food. Fantastic service. Loved it!", "date": "2020-10-26 23:37:59", "user": {"name": "Stephanie", "review_count": 432, "yelping_since": "2011-04-26 02:55:59", "elite": "2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.29, "fans": 81}}
{"review_id": "JQUOZQGZtkdA_rm2Zua44w", "user_id": "mzeZleZ3yvr_lpc3Ku5QEA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 4, "funny": 0, "cool": 1, "text": "Came here a couple of weeks ago for brunch and was pleasantly surprised!  They had a cute outdoor set up next to the restaurant and seemed to follow all covid guidelines.  The ambiance is actually nice considering that they are located in the middle of the Italian market. \n\nI ordered the huevos rancheros and lobster benedict and both were pretty good and flavorful!  The best part about this restaurant is that it is BYOB, so don't forget to bring the champagne for mimosas! They also give you fresh squeezed orange juice! \n\nI highly recommend coming here for brunch with friends!", "date": "2020-10-16 13:25:28", "user": {"name": "Maryann", "review_count": 40, "yelping_since": "2015-11-11 23:06:13", "elite": "2019,20,20,2021", "average_stars": 4.27, "fans": 4}}
{"review_id": "LSYgId6eaQDdAZSuvfYG7Q", "user_id": "ET8n-r7glWYqZhuR6GcdNw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 12, "funny": 2, "cool": 12, "text": "We've had our eye on Alma del Mar ever since watching their story on Queer Eye a few months back. Finally made it in for a late breakfast this morning and had a great experience! \n\nThe outdoor patio is really cute and tables are very spaced out. There aren't too many places to sit and eat in the Italian Market but Alma del Mar is right in the middle of all the action, while still being tucked away from the street. There are signs at the front of the patio with all of the Covid precautions the restaurant is taking and requesting of their customers. There was hand sanitizer on our table and everyone we encountered was wearing masks properly. \n\nAfter checking out our menus, my husband and I both decided on huevos rancheros. Plus a trifecta of water, coffee and OJ. The OJ was fresh squeezed and tasted great. The coffee was awesome, too. \n\nWe were presented with enormous servings of huevos rancheros and we each left about half of the dish behind. On a future visit, we'd probably order one to share plus something else from the menu. Looking forward to next time!", "date": "2020-10-15 18:01:41", "user": {"name": "Michelle", "review_count": 2256, "yelping_since": "2008-03-28 13:26:38", "elite": "2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.05, "fans": 1353}}
{"review_id": "AaWFUcNM--c0FkzZl43fgQ", "user_id": "E8Qc_uuCzXgTqctDlye9PQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for a terrific brunch recently and had an excellent dinner tonight at Alma Del Mar.   The oysters Rockefeller appetizer was fantastic.  We shared the Seafood soup and grilled Branzino, both excellent!\n\nSuch a great addition to the neighborhood.   Marco the owner spent a few minutes welcoming us and made us feel at home.     You need to check out season 5 episode 8 of queer eye on Netflix.  Great background on the family and their journey to opening Alma Del Mar.   \nGreat atmosphere with the outdoor dining.  My wife especially appreciated the little touches like fresh flowers on every table.   We will be regulars.", "date": "2020-10-07 01:25:32", "user": {"name": "Chris", "review_count": 20, "yelping_since": "2014-09-11 21:13:50", "elite": "", "average_stars": 4.91, "fans": 0}}
{"review_id": "JeQQRssynXnsFU6OF2KFXA", "user_id": "LTDYfEhdgTQogStetB0S4Q", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Omg ! This place has the best tres leches French toast, everything on the menu is delicious and Alma is always super friendly and makes sure everything is the way is supposed to be !! Love this place !!", "date": "2020-10-04 00:55:18", "user": {"name": "Lucero", "review_count": 12, "yelping_since": "2016-11-15 03:44:59", "elite": "", "average_stars": 4.08, "fans": 0}}
{"review_id": "Vunpare43DC9UWAfTjN47A", "user_id": "d5wKh9GeNdfxP1CKInrGmw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wonderful spot! Excited to visit, of course after watching Queer Eye. Food was absolutely delicious, lovely service, and socially distanced outside seating made me feel relaxed (even with the very busy surrounding Italian Market).", "date": "2020-09-27 17:58:00", "user": {"name": "Julia", "review_count": 2, "yelping_since": "2020-09-27 17:57:14", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "GdxInIeWLI5rwz3289ofdA", "user_id": "6PDXU6w8YJ4OzQR4mwVK5g", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The food here is amazing and the service is great. We really enjoyed the crab tamales and the mango salad. The seafood was really fresh and delicious. The fact that this is place is byob is a huge plus as well!", "date": "2020-09-13 21:38:15", "user": {"name": "Fred", "review_count": 32, "yelping_since": "2012-01-08 00:40:15", "elite": "", "average_stars": 3.53, "fans": 0}}
{"review_id": "mTHn6ZA5WNlZmu8inpxDAQ", "user_id": "21m3AMNEp6CgM61g_1S6og", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Soooo delicious. The servers were so sweet to us and looked after us the whole time. Great atmosphere, outdoor seating, beautiful flowers on the table. Food was really great - highly recommend the brunch!! We got french toast and eggs benedict with lobster yummmm. Will go back soon!!", "date": "2020-09-13 19:39:20", "user": {"name": "Carolynne", "review_count": 9, "yelping_since": "2020-09-12 03:27:39", "elite": "", "average_stars": 4.78, "fans": 1}}
{"review_id": "LonX4IAYgotvWLPI3RQIcw", "user_id": "9t2DVXMwzQ1rzBn5R1k-HA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is an awesome addition to the Italian Market. So far I only had breakfast takeouts. There are many seafood items on the dinner menu I'd love to taste soon.", "date": "2020-09-12 21:12:13", "user": {"name": "Anh", "review_count": 3, "yelping_since": "2010-07-03 17:23:17", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "KHSCL1S7PVj3bm66vwMzCw", "user_id": "vFd8aBLg1kFcd0kCkoi-xw", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 5, "funny": 0, "cool": 2, "text": "Came in for dinner in the outdoor dining area. They put a big tent that provides nice coverage when it rains. When it gets darker at night they turn some lights on. \n\nServers were friendly. I ordered the tamales with crabmeat. It's served without the corn husks. Nice presentation with some cooked greens underneath the tamales. Fresh cornmeal, perfect flavor. Highly recommended.\n\nMy usual is the mango salad. It has good amount of mango and crab meat. Dressing is awesome, not too sweet or too acid because you already has the sweetness from the mango.\n\nTiramisu is a nice dessert with strong coffee flavor. \n\nThe small flower arrangement on each table is a nice touch for the dining area", "date": "2020-09-11 09:21:44", "user": {"name": "Retna", "review_count": 655, "yelping_since": "2015-11-02 22:00:00", "elite": "2018,2019,20,20,2021", "average_stars": 4.4, "fans": 48}}
{"review_id": "JNg2V7_8l0ipk2tMJLeaug", "user_id": "JTqQ9C9S2Qc8_aHtO1965g", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "This place is absolutely adorable. Finally decided to have a meal outdoors during this crazy time and Alma Del Mar was exactly what i needed. Tables were spaced outdoors and nicely spaced out. Because their dining area was quite big, I did not feel crammed nor did I have to deal with sidewalk seating. \n\nI ordered the crab mango salad and it was delicious. I embarrassingly inhaled the thing. I don't even love salads and this was just SO good. I also had the strawberry french toast bc carb is LIFE! Very good as well and just the right size that it wasn't overwhelming.\n\nI would definitely recommend.", "date": "2020-09-10 19:18:58", "user": {"name": "Ann", "review_count": 488, "yelping_since": "2007-11-14 14:28:12", "elite": "2009,2010,2011,2012,2013,2014,2015,2016", "average_stars": 3.59, "fans": 38}}
{"review_id": "YMxtcoyuGsGT6qh395WivQ", "user_id": "xQjBlW37Eq0tZq5p8hdLrA", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Absolutely AMAZING! Went for brunch on a weekend, my partner and I had only just decided that morning we wanted to try out this new spot and got reservations day of. The outdoor dining is so adorable, the staff is incredible, my mocha oat latte was made PERFECTLY (I've been a barista for 7 years so I do not say that lightly), and our meals were absolutely delicious. I cannot recommend this place enough. I am excited to go back soon!", "date": "2020-09-09 16:43:20", "user": {"name": "Hannah", "review_count": 4, "yelping_since": "2016-03-04 22:02:43", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "Ev5sbCb819s0IbZxbpPS7w", "user_id": "f2lysfZjghg8KyPF4poZGQ", "business_id": "Ku2b7oA9s56mHoflb5lJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Oh my god, this place was SO incredible! As you can see from my photo I ordered the huevos rancheros and it was very VERY good ! I went with a few friends and we brought a few bottles of champagne since it's a BYOB which we love , and they were extremely accommodating.  They kept our champagne on ice and brought out an ice bucket to keep everything cold, our server was a younger man and very nice and attentive.  The food is extremely reasonably priced and I really love the atmosphere it's right in the heart of the Italian market . We can't wait to go back!", "date": "2020-09-04 22:08:50", "user": {"name": "Britt", "review_count": 16, "yelping_since": "2016-05-17 22:23:31", "elite": "", "average_stars": 3.88, "fans": 1}}
