{"business_id": "7NwFNLC0SwX1SwQYlfF5yw", "name": "Luna Café", "address": "317 Market St", "city": "Philadelphia", "state": "PA", "postal_code": "19106", "latitude": 39.9504011, "longitude": -75.1463684, "stars": 4.0, "review_count": 444, "is_open": 1, "attributes": {"RestaurantsDelivery": "True", "OutdoorSeating": "True", "WheelchairAccessible": "True", "BusinessAcceptsBitcoin": "False", "NoiseLevel": "u'average'", "GoodForKids": "True", "RestaurantsTakeOut": "True", "Alcohol": "'none'", "BYOB": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "Caters": "True", "RestaurantsAttire": "'casual'", "BikeParking": "True", "HappyHour": "False", "WiFi": "'free'", "HasTV": "False", "Ambience": "{'touristy': False, 'hipster': None, 'romantic': False, 'divey': False, 'intimate': None, 'trendy': None, 'upscale': False, 'classy': False, 'casual': True}", "RestaurantsPriceRange2": "2", "RestaurantsTableService": "True", "RestaurantsReservations": "True", "BusinessAcceptsCreditCards": "True", "RestaurantsGoodForGroups": "False", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': True, 'dinner': False, 'brunch': True, 'breakfast': True}"}, "categories": "American (Traditional), Restaurants, Sandwiches, Caterers, Breakfast & Brunch, Coffee & Tea, Cafes, Event Planning & Services, Burgers, American (New), Vegetarian, Food", "hours": {"Wednesday": "9:0-14:0", "Thursday": "9:0-14:0", "Friday": "9:0-14:0", "Saturday": "9:0-14:0", "Sunday": "9:0-14:0"}, "category_list": ["American (Traditional)", "Restaurants", "Sandwiches", "Caterers", "Breakfast & Brunch", "Coffee & Tea", "Cafes", "Event Planning & Services", "Burgers", "American (New)", "Vegetarian", "Food"], "stratification_tag": "Coffee & Tea"}
{"review_id": "HSGda0txDGTeXyeCrFgODQ", "user_id": "zm7J-xyMn-_nFU4vLuL88Q", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 1, "text": "We walked into the cafe in the direction of the counter and as we stood there, there were two people behind the counter - young man and older woman. Neither really spoke to us for few minutes as we awkwardly stood in pretty tight enclosed space. At some point the woman standing there writing in her notepad looked up and asked if we were being helped which we obviously weren't as she and the other guy that could've spoken to us. She asked for our vaccine cards before anything (which isn't a problem until a bit later) and then told us there were counter seats in the back or we can just wait for one of the tables to be cleaned and we can sit there. We opted to wait and we're seated shortly after. While we waited for someone to take our order, about two more crowds walked in and were politely greeted immediately and told them someone would be with them in one minute. Right after, another group walked in and after being greeted, they were advised to have a seat and would be asked to show their cards when someone came to the table.\n\nMy partner and I immediately noticed a large difference in customer care between us and the groups following us; I'm not one to say this often but it definitely felt like it was because we're are people of color.\nWe decided not to eat there and didn't even bother to try their food based on their service. I'm a big fan of small cafe's but this was disrespectful for my own taste - Philly has much better places!", "date": "2022-01-16 20:32:23", "user": {"name": "Joseph", "review_count": 13, "yelping_since": "2014-07-03 15:16:00", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "O-OXZrDKQ35EnLltmhS8Qw", "user_id": "32hMcxaohQrPBbNi5HRIeg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Luna Cafe is decent. It was one of very few options near the hotel. Service was quick, which was appreciated.", "date": "2022-01-09 20:53:18", "user": {"name": "Matthew", "review_count": 1812, "yelping_since": "2015-02-19 18:20:07", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.51, "fans": 57}}
{"review_id": "dIA_NPotLpd-hmrYgtu8QA", "user_id": "Xg6u3AV3dfro9_jHoUFKmg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We were in town for the weekend and looking for a place for brunch. We were lucky enough to get a seat. The service was friendly and attentive. But the food, WOW amazing. I had the biscuits and gravy with fried chicken and my husband had the everything bagel sandwich and we shared each.  We were blown away by how delicious and well prepared everything was. The coffee is La Colombe so you know it was incredibly good.  Can't wait to go back.  I also love that they include a gratuity so their staff is a being paid a better wage.", "date": "2021-12-06 00:42:24", "user": {"name": "Beth", "review_count": 18, "yelping_since": "2015-07-26 14:58:56", "elite": "", "average_stars": 4.78, "fans": 0}}
{"review_id": "hYsQOCjUs6lEpNcEtYunQw", "user_id": "s5DqTRQ1dTtiUratj_FL3A", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Came here with a friend for a late breakfast while I was visiting Philly. The food was delicious with plenty of options for vegetarians and vegans. \n\nThe staff were nothing short of amazing and very attentive. It felt very safe, especially during Covid. \n\nThere are outdoor tables and chairs and plenty of inside seating. If you are seating towards the front door, it can be a little chilly if you are seated there. So bring a light jacket :)", "date": "2021-10-30 15:17:08", "user": {"name": "Nadia", "review_count": 18, "yelping_since": "2017-07-21 19:33:41", "elite": "", "average_stars": 4.32, "fans": 0}}
{"review_id": "vZI6qdzX8RcgbFjXTdRbqg", "user_id": "A3CgF_iU5xGRtUMA7zp7gg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food was pretty average so I am baffled by all of the good reviews. I got the Nutella stuffed pancakes and they took this as the literal meaning, not in a good way. When I've had this dish before at other places, it was more than just slapping on Nutella on the pancake. To piggyback off of the previous review, there is an automatic 20% gratuity charge added in. This is usually added in for 6 parties or more, which we were not. The service was slow and when I tried to flag down an employee for water, their automatic response was, \"I'm not your server\". Go somewhere else and don't waste your time here.", "date": "2021-10-14 21:22:23", "user": {"name": "Nancy", "review_count": 20, "yelping_since": "2017-04-08 01:43:59", "elite": "", "average_stars": 3.75, "fans": 0}}
{"review_id": "T3IN781KI0sGzF9TPEYZ-w", "user_id": "3TLGW7hLq3ug4URZcNX2xw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food and atmosphere.  Within walking distance of Independence Hall so stopped there before our scheduled tour.", "date": "2021-10-07 18:28:52", "user": {"name": "Roger", "review_count": 1, "yelping_since": "2021-05-22 20:53:51", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "9kh03KPN8dPcPpcWO9Pi4A", "user_id": "SZX58vN8AxkD3h_l0qZjlQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had a chai latte with a shot of espresso from here once and it tasted like hot water with coffee grinds. No chai at all. I tried to politely talk to the women who made it (shoulder length dark brown hair) but she just got super defensive and told me the espresso can be overpowering...? I was so thrown off by her response and lack of customer service I left and threw out the latte. I haven't tried the food here yet but I probably won't seeing as I wasted $7.", "date": "2021-09-22 16:08:31", "user": {"name": "Savannah", "review_count": 5, "yelping_since": "2017-04-15 23:25:08", "elite": "", "average_stars": 1.14, "fans": 0}}
{"review_id": "HNpypvvngCa4cnTpHpfR0A", "user_id": "ju0H1ZlsmczlY8-wkhcWFQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We are visiting Philly for a few days to catch a baseball game and sightseeing.  Looking for Vegan options for me I found Luna Cafe.  I had the avocado toast with tomatoes which was very good and fresh. I also had the plain potatoes.  My husband had bacon and scrambled eggs.  We had a tour planned for later in the morning so we arrived a few mintes before they opened.  They saw we were there and took our drink order.  Our waitress Maddie was wonderful.", "date": "2021-09-10 18:59:54", "user": {"name": "Vivian", "review_count": 48, "yelping_since": "2016-11-11 18:38:19", "elite": "", "average_stars": 4.92, "fans": 0}}
{"review_id": "MT3P6YXGEYmDLYRXszt6tA", "user_id": "38Rc2dhSCgtKA85R7EkppQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I would not recommend.  For starters, the food took an inordinate amount of time to come - a fact to which our server was totally indifferent.  She never once asked if everything was ok or if we needed anything.  Then the check came and there was a 20% gratuity automatically added - I would not have given our server 20% for substandard service (maybe the automatically included tip reduces incentive to be on top of things).  As another reviewer commented, there is absolutely no notice of this on their menu (at least not on the menu that you pull up on your phone currently due to Covid).  To me, that is something a restaurant should give patrons full notice of on their menu.  What we ordered was good but I would suggest Red Owl Tavern which has far better service and is only a few blocks away.", "date": "2021-09-05 23:19:07", "user": {"name": "Marni", "review_count": 4, "yelping_since": "2021-01-01 22:15:29", "elite": "", "average_stars": 3.2, "fans": 0}}
{"review_id": "vlFCSr-spW5Sg6uSLRaIAg", "user_id": "NajWj1QS7I2l8dpq8ujyJg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food was decent but they automatically and without notice add a 20% tip to every order. We were planning to tip but did not appreciate being forced to do so. When compulsory like this, it's no longer a tip. It's just an added tax. This 'policy' is not on the menu, it's not on the website, it's not written on the walls, and the server didn't tell us until after they'd charged our card.", "date": "2021-08-27 18:57:25", "user": {"name": "Liz", "review_count": 3, "yelping_since": "2016-08-15 17:29:29", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "UTu6jkN-itHFg35HIXjfFA", "user_id": "JQ_Trfz2RXEKuJ9nVJL3pg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Stopped into this small cafe twice over a weekend Philadelphia trip. The options were plentiful and the quality of the food was good. My only complain was that no one came by to ask if I wanted more coffee in the morning. Otherwise, a solid breakfast spot.", "date": "2021-08-19 22:12:33", "user": {"name": "Matt", "review_count": 21, "yelping_since": "2019-02-25 03:58:04", "elite": "", "average_stars": 3.57, "fans": 0}}
{"review_id": "IOlietjvWFCEpcQHKyMszA", "user_id": "DzxQ8lk0pQwq3kEqTg6sgA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We are tourists visiting Philly for the weekend and found this quaint cafe close to our hotel. The place was packed and they had many tables outside as well. The menu has a lot of variety and we ended up choosing the breakfast tacos and chocolate chip pancakes. Both were delicious! We also both got a yummy iced latte since it was so hot outside. The only complaint was that our table was right by the door and the servers and patrons had to keep walking past our table which was slightly annoying but I understand the restaurant itself is very small. Luna Cafe is wonderful and we would come again if we are ever in Philly again.", "date": "2021-08-17 20:55:11", "user": {"name": "Ali", "review_count": 15, "yelping_since": "2019-01-08 01:20:45", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "qeKGtnA9qXBq6ooDUMOuOA", "user_id": "eTzCYwNp7CEvIWyi0xbLwg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Thoroughly enjoyed my meal, I had the chicken and waffles, my partner had the breakfast tacos, and father-in-law had the Philly breakfast sandwich. Service was pleasant. 20% gratuity made paying easier and honestly the food was delicious. My picture won't do justice being that that I took it after I took one of the two double stack pancakes out for my son. The pancake tasted like it was made like French toast. Very moist and soft. The gravy is a sausage which was normal but the crisp and breading of the chicken it what really knocked it out of the park.", "date": "2021-08-14 20:35:33", "user": {"name": "Matt", "review_count": 10, "yelping_since": "2019-07-26 00:53:41", "elite": "", "average_stars": 3.91, "fans": 0}}
{"review_id": "XnZvd0KgsbESzBrNu-NBmw", "user_id": "MadzA-FMtJpJQogN6xttYQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best chicken and pancakes anywhere!!! Friendly staff and great atmosphere. We love Luna Cafe!", "date": "2021-08-08 14:39:13", "user": {"name": "Brittany", "review_count": 3, "yelping_since": "2015-05-18 22:25:44", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "_E2-Bq0trBnl5KiIgjS6lA", "user_id": "q8RriCzWf3oMSexlS4UOyQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Two days back to back and they still didn't disappoint! They were very busy and the wait for a table for one was about 15min, which isn't bad at all. This time I payed around and had my server make the choice for me, she was a little nervous but I was confident she couldn't mess it up. The hospitality was wonderful and everyone greeted me as they walked past. No one standing still and attending everyone consistently. \n\nThe waitresses choices were spot on, she did cheat a little by giving a sampling of biscuits and gravy (So Happy she did this!). The Breakfast Taco's are exceptionally well done, the chef that runs the kitchen knows exactly what their doing. Pico de Gallo was refreshing and not overly spicy, eggs scrambled to perfection, and the sauce poured over the taco's made them perfection! \n\nNow for the biscuit and gravy sampling, never have I ever had a biscuit like this before! Flaky and perfectly rounded out with a light buttery flavor, the layering makes me think it was made with Filo dough. The sausage gravy richly flavored and had no grit from the sausage. Perfectly seasoned and not overly peppered or salted, most make their gravy greasy and under seasoned, this will not disappoint! \n\nDo Not Miss this spot to have breakfast or brunch! This will make your trip or day and will be back for more.", "date": "2021-07-24 14:31:01", "user": {"name": "E.j.", "review_count": 10, "yelping_since": "2018-06-01 22:13:12", "elite": "", "average_stars": 3.18, "fans": 0}}
{"review_id": "Y6ZpEECwSaoHh3Bkxx1CrQ", "user_id": "q8RriCzWf3oMSexlS4UOyQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Stopped by my first cafe in Philly and have to say I'm In Love! The atmosphere is soothing and energetic at the same time. Very friendly staff and exceptionally clean. Nothing like very inviting staff to make the start to your experience a positive one. The iced vanilla late wasn't too sweet and perfect balance espresso, milk, and vanilla sweetener. \n\nNow, the Bagel Breakfast Sandwich! Very fresh Bagel, egg cooked perfectly, bacon crispy, and their Luna sauce.... what the actual f$@&, It makes the experience unique and adds explosive flavor. I have no idea what's in it, but it's a flavor I will come back for before leaving old Philly. \n\nIf you're thinking about going here, stop thinking and just go! You will not be disappointed!!!!", "date": "2021-07-23 13:44:17", "user": {"name": "E.j.", "review_count": 10, "yelping_since": "2018-06-01 22:13:12", "elite": "", "average_stars": 3.18, "fans": 0}}
{"review_id": "fZ2XjKiqmBpdoi0xhBuPEw", "user_id": "E8kVL393yHdGCWVnnx0pgQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "What a cute place for breakfast! Great food! Awesome coffee and service with a smile.  The breakfast sandwiches are tasty, but I had the pancakes and boom: heaven!   Get there a tad early as they fill up fast with tourist and dwellers alike!", "date": "2021-07-03 02:20:33", "user": {"name": "Stephen", "review_count": 72, "yelping_since": "2013-01-03 17:45:56", "elite": "2021", "average_stars": 4.51, "fans": 3}}
{"review_id": "56ojkEJsqf_IPs_e29KHIw", "user_id": "a4oitV8lYoLFVPhDO8k-Pg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Used to be great. Ordered chicken salad online and got a text message it would be ready at 12:25. \n\nShowed up for pickup and they said, \"We're out of chicken salad.\" Said, \"We tried to call you.\" Totally lied. My phone did not show any attempt to call. \n\nOffered to make me something else   I said just give me a refund. I called 20 minutes later to see where my refund was. Said, \"It takes days to show up.\" But amazingly a message appeared right afterward saying the amount would be refunded.  \n\n I was hungry and on a tight schedule and every place had long lines.\n\nI'm hoping the owner sees this and does something about the service. They DO have great chicken salad and muffins...or at least they used to.", "date": "2021-06-09 17:46:36", "user": {"name": "Cathy", "review_count": 7, "yelping_since": "2014-03-04 16:29:58", "elite": "", "average_stars": 3.86, "fans": 0}}
{"review_id": "Ze5R8qFR3GhN0JvzyfuxQA", "user_id": "pBiBhfwTXvNTYJM2EOGPtw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "Had brunch with the family and the food was amazing! We were a party of 6 and were easily accommodated 4 at one table and two at the next which was great for the coziness of this restaurant during a Pandemic comeback. The pancakes were delicious and the oat milk hazelnut latte was sooo good.", "date": "2021-06-06 03:00:01", "user": {"name": "Sherrie", "review_count": 11, "yelping_since": "2015-07-27 21:08:06", "elite": "", "average_stars": 4.75, "fans": 1}}
{"review_id": "IDKADnBOabVD8GmCAXUR2Q", "user_id": "YEtxBUAH_qaqIqce3gl2Sw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My wife and I spent a get away weekend in  Philadelphia and wanted breakfast before we left.\nAm I glad we found Luna Cafe! Breakfast was fantastic, the service was great. We initially decided to sit outside but it got a little chilly and asked if we could move inside. I've been to some places and you would think you were asking for the moon, not here it was no bother at all. The next time we visit we will definitely stop by again.", "date": "2021-05-04 19:32:45", "user": {"name": "John", "review_count": 12, "yelping_since": "2015-10-01 20:32:38", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "khphJdGDzJ27o9AtxzBLiA", "user_id": "dbK2kpRIOAu6o_Yaia7JUw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Omg I had the avocado toast with egg and it was delicious! This spot gets packed so prepare to wait. From looking at everyone else's plate, everything looks good! It's a must try.", "date": "2021-05-02 20:43:44", "user": {"name": "Alina", "review_count": 15, "yelping_since": "2015-09-16 18:21:19", "elite": "", "average_stars": 4.73, "fans": 1}}
{"review_id": "LmXs5pvJYVXkdthBi_6Apg", "user_id": "z5Xx2a3_B0ZzsYGSDK8yqg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Cutest place! We made a very last-minute reservation, hoping for the best and thankfully they had a spot for us! We had our own little secluded alcove all the way in the back of the restaurant - it felt very safe and we all felt comfortable considering we were dining indoors. The staff was very friendly and accommodating, and the food was delicious! I had yummy french toast and iced chai!", "date": "2021-03-03 15:21:53", "user": {"name": "Sofia", "review_count": 19, "yelping_since": "2017-10-30 02:43:51", "elite": "", "average_stars": 4.53, "fans": 0}}
{"review_id": "eppyF0DHOUt1BEro7B34ww", "user_id": "bNVKNecoSQJ7196xZVzB4g", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Byob brunch! The breakfast bowl is my favorite thing on their menu. I went here with two friends with three bottles of champagne. They have OJ so you can make mimosas and kept our bottles in ice. The staff is very friendly.", "date": "2021-03-02 11:39:15", "user": {"name": "Michelle", "review_count": 29, "yelping_since": "2011-04-08 03:22:53", "elite": "", "average_stars": 4.17, "fans": 2}}
{"review_id": "iaEUWftFw0MRVb6mOfNnzw", "user_id": "0CL4UUQUyjUWX8MDg1tgXw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Love Luna. Go there almost every weekend for breakfast or brunch. Love their breakfast sandwich and their chicken salad! Best Mac and cheese!!", "date": "2021-03-02 02:44:49", "user": {"name": "Abby", "review_count": 1, "yelping_since": "2019-07-22 15:16:45", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "xMi3zFCSWLLsNfSVnxAyuQ", "user_id": "nvKvElggENUequjbSaSJSg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Exceptional, pleasant server, tasty home fries, quick service and very fair prices! This was my first time at Luna Cafe and I would absolutely return and recommend it to many others. We were able sit outside and feel very Covid-safe in a convenient location after they sat us right away without a reservation. Thanks to the gentleman who waited on us for a breakfast that left us SO pleasantly surprised!", "date": "2021-02-08 18:01:47", "user": {"name": "Moira", "review_count": 2, "yelping_since": "2021-02-08 18:01:38", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "-CzURghvd6Z28g9_PDC5LA", "user_id": "GD_fG-xPP3jWjvWEpAOcRg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I had such a pleasant experience at Luna cafe on a recent Saturday morning. Everything from the food to the service happily exceeded my expectations. We were able to sit outside for breakfast, aside a heat lamp and felt that all Covid precautions were taken. Our server was so pleasant and helpful and the food was delicious. Home fries were crispy yet tender on the inside, fresh scrambled eggs cooked perfectly, great turkey sausage and fresh sourdough toast - the ideal breakfast. Can not recommend enough. Will be back soon!", "date": "2021-02-07 14:15:56", "user": {"name": "Erin", "review_count": 10, "yelping_since": "2016-06-19 17:45:47", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "LCPD5XBaekfAXVrfb-egcg", "user_id": "cb9zwhihLCfeRNhSEHeJjQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Luna Cafe is a GREAT spot for vegetarians and meat eaters alike. They have great outdoor seating set up on the sidewalk, with nice heaters for most of the tables. The staff is really friendly and accommodating - just nice people overall. Their coffees are delicious and the food is always great. I'm partial to their breakfast burrito - it's a great size and comes with crispy potatoes. Their biscuits and gravy is also amazing - the chicken is crisped to perfection. 10/10 recommend to anyone looking for good breakfast in old city.", "date": "2021-01-17 16:42:11", "user": {"name": "Mackenzie", "review_count": 18, "yelping_since": "2014-02-08 15:47:16", "elite": "", "average_stars": 4.58, "fans": 0}}
{"review_id": "bClu-U0jVf6QHQhhLu0dXQ", "user_id": "4qFcUYAelOBB8CbwdebrMA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "One of the best breakfast tacos I've ever had, authentically mexican style. Their french toast is thick and tasty as well! very nice people working here.", "date": "2021-01-01 19:19:35", "user": {"name": "Trent", "review_count": 2, "yelping_since": "2012-04-24 02:10:38", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "_94M_4khtYxXxUZhLG7e8A", "user_id": "2GaucOHHWzOkczylPnLg3g", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 2, "text": "Great option for pick-up! Everything has been fresh, well packaged and put together quickly. Great spot for weekly lunches", "date": "2020-12-08 20:10:37", "user": {"name": "Rachael", "review_count": 4, "yelping_since": "2015-10-03 21:30:03", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "aP37VV2gdvjJtXfBtUPkJA", "user_id": "7wlQXh5IDO5xPYnFnI7KZg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I hesitate to say anything negative about a restaurant during Covid, but the takeout we ordered was cold. For the prices, I did not expect to be paying for cold potatoes.", "date": "2020-11-15 16:33:30", "user": {"name": "Vanessa", "review_count": 15, "yelping_since": "2020-11-15 00:23:30", "elite": "", "average_stars": 4.4, "fans": 0}}
{"review_id": "B0H-ejcvWwPw3muBk1zC4w", "user_id": "ZsxdGABDAGQTubiJc8NUWw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered biscuits and gravy here and it was very disappointing. Biscuits were dry and practically stale. Gravy had an odd flavor and the eggs were not seasoned at all. I'm not sure what their other food or coffee is like, but all I can say is don't get the biscuits and gravy", "date": "2020-11-08 04:47:37", "user": {"name": "Devon", "review_count": 1, "yelping_since": "2020-09-04 15:04:00", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "6hPmpETWCpXd02K__uKyng", "user_id": "8pQxu8wqOJGKQ-T8_0JbAw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "We placed our order, after waiting for a while we asked our waitress where is our food.  Waitress tells us the printer ran out of ink, so our order didn't get placed.  My omelette was good, unfortunately my husbands breakfast was rushed and not what he had hoped.", "date": "2020-10-07 02:56:48", "user": {"name": "Christina", "review_count": 27, "yelping_since": "2018-02-08 15:36:40", "elite": "", "average_stars": 4.56, "fans": 0}}
{"review_id": "bMV-B_K14Kewy5QmMXaUUg", "user_id": "XtBjmkF65LCalyx7-pb1Jg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Don't waste your money. They charged for rotten avocado and asked for no potatoes? Best of luck in Covid word I will not be back.", "date": "2020-10-02 16:48:12", "user": {"name": "Peter", "review_count": 2, "yelping_since": "2015-07-20 03:03:30", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "HS8wNoj6s23NxzwVy9TeGw", "user_id": "ejDUqEJu2KWK8SGnrMDu8w", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Luna Cafe has perhaps the BEST breakfast in Old City - great coffee, great pancakes, (especially with banana slices cooked in and real maple syrup), and the breakfast bowl is another hit.  Excellent service, and a great outdoor setup.  Highly recommended!", "date": "2020-09-25 22:43:18", "user": {"name": "Craig", "review_count": 8, "yelping_since": "2011-01-31 15:02:20", "elite": "", "average_stars": 4.88, "fans": 0}}
{"review_id": "_mFd66Qj23uO4Ed1GtJkAQ", "user_id": "pnlscR0-0UB3ZORues_Jmg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Found this place while visiting Philly. The waiter was super awesome. The chai tea latte was delicious! The food was great! Would recommend.", "date": "2020-09-12 00:27:40", "user": {"name": "Christina", "review_count": 43, "yelping_since": "2012-09-02 23:39:52", "elite": "", "average_stars": 4.07, "fans": 0}}
{"review_id": "MCfSOAtHQywyTD8GC7vT8Q", "user_id": "ZSxdqJ8O3_-Jcc-EMyDGkg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "TERRIBLE SERVICE! \nI wanted to enjoy a nice brunch with my boyfriend here & was completely distraught by the time we left. First we ordered 2 of the peanut butter & Nutella smoothies & asked the server how it was made because I wanted one without bananas in it. He said he didn't know how it was made because it's made in the kitchen (whatever that's supposed to mean because if you're a server these are basic things you should know) he also said there wasn't any peanut butter & when I asked the other server he said there wasn't any Nutella. So I was confused about what they had & ordered 2 berry smoothies if there wasn't any peanut butter or if they Couldn't take out the bananas & I asked if he could check with the kitchen first before anything & let us know & he made us pay for everything before we even tried any of what we ordered. We paid & tipped before any of our things came, while everyone else had the opportunity to pay once they were done their meal (there were 3 other tables in front of us that we watched this happen) We got our food & smoothies( we received one smoothie without any Nutella when I never asked for that ) didn't like the smoothies so we asked if they can just give us orange juice in exchange for one smoothie we didn't like, yet they still tried to charge us for one small $4 cup of orange juice. Our tabs total came up to $66 with the tip included & they couldn't give us a complimentary orange juice? I was about to pay for it with my card when my boyfriend tried to take my card because we were just going to leave a $5 bill for the orange juice. The server tried to snatch my card from his hand & I asked to speak to a manager & he insisted he was the manager. We said we weren't going to pay for the orange juice because that was terrible service as paying customers. He also said he was going to charge us for the orange juice anyways without our permission. I will never recommend this place if you are a person of color & I would never come back to this restaurant.", "date": "2020-08-30 18:40:35", "user": {"name": "Janelis", "review_count": 2, "yelping_since": "2018-07-19 17:24:12", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "T0G5SVJ1GKEYMUphpCmeLw", "user_id": "LS0vD0mfT5WkJir6MIMVeA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We stopped by on a whim and were so satisfied. The food is fresh and delicious. You get good sized portions and the prices are more than reasonable. The staff was so kind and accommodating. JJ was our waitress and she was phenomenal!!!!\n\nWe will definitely be back!", "date": "2020-07-24 13:50:32", "user": {"name": "Amanda", "review_count": 19, "yelping_since": "2012-12-20 16:48:08", "elite": "", "average_stars": 3.7, "fans": 0}}
{"review_id": "udSs-3B1HALSrHxMw5xfLw", "user_id": "NDBiknJWS50Wwd65orCr-w", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Cute cafe in old city but very small so be prepared to wait. I was with a group of 7 and the hostess made us stand outside in the freezing cold (this was in January) due to lack of space. We finally got a table after standing around for 30ish minutes. \nOther than the wait, the food was fine. I wouldn't say it was over the top fabulous but it was yummy. The cinnamon roll pancakes were delicious at first but after a few bites it was too much. So glad that my friend and i split that with a regular omelette (I highly recommend doing so if you're considering the pancake as it is so rich and sugary.) Prices were standard for philly. I believe it was $13 for the omelette and $12 for the cinnamon roll pancakes.  \n\nOverall was an okay experience. Nothing that would have me running back for so would rather try something new next  time", "date": "2020-05-28 00:51:46", "user": {"name": "Rachel", "review_count": 203, "yelping_since": "2020-01-19 14:29:28", "elite": "20,20,2021", "average_stars": 4.14, "fans": 6}}
{"review_id": "w8FEQUOIqSWohS3_B63Q8g", "user_id": "1CP_dLhNHRH0AQDurgUIXg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Cute little place with great coffee and the best sausage gravy over biscuits I've ever had", "date": "2020-03-16 02:09:22", "user": {"name": "Abigail", "review_count": 6, "yelping_since": "2014-11-02 18:33:53", "elite": "", "average_stars": 4.17, "fans": 0}}
{"review_id": "-STQRfa49uNf--gDSVeNeA", "user_id": "NNgVvGgk_aj-ZrJLBQ2syA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Smaller than I thought it would be, but don't let that deceive you! It is so scrumptious! I got the Lumberjack whereas my husband ordered the Philly Muffin and holy cow, it was all so good! I loved the texture of the pancakes for the Lumberjack! There was so so much flavor! \n\nService was super fast, and friendly! Everyone truly wanted to help and asked how you were doing. Loved it!!! \n\nIt's cash only but they have an ATM in the back!\n\nThe only thing we weren't a fan of was the side of potatoes, they didn't seem to have much flavor and cost more than you would think given the serving size. Literally that was the only down side!", "date": "2020-03-16 02:01:06", "user": {"name": "Emily", "review_count": 41, "yelping_since": "2019-12-02 00:43:56", "elite": "20,20,2021", "average_stars": 4.88, "fans": 0}}
{"review_id": "FmCJZa59b_kaaBahnayuLg", "user_id": "Pbelma-y1GRvf4HuJtSoOA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "It is a cute cafe with delicious food. Their pumpkin spice latte is to die for during fall. I ordered their special fall breakfast and it was amazing.", "date": "2020-03-13 22:42:43", "user": {"name": "Alessia", "review_count": 4, "yelping_since": "2018-07-15 22:34:48", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "w9Hr0ZWF9ruztmYV3Hye1g", "user_id": "kTpsjDUhl9BlRl0FVuNreA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 4.0, "useful": 34, "funny": 6, "cool": 22, "text": "After two visits to Luna Café, I'm feeling confident giving it four stars. During my first visit, I was a little disappointment with the sandwich I got but glad I ended up back there a second time because this experience was much better. \n\nOn my most recent visit, I had the portobello and pesto bowl and it was delicious. It was packed with quinoa, grilled chicken, portobello mushrooms, and corn. It normally comes with chickpeas as well but I asked our server to hold them because I'm allergic. The grilled chicken was cooked perfectly and the bowl came with homemade pesto that was really good. I do wish it had come with more pesto, but I was so deep in conversation with my dining partner that I kept forgetting to ask for more!\n\nOur waitress was nice and service was very fast. She gave me as many coffee refills as I needed which was much appreciated (one of the days!). \n\nIf I return, I'll most likely get the portobello and pesto bowl again or maybe I'll try a different one. There's a few different bowls on the menu and they all sound great!", "date": "2020-03-10 19:07:19", "user": {"name": "Alisha", "review_count": 378, "yelping_since": "2016-07-06 01:19:07", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 3.97, "fans": 462}}
{"review_id": "CD8aTYJ4EAMbjKBShDmavQ", "user_id": "VYuuNzTWju8D0rr8SvaZjA", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 4.0, "useful": 3, "funny": 0, "cool": 1, "text": "The first attraction to this cute little spot was purely geographic. One day I woke up in the mood to brunch but not in the mood to go further than a couple blocks. Luna cafe allowed me to satisfy both moods that day and I've been back a few times since. \n\nThis place is consistently good. The food is fresh and the service is efficient. It's tiny so there is usually a line on the weekends but it goes quickly in spite of the limited seating. If you're claustrophobic I would avoid the counter seating in the back. It's close quarters and not the most comfortable. \n\nI LOVE the breakfast quinoa bowl with an over easy egg on top. Big bowl and very filling. The cilantro aioli rounds out the flavors but I've had it without and it was still good. Also, great are the build your own breakfast sandwich and the huevos rancheros. \n\nThis is a solid option for your breakfast/brunch needs.", "date": "2020-03-05 20:40:40", "user": {"name": "Colleen", "review_count": 533, "yelping_since": "2010-01-28 20:52:54", "elite": "2011,2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.69, "fans": 41}}
{"review_id": "acoaKKfGjikmpk75zTRe6A", "user_id": "iIYmtLnIyWLeFNXN1zrjaQ", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Visiting Philly from NYC with my family.  I googled breakfast places close to our hotel impulsively, and this place happened to pop up.  I liked the menu so we strolled on over.  It was a tiny little place (it reminded me of a place I would have brunch in college)with an overwhelming hipster vibe.  Our waiter offered to put our stroller in the back, which was very accommodating.  Everything that we ordered was abundant, delicious (including the Mac and cheese we ordered for my 17 month old), and reasonably priced.  I cannot day enough good things about this place.  If we lived here, we would be regulars.", "date": "2020-02-22 03:24:56", "user": {"name": "Sara", "review_count": 36, "yelping_since": "2013-02-01 01:44:04", "elite": "", "average_stars": 2.84, "fans": 0}}
{"review_id": "8N0yp4PX9w5RXT4P1-PoaA", "user_id": "T9MJh8OPE1Xt9yUyPp0Hhw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "ordered pancakes, potato \"frittata,\" and the apple cinnamon french toast. overall, good food. but--pancakes first came out raw. tried to get waitress' attention for about 6 minutes, she walked past us multiple times and didn't stop. they ended up putting my pancakes back on the heat and they were better after. frittata was not a frittata, it was an open omelette with just a couple chunks of potato and cheese. french toast was super cinnamon, which was good, but a bit overwhelming. good coffee.", "date": "2020-02-17 14:09:31", "user": {"name": "Sof", "review_count": 20, "yelping_since": "2019-07-18 15:54:55", "elite": "", "average_stars": 4.45, "fans": 0}}
{"review_id": "vbbnaGSnnusGxfhc0Luj2g", "user_id": "ShIkKzYKICqbneju1VQoWg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Such a great breakfast place!!!! The Nutella toast was scrumptious as well as a raving review from my breakfast loving boyfriend for their apple cinnamon French toast. They're cash only so keep that in mind-- they do have an atm at the back!!! Atmosphere great, coffee amazing, and servers super welcoming. Don't think, just go!", "date": "2020-02-16 19:05:44", "user": {"name": "Kaye", "review_count": 2, "yelping_since": "2018-01-15 03:15:55", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "GjL4QDOK5cO73YmF_6AFKQ", "user_id": "X0dolCZeL1Qa7FLl_0hErw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been wanting to try this place for the longest time and I'm so glad I finally did! The service was great and very friendly. The food was good, but the drinks were even better! I got an iced latte that was one of the best I've had. The only downside to this place is that it is cash only which I didn't know about and that they have different hours for winter which are listed. Overall a really cute spot I definitely recommend!", "date": "2020-02-12 14:38:25", "user": {"name": "Allison", "review_count": 2, "yelping_since": "2017-12-27 21:37:20", "elite": "", "average_stars": 3.2, "fans": 0}}
{"review_id": "yNvV-03RdGLw2WTgkbkbMg", "user_id": "T4BDVwz686H8iIAAOafVIg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a cute little place  , staff is super friendly , atmosphere is hip and food is delicious! Can't  go wrong !!", "date": "2020-02-09 19:19:45", "user": {"name": "Ursula", "review_count": 3, "yelping_since": "2020-02-09 19:08:56", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Xvee7YHMH_bmYsrh_be1NQ", "user_id": "MLoZXIT6eKvoUIiU6Y2caw", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great cafe, definitely worth a stop in. Friendly staff and a really charming environment on top of great food. The burger was amazing and filling; my sister had the breakfast burrito and loved it.", "date": "2020-02-04 19:42:10", "user": {"name": "Michael", "review_count": 5, "yelping_since": "2016-02-05 19:30:43", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "vJPomO2TLcoFZxcJffCBPg", "user_id": "pkDIZTrqQ9saczmLQYQxHg", "business_id": "7NwFNLC0SwX1SwQYlfF5yw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Super cute space, amazing food, reasonably priced! Be aware: it is cash only but they do have an ATM!", "date": "2020-01-23 16:48:18", "user": {"name": "Amaal", "review_count": 1, "yelping_since": "2019-02-13 20:21:36", "elite": "", "average_stars": 5.0, "fans": 0}}
