{"business_id": "irXywqvfXj9maLLOBQMYvg", "name": "Manakeesh Cafe Bakery & Grill", "address": "4420 Walnut St", "city": "Philadelphia", "state": "PA", "postal_code": "19104", "latitude": 39.9549844, "longitude": -75.2115232, "stars": 4.0, "review_count": 646, "is_open": 1, "attributes": {"BusinessAcceptsCreditCards": "True", "RestaurantsReservations": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "BikeParking": "True", "Caters": "True", "RestaurantsDelivery": "True", "WiFi": "u'free'", "HasTV": "True", "RestaurantsGoodForGroups": "True", "GoodForKids": "True", "Alcohol": "u'none'", "RestaurantsAttire": "u'casual'", "HappyHour": "False", "Corkage": "False", "RestaurantsTableService": "False", "NoiseLevel": "u'average'", "GoodForMeal": "{'dessert': True, 'latenight': False, 'lunch': True, 'dinner': True, 'brunch': True, 'breakfast': None}", "DogsAllowed": "False", "OutdoorSeating": "True", "Ambience": "{u'divey': False, u'hipster': False, u'casual': True, u'touristy': False, u'trendy': None, u'intimate': False, u'romantic': False, u'classy': False, u'upscale': False}", "ByAppointmentOnly": "False", "RestaurantsTakeOut": "True", "WheelchairAccessible": "True", "RestaurantsPriceRange2": "2", "BYOB": "False"}, "categories": "Bakeries, Food, Mediterranean, Breakfast & Brunch, Middle Eastern, Restaurants, Lebanese, Coffee & Tea, Halal", "hours": {"Monday": "10:0-21:30", "Tuesday": "10:0-21:0", "Wednesday": "10:0-21:0", "Thursday": "10:0-21:0", "Friday": "14:0-21:30", "Saturday": "10:0-21:30", "Sunday": "10:0-21:0"}, "category_list": ["Bakeries", "Food", "Mediterranean", "Breakfast & Brunch", "Middle Eastern", "Restaurants", "Lebanese", "Coffee & Tea", "Halal"], "stratification_tag": "Coffee & Tea"}
{"review_id": "yt58FDcst5LubBe1CDZBJg", "user_id": "NboceT6ftUDbD1QM-hS0Uw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Heard great things about Manakeesh and was honestly slightly disappointed. Ordered the chicken kabob platter and pistachio baklava. Overall though the portions were big and I'm willing to give it another try.\n\nI wouldn't order the chicken kabob again, but the fries were great. I would try the chicken shawarma instead. \n\nPistachio baklava was stale, although staleness could have just been because I went near closing, but that's no excuse.", "date": "2022-01-10 10:02:52", "user": {"name": "Christian", "review_count": 16, "yelping_since": "2017-12-26 23:27:50", "elite": "", "average_stars": 3.84, "fans": 0}}
{"review_id": "lEOMitpRjvzpkmL_iPSn4Q", "user_id": "WtnerGVQjEgJHNM2rnJDEg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "URGH! This is a \"revenge addendum\"! I hate this place! If you have ANY need for simplicity or punctuality do NOT order from here! Food still amongst the most authentic and tasty Lebanese food in Philly, business practices still a nightmare! Could it be personal? Maybe they hate me? Order 50 minutes late and two orders delivered not one, delivery person (who didn't go to correct location to begin with) had the nerve to call an hour later and question me why we \"opened the second order\"!", "date": "2021-12-26 17:24:07", "user": {"name": "David", "review_count": 98, "yelping_since": "2009-03-15 21:00:53", "elite": "", "average_stars": 3.53, "fans": 0}}
{"review_id": "pXVR3Q45VwVTd9XxPV8DLw", "user_id": "BmVwbsL8l0imz4slonyMaA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 37, "funny": 19, "cool": 34, "text": "I really wanted a chicken crepe from here, but the online menu said they \"may can fulfill\" the order depend on the moment. I didn't understand that so I just ordered the lamb manakeesh type flatbread. My wife ordered a potato and cauliflower wrap. \n\nThe taste of my lamb mana was all there, but i was really surprised at how small it was compared to before. All good, I get that's becoming the norm at some places. I pretty much folded it into a wrap lol\n\nMy wife's wrap was HUGE and she really enjoyed the flavor. I asked for a bite, but she wasn't in the sharing mood because her wrap was so tasty. Maybe next time she will share. OR maybe I'll just order a wrap.", "date": "2021-12-25 06:31:30", "user": {"name": "Morris", "review_count": 261, "yelping_since": "2012-02-29 18:27:36", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.39, "fans": 713}}
{"review_id": "yLZDRXEZ5NPnZj15Ja0u2A", "user_id": "7oGfh7PLESQuib8uP0UwPA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great for a casual night, service can be a little hit-or-miss but the food hits the spot and the pita is so fluffy and pillowy. They give you so much hummus and the vibe outside is lively, inside is very low-key. I love the chicken platter.", "date": "2021-11-19 16:45:14", "user": {"name": "Nikhita", "review_count": 5, "yelping_since": "2021-11-19 16:39:26", "elite": "", "average_stars": 4.6, "fans": 0}}
{"review_id": "CqJUQ-5gz9NNmaA-DO77LA", "user_id": "KMQQeD6WkI1Pparr97B1Ow", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent flavors and decent portions, not cheap but you pay what you get for. I was a bit miffed with the staff who knew I was there to pick up my to go order, but failed to let me know when it was actually ready. When I pointed out that my order was waiting, they deferred responsibility. Also, they forgot the hummus on my daughter's wrap. But it was all quite delicious. Probably much better to get a simple order and check it on the premises.  A separate dessert counter with padded seating area and mood lighting is an inviting feature of this authentic cafe.", "date": "2021-11-07 03:18:24", "user": {"name": "Preston", "review_count": 4, "yelping_since": "2013-04-16 16:23:11", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "GtyHicF3yQ-ghE8Hl82D-Q", "user_id": "lBd2PMaBPdpRbUQEh1hHSg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 11, "funny": 4, "cool": 7, "text": "We got the chicken and beef manakeesh which are Lebanese flatbread pizza. The flavorings were very unique, I thought the chicken one was better. The beef one was strange because it was ground beef pieces instead of slices of beef. I wasn't a big fan of that. \n\nThe left side of the store is a cafe where you order meals and the right side is a bakery with many baklava selections and other Lebanese desserts. They even had coffee, tea, and fruit juices. I didn't get to try anything from the bakery but will definitely be back to try more items.", "date": "2021-11-05 16:36:47", "user": {"name": "Anna", "review_count": 227, "yelping_since": "2016-05-28 14:20:28", "elite": "20,20,2021", "average_stars": 4.22, "fans": 19}}
{"review_id": "ba9Mo_kmSs-3-inXZ7ZDaw", "user_id": "7-3Cu6nLJDXv7KS7R9Ap5g", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "If you're in Philly and craving Lebanese or Middle Eastern food, you absolutely have to head to Manakeesh. It beats most places I've tried in other cities. The menu offers a diverse selection and it took us a while to decide what to order. We ended up going with a Zatar Labneh and Chicken Tawouk Platter. The taste, quality and flavor of the meat, quantity of food, and richness was worth more than 5 stars. If I could leave more, I would. It also seems to be always packed and well frequented in the area. If you're ever in West Philly, you have to check it out.", "date": "2021-11-01 12:15:06", "user": {"name": "Mohit", "review_count": 84, "yelping_since": "2014-11-08 00:27:47", "elite": "20,20,2021", "average_stars": 4.4, "fans": 2}}
{"review_id": "CEjMsH6U1uNlgp1KP6rKDw", "user_id": "fByH7HF-mFP-CwTMHrKhYw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Racist owners would not cater a wedding once they found out it was a gay couple. Wake up people. It's the age of inclusion not the age of racism and discrimination. So many options nearby for the same exact food. Buy from people who like their customers, not one who points to the middle eastern customers behind me to take their order in another language. I'm white so I don't get to order next? How fucking rude can you be.", "date": "2021-10-14 12:06:03", "user": {"name": "David", "review_count": 15, "yelping_since": "2017-03-28 10:44:54", "elite": "", "average_stars": 1.21, "fans": 0}}
{"review_id": "fGE9aXsZwleMgFUMTZMB-w", "user_id": "jEdaxlVFRAJSBvKVP5Zssw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Any of the fire grilled wraps or shawarma platters will change your life. This place helped me find god.", "date": "2021-10-13 18:42:09", "user": {"name": "Tyler", "review_count": 1, "yelping_since": "2016-07-22 13:55:41", "elite": "", "average_stars": 5.0, "fans": 1}}
{"review_id": "gcPIlMbJ1mBeMj3T9i34gQ", "user_id": "YSdjmwmiw-R-eXjcx1-fGw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "We were in Philly for a midday event after which craved a Lebanese lunch. We know the cuisine, especially my wife, who is from Beirut. Manakeesh was pretty close by so we ordered a few things over the phone to pick up as we drove there. \n\nThe place is totally, authentically Lebanese. They were taking the bread for our order out of the oven as we arrived. The chicken shawarma is the best we've ever had in this country with real toum (garlic spread) and juicy meat. The baba ghanouj is smoky and a little chunky, like homemade, addictive and not at all bitter. The zaatar bread and beef lahm bajeen, amazing. \n\nWe are going to go to Philly more often knowing Manakeesh is there to brighten the day and will try out other dishes without hesitation.", "date": "2021-10-06 21:26:19", "user": {"name": "Jim", "review_count": 18, "yelping_since": "2011-05-03 11:51:36", "elite": "", "average_stars": 2.95, "fans": 0}}
{"review_id": "5Iv-7fIqvux3aGTItal1wg", "user_id": "ygQxFoytqvt6W0E2NQPJow", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 6, "funny": 3, "cool": 7, "text": "Manakeesh is so good! It's a must try if you're in the area. It is very authentic in flavor. I have so many recommendations. \n\nI love their cauliflower and batata. They also have a delicious hummus, and baba ghanouj. \n\nThe balilah and the fool are great, flavorful entrees! \n\nThey have a nice mint lemonade. I've also tried the cheese omelet and waffle during brunch hours. I had loved those as well. \n\nFive stars! Support a great local business!", "date": "2021-09-25 16:02:24", "user": {"name": "Nikki", "review_count": 194, "yelping_since": "2021-06-26 12:29:04", "elite": "2021", "average_stars": 4.32, "fans": 7}}
{"review_id": "Ewfi2iMTxQQRt--8RtXwiw", "user_id": "kiNJZEJvgUMqE_jVtZTAAQ", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'm writing this review as I'm waiting for my sandwich for the past 40 minutes. If they would've told me it would take 40 minutes and more I wouldn't have ordered. I used my lunch break to get this food and now I don't have enough time to eat it. Probably not coming back. If you plan on eating here order on the phone or online an hour ahead because they rush those orders more than the actual customers order in store!", "date": "2021-09-16 16:42:48", "user": {"name": "Tiba", "review_count": 7, "yelping_since": "2017-10-20 16:20:45", "elite": "", "average_stars": 3.63, "fans": 0}}
{"review_id": "tJFERB8efKwKD7V7lBlJnA", "user_id": "aV858cB5at6NOpPEdgl64w", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "A nice welcoming atmosphere and great food especially their Lebanese style \"Manakeesh\" a taste of home faraway from home. I love the kafta too and the falafel sandwiches.", "date": "2021-09-16 10:22:40", "user": {"name": "Osman", "review_count": 2, "yelping_since": "2021-09-16 10:08:19", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "eXgL7y0oZn26cXdt4JxalQ", "user_id": "JhvlUqAhydwG08kuxrzoyw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The chicken is some of the best i've had and overpowers an overall meh ordering experience.  The chicken came hot, well seasoned, over a bed of delectable rice.  It was served with some creme thing and a side salad of cucs, tomatoes and onions.  Overall damn good- better chicken than Yiro Yiro.\n\nThe lamb strips were also good- very great with tsaziki.\n\nThe lamb manakeesh that I got was absolutely not for me.  Too pickly, and was not as hot as the other dishes.  Also was not crispy which was sad.\n\nBetween the manakeesh and the 1.5hr wait for doordash to be able to even pick the food up, I maybe should have taken 2 stars.  But the chicken is really really worth it and made with love, and I did not want to distort this place and turn people away when they NEED to get the chicken here!", "date": "2021-09-13 02:09:59", "user": {"name": "Charlie", "review_count": 523, "yelping_since": "2014-10-11 19:19:27", "elite": "2018,2019,20,20,2021", "average_stars": 3.55, "fans": 12}}
{"review_id": "8VjVkgxm7OEPfxfz0ikZMQ", "user_id": "R7L6Fz8_SJuPJx3TqwzfTA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The flaming hot oven at Manakeesh Cafe & Bakery turns out the most tasty namesake Lebanese flatbreads with a choice of delicious toppings. The Lahm Bajeen (ground beef) and the Lamb Lahm Bajeen (ground lamb) were flatbreads topped with spiced ground meat mixed with tomato, green peppers, and onions, and this savory, juicy mixture paired with some refreshing pickle slices was the perfect complement to the crispy flatbread underneath. We also got an order of the Meza, a set of 6 different appetizers from the menu, which were each plated individually and made for quite the colorful spread! There was the creamy, lemony hummus; tabbouleh; stuffed grape leaves; four crispy falafels with tahini sauce; and my favorites, a refreshing fattoush salad made of lettuce, tomatoes, onions, cucumbers, pita chips, and sumac; and a smokey baba ghanoush. There was just as much emphasis placed on the presentation of each dish as on the flavors, and each of the meza plates was meticulously garnished: a sprinkling of paprika and olive oil on the hummus, sumac on the baba ghanoush, and pickles/lettuce/tomatoes with the grape leaves. All the food was fresh and delicious, and the mezas were served with two flat, chewy pita breads on the side, which were perfect for wiping up the dips and eating with the salads!", "date": "2021-09-03 20:04:23", "user": {"name": "David", "review_count": 1741, "yelping_since": "2016-07-25 01:23:29", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.07, "fans": 122}}
{"review_id": "OYif2K9ikGjMQ8ivKLT3Eg", "user_id": "DrvmH6hJifrAyqQR0Sliww", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is still my go-to Middle Eastern restaurant in Philly so far. Their service was not pleasant and I kind of noticed that their food quality is going downhill a little bit. But their pita/flatbread is still the best in Philly & I will still come here to just get their flatbread pizza (Manakeesh)! I recommend to try their chicken tawook (creamy & spicy) or Kafta (beef & lamb). We also ordered chicken shawarma platter, but it took much longer than the chicken tawook manakeesh, so I suggest you to get the manakeesh dish if you want something quick/to-go meal. We also added rice into our shawarma platter, but their rice was flavorless, so get the pita bread instead or rice. Their hummus was really creamy & rich, but it was too sour to me. I probably will try their other hummus-like dip \"Muhammara\" (roasted red pepper dip) with pita next time.", "date": "2021-08-25 18:33:47", "user": {"name": "Hana", "review_count": 60, "yelping_since": "2014-10-04 20:07:25", "elite": "2021", "average_stars": 4.24, "fans": 0}}
{"review_id": "pDL08GQe0r1HQPnXpWGBYg", "user_id": "a2JdNtFqB-C38ga_06BHvw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "The last FIVE times I have ordered pickup from Manakeesh, which I would previously have given five stars, the food has not been ready until 30 minutes AFTER the pick up time. Really? Requiring customers to stand around waiting for 30 minutes for a scheduled take-out order? This last time, as earlier, there was no one else in the place, and the workers were moving in a very slack and slow manner. I've noticed that the owner doesn't seem to be around as much anymore. This is no way to treat your loyal customers, some of whom have gone to a lot of trouble to patronize you over the last year and a half. Please do something about this!", "date": "2021-08-05 16:33:22", "user": {"name": "Alex", "review_count": 55, "yelping_since": "2006-12-08 20:36:13", "elite": "", "average_stars": 2.08, "fans": 1}}
{"review_id": "Q7AlpwkDig-GJK23_DDb7g", "user_id": "NA6e10LQY7fzX1VFXiPAZg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Terrible! terrible! 1 star only for the taste and no star for rude staffs who absolutely customers' time means nothing to them! I've been waiting 55 min today for 3 wraps! 55min and that includes reminding them about my existence twice! be aware! once you paid you are trapped and there is an endless tunnel of time for them to slowly process your order! \nToday was my second time being here. the first time 2 orders out of 3 were totally wrong!!! yet i decided to give it a 2nd chance and oops! again another shittstorm! if you go there just make sure you gonna be free all day long! terrrrible!!!", "date": "2021-08-01 17:53:59", "user": {"name": "Mohadeseh", "review_count": 1, "yelping_since": "2019-03-30 05:15:35", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "wTavJSBn4wIqLazF2_vLeg", "user_id": "I0lWz0Q4lwRlwqCAlxCfMg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "MashaAllah, great cafe and bakery. Very clean, service was great and food/coffee was perfect.", "date": "2021-08-01 01:12:13", "user": {"name": "Fady", "review_count": 11, "yelping_since": "2017-11-14 13:13:47", "elite": "", "average_stars": 4.64, "fans": 0}}
{"review_id": "jYw_TBx8MZCkj707kumg-A", "user_id": "6OyHTMvoss1ih0rPFLGCpQ", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I came here last night for the first time and was blown away. Their everything was jaw dropping. I also had my first crème brûlée and it was mouth watering my amazing. I would come here again every night if I could. Thank you for a great experience", "date": "2021-07-13 15:24:02", "user": {"name": "Bianca", "review_count": 9, "yelping_since": "2018-11-08 20:28:17", "elite": "", "average_stars": 4.11, "fans": 0}}
{"review_id": "69Lm-dDlMU7Cf2XhCXrpWA", "user_id": "oTV1uTjN4QBG_DUTLEjONA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've had delivery from this restaurant twice now while working late evening shifts. I've been consistently impressed by the food. I've tried the lamb kofta kebab, the chicken tawook kebab wrap, and one of the Manakeeshes. All of the dishes were flavorful and delicious. The food was hot and held up well in delivery. The baklava was pretty good too. \n\nThis place is now my go to suggestion for when we order food at work, and I'm looking forward to eating here in person.", "date": "2021-07-11 15:06:02", "user": {"name": "David", "review_count": 35, "yelping_since": "2018-12-01 16:04:26", "elite": "", "average_stars": 3.87, "fans": 0}}
{"review_id": "VMN2Se6-uMdfn7P3QxT6xw", "user_id": "_fqQEXaz03oTsQODMehJ2g", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "I've been coming to this place on and off for years now. I've seen it grow from a small one-room shop to a large beautifully decorated multi-sectional restaurant, smoothie bar, and dessert space. The food is always really good (the manakeesh, labs, veg platter, basbusa, Arabian sundae you name it!) and the staff is professional and helpful. I appreciate how the inside decor is so elegant but the atmosphere is down to earth and homey. I would recommend this place to anyone who wants to treat themselves at a decent price. Thank you to the owners and staff for many great years of service!", "date": "2021-06-30 14:33:32", "user": {"name": "Meghna", "review_count": 2, "yelping_since": "2009-04-18 14:45:34", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "6hCQY8NFaZ0oeTvR5d5LMA", "user_id": "7EVsupIaYa9Cmfo4jJoTmA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I would recommend you order ahead of time if you plan on coming here so you do not have to wait in line. The cafe is currently open for both indoor and outdoor dining. Among the two of us, we shared a Baba Gannouj (great smokey flavor), Lahm Bajeen Manakeesh (loved the picked peppers), and a pita (it did not come with the baba gannouj). Overall, the food was very good.", "date": "2021-06-28 19:56:40", "user": {"name": "Emma", "review_count": 238, "yelping_since": "2017-06-26 18:41:40", "elite": "20,20,2021", "average_stars": 4.21, "fans": 3}}
{"review_id": "rzPdwLloTYx4AqH6g70BbA", "user_id": "e9m9Z8mHITICmOVOSRw-Xw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had heard good things about Manakeesh from friends so decided to check it out. \n\nUpon entering the restaurant, there is a large counter for customers to place and pay their order. Once paid you will get a number to place on your table. With this number system I'm not sure if it was for the staff to bring you your food or for you to pickup once your food is ready. I saw both scenarios happening when I was there. \n\nThe menu:\n-The menu is substantive and has many options for different dietary restrictions. \n-There are a few parts of the menu which are confusing since they seem similar with other menu items, however the person behind the counter was able to clarify easily for us. \n-We noticed this after, but there is a printed menu available at the counter, not only the one above the counter as we had thought.\n-There is signage at the counter indicating that due to rising costs, all prices will be increased by 5% from what is stated. However checking in on Yelp yields a 5% off purchase coupon.\n\nFood:\n-The portions are huge and easily shared\n-The pita is made to order and very delicious \n-Everyone in the group enjoyed their order.\n-The bakery's menu looked delicious but sadly most items were out of stock. \n\nWith all the positives listed above, you may be wondering why the three star review.  The bathroom was absolutely filthy and disgusting. I am hoping it's due to a fluke but it was bad enough to dock a star. Upon future visits If the situation improves I will update my review. \n\nAdditionally the whole numbering system is frankly confusing. Some of us had our food brought to us. Others had to keep looking at the area where food that was ready to see if our order was there.  The restaurant was not busy so we were unsure what the deal was. This resulted in loss of a star since the last person in our group to get their food, where the rest of the group was already midway through theirs. This resulted in the loss of another star. \n\nOverall I would give Manakeesh another chance and also would love to try their bakery. I hope they take the feedback and address it. \n\nThings to know:\n-It will be easier to look and order off printed menu versus one displayed above counter\n-Indoor and outdoor seating available\n-Pay attention to food that is ready to be served, your order may be stuck there if you are waiting for it to be brought to you \n-Guest WiFi available \n-Come prepared with hand sanitizer to wash your hands versus using the bathroom. And do your best to avoid having to use the restaurant restroom. You will thank me later. \n-Cutlery, napkins, and water are self served.  However the water cups are TINY (like 4 sips) so be prepared to refill often or (what I recommend) bring your own refillable water bottle/cup. \n-Street parking only\n-There is a small section stocked with different items such as honey, Turkish delight, nuts, candy, etc. \n-Manakeesh has their own app for you to place delivery orders and get discounts from", "date": "2021-06-26 12:37:04", "user": {"name": "Manta", "review_count": 71, "yelping_since": "2010-05-04 22:47:11", "elite": "", "average_stars": 3.78, "fans": 0}}
{"review_id": "EzCPE43WMBBBO9ZITcJBXw", "user_id": "pJ35nordG8JE59FBRoyTfQ", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Comfortable space, delicious food, great tea and snacks. Manakeesh is open and a great place to eat as well as study or work. Tables chairs as well as cushioned seating indoors and a covered outdoor space. The platters are very filling and there is a wide selection of sandwiches as well. The tea and pastries are a great desert or working snack. Ambience makes you fee you are in Beirut and the staff is very friendly. I've been coming for years and hope they stay open for many more.", "date": "2021-06-21 17:20:27", "user": {"name": "Jahan", "review_count": 2, "yelping_since": "2015-06-07 04:55:20", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "BI9G_I01yCPX6xYckVXW2Q", "user_id": "HFMAIidi_BKi88Tshc3R6Q", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "If I could give half of a star I would. Horrible customer service. Order an hour ago and when arrived I was told it wasn't started yet and tbh it would take another twenty minutes.", "date": "2021-05-22 14:12:20", "user": {"name": "Brittany", "review_count": 3, "yelping_since": "2020-10-19 22:05:49", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "3FMojZPqwcq3m5GbQTCovg", "user_id": "Frrm0rDKH3KtebjtaKAhXw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 2.0, "useful": 5, "funny": 0, "cool": 1, "text": "I've been eating here for almost 7 years now and never left a review because they were just so awesome and the word of mouth was doing the trick for them. They are always busy, full of customers and just doing well. I was an advocate of this place.  I can easily call myself a Manakeesh veteran as I would order from here atleast once a week. No seriously. I would. \n\nWhy I am leaving this review now is because in the last 2 years or so their service and quality has deteriorated a lot. They are now almost always late with their food orders. Absolutely rude and unapologetic about it and frankly do not care. The Manakeesh I knew used to warm, soft, caring and really welcoming. The quality of food is also now just okay. \n\nThey are still one of the better lebanese fast food restaurants in Philly as not a lot places are as authentic with their flavours as Manakeesh is. Their menu also is very representative of Lebanese cuisine so full props on that. \n\nPlease improve your service, start caring more and really no other middle eastern cuisine serving restaurant would be able to compete with you! \n\nTL:DR - Service sucks. Food quality is good. Order the Tawook wrap. The Lahm Manakeesh. The Combo Manakeesh and a bowl of Hummus. Best items on the menu.", "date": "2021-04-24 01:44:15", "user": {"name": "Ankit", "review_count": 10, "yelping_since": "2011-11-25 09:13:26", "elite": "", "average_stars": 4.1, "fans": 1}}
{"review_id": "UBG-HF1SOqDud0fslfKGzQ", "user_id": "GL6qwC_XknPDwiylqhO6Jg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 4, "funny": 1, "cool": 4, "text": "Nice place.\n\nWe went here during the peak of Covid and everything was perfect.\n\nThe baklava in particular was to die for.\n\nAlso, you can't go wrong with anything from the hot food menu.", "date": "2021-04-19 00:26:20", "user": {"name": "Eric", "review_count": 460, "yelping_since": "2009-10-22 21:22:23", "elite": "20,20,2021", "average_stars": 4.61, "fans": 9}}
{"review_id": "1BofMRLTqWW398QgWezbyg", "user_id": "sxN9RfmQLtNvRmPbqvcwdQ", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I thought the falafel wraps from the halal trucks all around Philly were good.... WAIT until you try the equivalent here. Tear jerkingly good. See also: chicken kebab", "date": "2021-04-10 23:43:36", "user": {"name": "Lily", "review_count": 14, "yelping_since": "2017-03-07 23:46:03", "elite": "", "average_stars": 4.71, "fans": 0}}
{"review_id": "869GHeIl7ivyWyPlQ5Mx_g", "user_id": "VhyMPBkWc1mcFpuu2CAAKw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 6, "funny": 1, "cool": 4, "text": "After my third time at Manakeesh, I'm finally ready to write a review. Why three times, instead of my usual pre-review requirement of two? Well...in spite of all the other adoring reviews, and in spite of the fact that Middle Eastern/Mediterranean cuisine is my favorite, I just wasn't having great luck with my orders, until this past Friday. \nSo let's start with the best, and work back to most disappointing;\nOn Friday I ordered a grape leaves wrap for dinner. I knew that I really liked their stuffed grape leaves (or, as known by their Greek name, dolmades) and how can you go wrong with fattoush salad (hold the onions!) and baba ghanoush? Well, they forgot to hold the onions, but they did call me not 5 minutes after my pick-up to apologize and offer to replace the whole meal. I told them not to worry, and I was glad I did (the onions were few and easy to pick out anyway). It was a really great wrap, and a perfect portion. Flavorful and filling, but not too much so. My partner got the falafel platter, which he really liked, but the massive hummus portion packs a punch - you might not want to finish it in a single sitting. \nSo I knew I liked the stuffed grape leaves thanks to the ma'ali platter. That was from visit number two. Sadly, that was the only thing I completely enjoyed from that meal (which I shared with my partner, together with a cheese manakeesh). The fried cauliflower, eggplant and potatoes were tasty enough, but so loaded down with oil that I really didn't feel great soon after. As for the cheese manakeesh...I just don't get it. What am I missing?\nMy first visit was the biggest disappointment. I ordered the cheese and spinach manakeesh. The spinach was so briny I could barely eat it. I guess I was expecting a more Greek-style cheese-spinach blend, and this was not that. I mean, I love pickled cucumbers, but Manakeedh goes super heavy on vinegar and pickled foods, at least on everything I've had.\nNot the most glowing review, and it really feels more like 3.5 than 4 stars, but I gave the full 4 because the service is great, very quick, friendly and mindful, and everyone else I've gone with has really enjoyed their food. I'm really tempted to try one of their vegetarian savory crepes, but I'm not sure yet if there will be a fourth visit. Stay tuned.", "date": "2021-04-06 01:53:55", "user": {"name": "Alexandra", "review_count": 286, "yelping_since": "2008-02-27 22:39:48", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.99, "fans": 103}}
{"review_id": "Vf6V2JoA8vs8iyj2_KiccQ", "user_id": "ND2dBckgVv9qGA0te2Qcmw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "My takeout meal was 1 star but my wife's and daughter's were very good, which is more typical.  I ordered 1/2 grilled chicken.  It was visibly burnt on the outside.  I wouldn't mind so much if it was just a bit crisp on the outside but moist and flavorful on the inside.  But it was way overcooked all the way through, making it dry and worthy of the trash basket and not much else.  Same went for the pita underneath it.  A chicken wrap, roasted veggies and a kebob were fine.  In the past we have enjoyed mint tea, desserts and crepes.  We will still likely return but I would definitely not try the grilled chicken again or recommend it.", "date": "2021-04-06 01:15:53", "user": {"name": "Mark", "review_count": 15, "yelping_since": "2009-11-23 00:43:58", "elite": "", "average_stars": 3.8, "fans": 1}}
{"review_id": "5Mott8WzMNjYdklHpy28fw", "user_id": "rUQRgLS4hhLuqaOBd0IYXQ", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 3.0, "useful": 2, "funny": 0, "cool": 1, "text": "This place is pretty decent. The decorations inside are cute and Middle Eastern themed. Manakeesh (what they are named after) is basically a flatbread pizza-type of dish, and they have a ton of options of what to put on it. The service was OK, and they didn't seem to be enforcing social distancing in the tables where people were seated inside the restaurant. The manakeesh I ordered was SUPER oily - it dripped oil when I picked it up, and it wasn't great. I'd come back and give it another try because I've heard great things, but it wasn't my favorite.", "date": "2021-03-19 15:55:44", "user": {"name": "Ameena", "review_count": 147, "yelping_since": "2009-09-30 22:18:02", "elite": "2019,20,20,2021", "average_stars": 3.91, "fans": 6}}
{"review_id": "5eEod_vhuX4mkIfk8mGZHA", "user_id": "7M3VYaN-bH9FiJjZKOTv1Q", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Stopped by real quick for some baklava! Perfect texture and they had a ton of different flavors. I think my favorite was the pistachio. Service was a little whatever. Their card reader was down and so they were only taking cash which caused me to be frazzled. Definitely check it out if you're in the area!", "date": "2021-03-16 00:05:16", "user": {"name": "Meagan", "review_count": 317, "yelping_since": "2018-05-04 01:22:12", "elite": "2019,20,20,2021", "average_stars": 3.69, "fans": 16}}
{"review_id": "C51zOap-m0T8S-bXTMhsDw", "user_id": "HWPIHEXmQitel9xXxq38pw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Poor service, two shawarma platters took 30+ minutes. One paying customer walked out of the restaurant without food because they said \"nothing was ready right now.\" Overpriced food with fees hidden in the menu. $34 for two shawarma because rice and hummus were $4 add ons. Don't waste your time or money here, much better restaurants in West Philly.", "date": "2021-03-13 21:14:42", "user": {"name": "A", "review_count": 1, "yelping_since": "2014-12-27 20:01:41", "elite": "", "average_stars": 3.29, "fans": 2}}
{"review_id": "jIG96tYZZJpitUUW96Mjyw", "user_id": "zAQ9hl0DBBJvGQUf8CBZYA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "delicious coffee and smoothies. underwhelmed by their style of falafel, i prefer the way Halal trucks or Golden Crust makes them but that's just my taste. They have a lot of ingredients like raw honey in comb, pickles, etc. And it always smells delicious from outside. everyone who was working was also very kind.", "date": "2021-02-24 16:02:14", "user": {"name": "Reilly", "review_count": 12, "yelping_since": "2018-01-18 20:09:01", "elite": "", "average_stars": 4.0, "fans": 2}}
{"review_id": "fGLMvVFHLDa_X440pEL7ng", "user_id": "NI6FnDXuyczblDHE1d62Mg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Really solid spot with a very diverse menu! The pita, rice, kebabs, hummus, and baba ghanoush never disappoint. What's more it's well-priced and you get a good amount of food for what you pay. Only reason it a 4/5 is because it's not out of this world or special, but it's reliable, comforting Middle Eastern food.", "date": "2021-02-21 04:57:41", "user": {"name": "Rhea", "review_count": 13, "yelping_since": "2017-06-20 03:38:54", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "J8vmv6EMcuKjxb1ENq-AGA", "user_id": "WtnerGVQjEgJHNM2rnJDEg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "For some reason Yelp isn't allowing me to post an addendum to my review that I wrote seven years ago (!). Seven years ago I wrote Manakeesh had the most authentic Lebanese food in Philly. This a complaint review, ironically I think manakeesh might still have the best Lebanese food in Philly! BUT my order was one hour late (not \"took one hour\") AND their phone didn't operate so I couldn't get an update and didn't know if i would receive my dinner. Of course, I had company.\n\nSo the food is still the best but clearly they have business issues.", "date": "2021-02-15 14:00:08", "user": {"name": "David", "review_count": 98, "yelping_since": "2009-03-15 21:00:53", "elite": "", "average_stars": 3.53, "fans": 0}}
{"review_id": "2R3rkRArYs294MECmc7Vow", "user_id": "K2LGIUNxsv_m_G-tJbRxTA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Phenomenal manakeesh! One of the primary reasons we actually were excited about our Philly trip. It's a nice middle eastern cafe. They had some really cool lattes. Will be back to explore the rest of the items!\nGood job following covid guidelines too. Everyone was wearing masks appropriately and they had nice markings on the floor to drive SD.", "date": "2021-02-13 12:59:20", "user": {"name": "Hussam", "review_count": 257, "yelping_since": "2015-04-15 01:17:56", "elite": "2019,20,20,2021", "average_stars": 3.87, "fans": 8}}
{"review_id": "CsXb56voWOC17sy_pBEWEg", "user_id": "1_ie3zV2FuEAADSoydnjug", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Just the best. Everything I've had is delicious. Their desserts are also out of this world. I always buy a big thing of assorted baklava-- it's some of the best I've ever had.", "date": "2021-01-30 20:42:18", "user": {"name": "Liz", "review_count": 7, "yelping_since": "2021-01-30 20:24:01", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "K_VrC2jiMCC4QaIyyqkhuw", "user_id": "LF-K_ErXvM2V6Lyy2kaE4Q", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Seating and space is a plus. Service is also decent. With tons of food items, their manakeesh dishes are always a good default if you can't decide. Their shawarma is lacking but everything else is bomb. Also their tea and coffee (and bakery items) are spot on.", "date": "2021-01-26 23:18:19", "user": {"name": "A", "review_count": 19, "yelping_since": "2012-11-19 18:57:55", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "jKWW1jMel6unFY-xxjWC6Q", "user_id": "qSMWiyKMR9HhmImSYFErkw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went there based on the reviews, and I was deeply disappointed. First, the meat wasn't fresh or something about it not taste good. I order chicken and kofta. Second, the way they give us the food, you can feel it with no care. Nothing like the pictures I saw in the reviews. I do not mean the fancy presentation; I mean the food itself with sides, only fries and meat with some pickles!!! No bread, which is mandatory on any kebab for a middle-eastern restaurant. The desert too old, not fresh, which is not eatable. In summary, I'm comparing the restaurant with other Middle Eastern ones in New York and New Jersey, maybe that's why I get disappointed.\n\nIt seems there quality is going down when I looked to the new reviews vs. the old reviews.", "date": "2021-01-19 05:47:14", "user": {"name": "Abdul", "review_count": 4, "yelping_since": "2018-07-15 03:07:56", "elite": "", "average_stars": 1.25, "fans": 0}}
{"review_id": "9SroN6ZTwzjwpo3L1RGqig", "user_id": "2qqUJSBq8TSMPgSIBOt1FA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "Ordered kanafa, basboosa and several of the different types of baklava (pistachio, walnut and almond). \n\nThe baklava's were pretty good, I would recommend pairing it with coffee or tea. The basboosa was not bad but not that fresh either but the kanafa was really bad. It seemed old, stretchy with 0 taste.", "date": "2020-12-27 20:34:42", "user": {"name": "Daanyaal", "review_count": 785, "yelping_since": "2011-12-26 18:06:20", "elite": "2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.14, "fans": 76}}
{"review_id": "VBznAIHCeZsK3OAaksgDLw", "user_id": "O_UyIVjEvet73aFc_WyXsA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "I've been here twice. The spinach and cheese manakish and zaatar manakish are both delicious, withh the right amount of spices and toppings. The baklava is truly excellent - different types as seen in the picture, not overly sweet with a creamy flavor, it can function as a main meal in and of itself. Sometimes when picking up you have to get their attention or else they'll have conversations with each other in front of you, but the food is excellent.", "date": "2020-12-09 17:14:10", "user": {"name": "Kayeff", "review_count": 15, "yelping_since": "2016-02-17 01:57:05", "elite": "", "average_stars": 3.6, "fans": 1}}
{"review_id": "RLTTcLj9z15YnpQuI_fL7Q", "user_id": "-hamNUJcfmeYObvM5Wlgyw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "You go here for the experience and healthy tasty Mediterranean food. It is a cute place in west philly for a nice intimate date. They have some social distance separations between tables. The food is generous servings but can be kinda pricey if you order many sides with your kebab plate. The chicken kebab was grilled at perfection and it is not overwhelmed with white sauce as a halal food truck might have it.", "date": "2020-11-16 17:48:26", "user": {"name": "Kimberly", "review_count": 158, "yelping_since": "2013-03-25 02:15:16", "elite": "2021", "average_stars": 4.25, "fans": 4}}
{"review_id": "33tFlWTVtHUcy_8-vsvtLA", "user_id": "693jtVYzvhwbATcoGxTgaw", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Ordered delivery because Manakeesh is one of the ONLY places in Philly that does shish tawook and my partner was craving it! He was NOT disappointed - both his chicken shish tawook (kind of like a chicken kebab, but heavy on the paprika?) and my chicken shawarma were excellent. Sides were also good - we got the labneh, the muhummarah, and the tabbouleh (which was my favorite!). Prices were great, too! Definitely will revisit soon.", "date": "2020-11-10 13:07:15", "user": {"name": "Cat", "review_count": 208, "yelping_since": "2010-11-04 01:28:08", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 3.95, "fans": 14}}
{"review_id": "DSnvb_hh_hYdBjygI5fVWA", "user_id": "x1NswtSImNRYvXY1nfDL9g", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "3rd time here for takeout! I have gotta say definitely is an amazing place, it's like transporting to another country. It's beautiful decor inside and layout would probably be amazing pre-covid days but due to situational hazards, we live in new times, so just gotta go with the flow. I love the brick oven roaring in the back, and fresh dough being made with the open grill firing up some proteins adjacent to the oven. And even farther left is a separate but entirely one entity which is the bakery with AMAZING pastries. \nAesthetics: beautiful and lovely decor, sad that it's not up and running for dine in business yet. \nService: takes a while for the food to be made, bcuz everything is so fresh! But atleast they keep to the time slot as they state. \nFood: only reason I keep coming back, very generous and even more delicious, I am slowly attempting to try everything on the menu but I can not stop ordering their beef shawarma wrap. It's sooo goood! And chasing it down with some amazing baklava, I may not be well experienced in middle eastern cuisine but from what I have tried, I've gottta say the food here is def authentic and delicious as anything I've ever tried before. \nI will def be back and back and back again.", "date": "2020-11-09 21:10:20", "user": {"name": "Jon", "review_count": 65, "yelping_since": "2011-10-31 00:48:57", "elite": "2019,20,20,2021", "average_stars": 4.57, "fans": 7}}
{"review_id": "zbGge2O6CLid9Ab3ffa3Ug", "user_id": "DrvmH6hJifrAyqQR0Sliww", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Their freshly baked peta bread & flatbread pizza are really good!! Already tried several times and were always good :)", "date": "2020-10-28 19:36:14", "user": {"name": "Hana", "review_count": 60, "yelping_since": "2014-10-04 20:07:25", "elite": "2021", "average_stars": 4.24, "fans": 0}}
{"review_id": "iix9Iiv-ykkVzTqljyPpDQ", "user_id": "oBQZfFdCLFWLW4m2iRr6Kg", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Stop in after a very nice date, as she wanted me to taste Turkish coffee.   Being Italian,  I just never have.  The space is warm and inviting, the workers are very friendly, they have some excellent coffees and options.   The coffee tasted really good.  I'm going to add strong too.  And the pastries were amazing, so full of flavor.   I would come back if I was in the area again.", "date": "2020-10-26 16:46:06", "user": {"name": "Luke", "review_count": 121, "yelping_since": "2015-10-22 23:55:48", "elite": "20,20,2021", "average_stars": 4.4, "fans": 5}}
{"review_id": "5OxvOWnnL0SIUjj2Z4g6Rw", "user_id": "EALlxgEoNryRq6oAKX462g", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "The grilled meats as well as the manakeesh ( small meals on a single fresh baked pita) are quite tasty. \n\nBe patient when ordering and picking up food. There is a lot going on in this place. It is certainly a place where learning and cultural exchange can happen. \n\nThe decor is pleasant with a soaring veiling and lots of windows as is the middle eastern music.  \n\nFirst and only place I have ever eaten mamorah. (Sp?)\n\nThis place is worth checking out. I also enjoy the fattoush salad, the grilled beef and the fool bean dish are tasty ask for a side of pickles and olives. Crepe, coffee, baklava and smoothies also great treats.", "date": "2020-10-14 18:17:04", "user": {"name": "Chris", "review_count": 56, "yelping_since": "2017-07-01 05:14:35", "elite": "", "average_stars": 4.11, "fans": 1}}
{"review_id": "YFxqZS2yx3Gqjsg4A4sjUw", "user_id": "xM1vIIx903HtRXWOsU-QSA", "business_id": "irXywqvfXj9maLLOBQMYvg", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "So, I literally just walked into this place- I have never eaten here before and was super excited! My husband and I walked up to the register and the employee behind the register motioned to help us- My husband noticed one of the cooks baking something behind her and asked \"oohh what is that?\"  (and okay it was a little loud because of the heavy cooking going on) BUT- there was a microphone in her face and she said something and we couldn't hear her- so she said once more- and lastly again but she screamed at us \"BACON STEAK\"- LOL i felt like she was going to beat us up- I thought this place was halal? also okay well shove your bacon steak up your you know what... Saad's is where it's at!", "date": "2020-10-10 00:46:31", "user": {"name": "E", "review_count": 19, "yelping_since": "2017-11-06 19:08:14", "elite": "", "average_stars": 4.47, "fans": 0}}
