{"business_id": "SUpQ7uFtXvdzgVubewMV8g", "name": "Good Karma Cafe", "address": "331 S 22nd St", "city": "Philadelphia", "state": "PA", "postal_code": "19103", "latitude": 39.9473679, "longitude": -75.1780146, "stars": 4.0, "review_count": 217, "is_open": 1, "attributes": {"OutdoorSeating": "True", "BikeParking": "True", "BusinessAcceptsCreditCards": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "WiFi": "'free'", "RestaurantsPriceRange2": "1", "RestaurantsTakeOut": "True", "DogsAllowed": "True", "Caters": "False", "RestaurantsDelivery": "None"}, "categories": "Coffee & Tea, Food", "hours": {"Monday": "7:0-17:0", "Tuesday": "7:0-17:0", "Wednesday": "7:0-17:0", "Thursday": "7:0-17:0", "Friday": "7:0-17:0", "Saturday": "7:0-17:0", "Sunday": "7:0-17:0"}, "category_list": ["Coffee & Tea", "Food"], "stratification_tag": "Coffee & Tea"}
{"review_id": "QJNhN-fL8ol7oOXFsnOuUA", "user_id": "uHK-gxXor5794OdW41RSdg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best coffee shop I've found since moving to Grad Hospital. Their coffee/banana/peanut butter smoothie is unbelievable and in addition to great coffee, their variety of iced teas are amazing. Can be a little slow, especially in the morning, so I would recommend ordering ahead!", "date": "2021-09-29 21:54:19", "user": {"name": "Emily", "review_count": 32, "yelping_since": "2020-07-07 20:47:24", "elite": "", "average_stars": 4.45, "fans": 0}}
{"review_id": "5q7siOJxQ-imU9SjhZcTKQ", "user_id": "9cl9ANLjzpGnmJ3rF8uK6w", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "I love Good Karma. The thing with all their shops in Philly; they are consistently great! The staff is always over and beyond amazing! The coconut iced coffees or lavenders coffees are my go to's. \n\nThe cool as a cucumber starts my weekends right. Their seasonal drinks are great! When it is pumpkin season, you gotta get their pumpkin chai (iced). You'll thank me later.\n\nGo give them a visit at any of their locations, you will enjoy it!", "date": "2021-08-21 20:07:14", "user": {"name": "John Michael", "review_count": 32, "yelping_since": "2021-01-13 16:10:05", "elite": "2021", "average_stars": 3.91, "fans": 2}}
{"review_id": "vfl22Baoot0J5DWlqOTQnw", "user_id": "gWZETLPu_ihAtLOYtrm0mw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 4, "funny": 4, "cool": 4, "text": "I stopped by Good Karma this morning for coffee and a small breakfast bite. The location is very easy to find from their signage and a large mural to the right of the storefront. They have a few seats outside and even some available inside (YAY!). \n\nThere is a large menu above the counter with an assortment of coffees, teas, espresso drinks, and food items. I opted to try the Lavender Latte because I overheard someone in front of me order it and it sounded great. I am a huge fan of Oat Milk so I was excited to learn that they had that on the menu too! To eat, I tried the Power Bowl which consisted of scrambled eggs, turkey sausage & bacon, spinach, cheddar cheese, and everything seasoning. I ordered it to go and by the time I got home the cheese was melty and delicious. The portion was on the smaller size, but it was exactly what I was looking for this morning!\n\nThe staff was very friendly, the space was very clean, and I loved to see that it is pet friendly inside! Knowing that I could come by with one of my pups and spend a few hours working is very enticing.", "date": "2021-07-13 21:03:29", "user": {"name": "Gabriella", "review_count": 231, "yelping_since": "2016-01-26 23:54:38", "elite": "20,20,2021", "average_stars": 4.33, "fans": 167}}
{"review_id": "PDt33nA0WGHSIHUgYZcCBA", "user_id": "aBA76hKuLWuNVTS-is7fGw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 5, "funny": 1, "cool": 5, "text": "Due to COVID my normal coffe shop work flow as been interrupted. Then the other day my wife visited GK and was on cloud 9 about this location. So we de Decided to pack our bags and take a bike ride and work from the shop. Everything she had to say lived up to the hype!\n\nthey had outdoor seating in the front but the real magic happened when they directed me to outdoor seating in the back. A cozy spot with an amazing environment. Pair that with great coffee and Chai tea, it was a great spot to get some stuff done on a nice day. \n\nDefinitely Gonna keep coming back to support this place during these tough times.", "date": "2020-12-01 03:11:18", "user": {"name": "William", "review_count": 179, "yelping_since": "2011-12-02 21:46:35", "elite": "2018,2019,20,20,2021", "average_stars": 4.17, "fans": 26}}
{"review_id": "dbda6461nkSAmqhmi2VATg", "user_id": "aNu11OSW0g_hVHrcLiJwmA", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We came here on a rainy Saturday to get some hot drink and a bite to eat. They have roadside seating and backyard seating. We ordered the hot chocolate and Buddha bagel. Their bagels are really nice. Hot chocolate actually came out warm so that was disappointing. Lemon poppy seed muffins were amazing. \n\nThey also keep treats for your furry friends to chew on while you're enjoying your coffee. Good service!", "date": "2020-08-30 23:55:57", "user": {"name": "Komal", "review_count": 203, "yelping_since": "2014-11-04 09:16:28", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.99, "fans": 9}}
{"review_id": "YUcaqOshhuD3hudtWNCGsA", "user_id": "0kPfZz9R1_0f7vYSXglF8Q", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good cute cafe. Had Dominican mocha hot chocolate and Happy Buddha bagel with lemon popy muffin. Hot chocolate was not hot and a bit disappointing. I expected a bit more from it.  Buddha was OK. We had it with wheat bagel,  I think they recommend sesame bagel with it but were out of stock. But, honestly bagel was not bad it just missed the wow factor.. i think changing the bagel would do it. Muffin was delicious.  Saved the day. It was perfectly soft and moist. Highly recommend it.\nStaff is polite and courteous. They all had masks on. Offered free dog treats for our pup. Restrooms were clean and available for customer use. They had hand sanitizers available for use.", "date": "2020-08-29 20:10:01", "user": {"name": "Hitesh", "review_count": 206, "yelping_since": "2014-11-28 19:49:14", "elite": "2017,2018,2019,20,20,2021", "average_stars": 3.86, "fans": 14}}
{"review_id": "h1udgYHq18Ei8RFk37W37A", "user_id": "AkQdmN68QQgluA1wAY5E3w", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Such a nice little place! We were looking for somewhere in the city that had a peaceful outdoor area. This one has a wonderful back area with about four tables and places to plug in electronics. We love the coffee as well! I'm a matcha fan, and I would recommend the Wildflower drink.", "date": "2020-08-23 20:36:12", "user": {"name": "Bradi", "review_count": 9, "yelping_since": "2019-05-27 05:06:49", "elite": "", "average_stars": 4.11, "fans": 0}}
{"review_id": "kDqUbX3xYplgEaR17yg6qA", "user_id": "i-julkGFyXxnNc6vNzbMQg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this neighborhood cafe for pastries, specialty brewed coffee or tea drinks, and bagel sandwiches. If you have time to truly savor the space check out their outdoor green oasis patio with tables/chairs. Great vibe, friendly service!", "date": "2020-07-18 13:43:00", "user": {"name": "Karlyn", "review_count": 294, "yelping_since": "2018-04-28 06:05:35", "elite": "", "average_stars": 3.78, "fans": 2}}
{"review_id": "UZVci2Tabd0Rvyu73g7s0A", "user_id": "2LYgzHuDf_J-bZRgFmWfNw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "My local cafe features fair trade coffee , quick tasty bites including sandwiches & homemade soup , and outdoor seating in a private back area and a few streetside tables , good for dog lovers like myself.  A good place to meet friends or work remotely, with their free coffee refills.  Good Karma is lovely.", "date": "2020-03-07 21:47:30", "user": {"name": "Helen", "review_count": 3, "yelping_since": "2020-03-07 21:32:26", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "45HyudE4W1k1gThRump28Q", "user_id": "EYCHp_Qzo4bvlwpXW2Ig1Q", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've never had a bad cup of coffee or latte here! The staff is always pleasant, even at 6 AM, and the fact that they're dog-friendly makes it even better!", "date": "2020-02-17 17:59:24", "user": {"name": "Taylor", "review_count": 5, "yelping_since": "2017-02-15 03:41:11", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "mb-Jl1NRxSv8YJaV10n-Lg", "user_id": "bJgfxs6_h5Tcp5anvdTtYQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "I started drinking coffee at the age of five. Had my first cappuccino by the age of eight. Ordered my first cappuccino at Good Karma Cafe yesterday and it was most delish. Above the mark scores in flavor, a bit too much froth and this may have been the cause of the temperature of the cappuncino not meeting my standards. That being said as far as cappacino's go I would fully recommend coming here for the cappuccino when your in the mood and have $5 you don't mind spending for a medium brew.\n\nThe Barista was also very helpful when I was inquiring about there seasonal drink the salted caramal mocha and she said if you don't love sugary drinks I would pass. Thank you for that as the days of having sixty plus carbs in a drink any nutrionist would slap you sideways if they heard you engaging in such behavior.\n\nI will come back here for sure to try there food and will update review. \n\nThank you Good Karma Cafe the experience I had here was well...quite Good.", "date": "2020-01-07 13:34:47", "user": {"name": "Mike", "review_count": 284, "yelping_since": "2014-02-25 19:18:40", "elite": "2018,2019,20,20,2021", "average_stars": 3.43, "fans": 21}}
{"review_id": "AlZes1bxhZSqjquHN13BhQ", "user_id": "1npXvOyQnu1ddmWiXONStQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Love this coffee shop- such a friendly and welcoming environment. I went for an iced latte on a Sunday morning with a friend. The coffee shop was a great place to chat and catch up. If you go, you are sure to have delicious coffee and 'good Karma'.", "date": "2019-09-08 17:05:17", "user": {"name": "Hannah", "review_count": 128, "yelping_since": "2019-08-06 22:12:46", "elite": "2019,20,20,2021", "average_stars": 4.27, "fans": 4}}
{"review_id": "ADiXonRiq8X0HVLWbGd9iw", "user_id": "GKZugdq8QSnqtSMzfQuIlQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered an iced coffee and asked for minimal ice. Received one that was full of ice. When I asked the associate (Cita, she also made the beverage) If I could have ice removed she gave her coworkers annoyed glances and rolled her eyes. It was unnecessary and off putting as she was the one who got the order wrong yet treated me terribly for speaking up in a polite way about it. Disappointing and telling of their customer service culture.", "date": "2019-07-11 12:13:13", "user": {"name": "Jo", "review_count": 11, "yelping_since": "2018-02-22 23:30:02", "elite": "", "average_stars": 2.72, "fans": 0}}
{"review_id": "YJsFH8zfKi35uUybdKrV4A", "user_id": "IfLTOQ2Bb3xAsW9nxaZvIw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "Love this coffee shop! It has such a warm and friendly atmosphere with great food and coffee. They have your typical coffee options (drip, espresso, lattes, etc) but also have fun, more unique drinks such a Lassi which is a latte with rose, vanilla, and cinnamon and I love it. Today I got the iced Espresso Shaker with oat milk and it was prefect for a hot summer day! \n\nThey also have great food options, such as bagels, sandwiches, soups, salads, vegan cookies, and your standard selection of pastries. I got the \"cool as a cucumber\" bagel on an everything bagel and it was definitely very cool as a cucumber. Highly recommend. \n\nWiFi available. Dogs welcomed. Milk alternatives available. Outside seating in back and front. Free water with lemon.", "date": "2019-07-04 18:46:16", "user": {"name": "Nikki", "review_count": 53, "yelping_since": "2014-09-06 18:50:51", "elite": "2019,20,20", "average_stars": 4.65, "fans": 4}}
{"review_id": "BJirG_G-8sKKVBsBLLfkjg", "user_id": "MZjjKyCs-XKpiIPhj74LgQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "My 3 stars are not at all given out of spite. I just feel that this is an average-level coffee shop in the Philly area. I've been here a few times and have never been blown away. Their coffee and drinks are good, but nothing remarkable. Their food and pastries are rather forgettable. \nI will absolutely continue to visit Good Karma when I'm walking by, and I will especially return to enjoy their truly delightful outdoor patio!\nDon't write them off, but know that if you're in the hunt for stand-out coffee, Philly has more to offer.", "date": "2019-06-11 18:02:03", "user": {"name": "Laura", "review_count": 16, "yelping_since": "2011-09-10 00:08:05", "elite": "", "average_stars": 4.31, "fans": 0}}
{"review_id": "4IStJN7EC6bpMdu4k5uATA", "user_id": "dJtDjKsbs5B04Hm1JaKg6Q", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing hospitality today. Very welcoming and low key vibe. I love coffee with a smile and a convo. Keep that shit up folks.", "date": "2019-06-08 16:57:00", "user": {"name": "Paige", "review_count": 10, "yelping_since": "2018-07-13 19:12:04", "elite": "", "average_stars": 3.1, "fans": 0}}
{"review_id": "MQ2uCVxOdNeAWaTMuJaz7A", "user_id": "TJ8Hawan8jDIZHS7AAZJwg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I came here for cold brew but they only had a very strong ice coffee. I was surprised by the quality and the fact they had oat milk and compostable containers. The only downside is that they recommended Starbucks specials even though they worked at an independent lovely karma filled atmosphere!", "date": "2019-05-09 14:17:06", "user": {"name": "Max", "review_count": 173, "yelping_since": "2013-09-04 03:04:17", "elite": "20,20,2021", "average_stars": 4.44, "fans": 7}}
{"review_id": "8V15lzsCgIChS_KCUSBbdw", "user_id": "zXB3DV09Md_IeivtrCLq7A", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place!! The service to the food and many more fabulous things this team brings to the table. Thanks Good Karma for all you do!!!", "date": "2019-05-08 20:03:00", "user": {"name": "Shane", "review_count": 6, "yelping_since": "2016-09-19 03:35:54", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "qIt5CRLJVOnizFxwnVcHUA", "user_id": "2Eb8aKOZROAPkWxsBXf_qQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice local coffee and breakfast cafe\nGood coffee! Egg and Bagels sandwiches were very tasty! We will be back!", "date": "2019-04-28 21:10:41", "user": {"name": "Linda", "review_count": 2, "yelping_since": "2016-10-08 00:35:25", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "r8F066IdWRdNwuHoVJqGDQ", "user_id": "Ib3uXHSWeBed2kK-BKLGSw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Excellent drinks!\n\nThis place has awesome seasonal drinks! My brother specifically came here to try out their springtime drinks. We both enjoyed their Masala Rose Chai with oat milk. The drink was super flavorful and rich. I will say they were a little expensive at almost $6 a drink but definitely worth it every once in a while. \n\nI'll definitely be back in the summertime!", "date": "2019-04-02 06:37:51", "user": {"name": "Bridget", "review_count": 442, "yelping_since": "2011-04-19 03:19:31", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.43, "fans": 55}}
{"review_id": "3j75JDmxTxU926U-_bG6Hg", "user_id": "RX5us566crL_iZDFiYd8wg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good coffee but the interior isn't that cozy, it's more just people at their laptops working.", "date": "2019-03-30 19:53:07", "user": {"name": "Celine", "review_count": 5, "yelping_since": "2015-08-03 01:05:50", "elite": "", "average_stars": 4.2, "fans": 0}}
{"review_id": "rcfl4aDLvLXFqOQjD3tGSg", "user_id": "7T2RdXwhcNRUhkfNd3_b7w", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great find with delicious egg sandwiches (vegan options/gluten free options) that has fair trade coffee and is doggo friendly.", "date": "2019-03-25 20:15:37", "user": {"name": "Laura", "review_count": 63, "yelping_since": "2012-04-28 05:14:09", "elite": "2019,20,20,2021", "average_stars": 4.74, "fans": 1}}
{"review_id": "Ftkiw-67ho8ALgEN5SyJMA", "user_id": "oJp7znV0fSp0kMMaOuYpsg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 3, "funny": 0, "cool": 1, "text": "Go-to cafe for delicious soups and amazing service! Every interaction I've had has been positive so far at this cafe! \n\nAtmosphere: A few tables scattered around, probably can seat 15-20. Cozy and cute environment. I've seen days where people will simply come to work, other days where it's bubbling with conversation, other days a mix. Great for catching up with friends, dates, or just getting some work done on your own (with their free wifi)! \n\nService: Highlight of coming to this cafe - the employees are very kind and friendly! I was super indecisive between soups, and was offered a free sample of one.\n \nFood: Their soups will change, but I love their chicken + peanut soup. It was a bit on the oily side, but carried a lot of flavor. When I had a head cold, this really hit the spot! Coffee - they offer almond and soy milk at no additional cost (very rare for a coffee shop), and their special drinks are delicious! The latte I had was a bit diluted though, so I'll stick with their seasonal drinks in the future.\n\nRecommended Must-Try: Sugar plum drink - not too sweet, but delicious blend of vanilla into your coffee! I also have yet to get a soup I haven't liked - quite affordable ($6.50 for 16oz) and flavorful. A tad on the oily side sometimes, but I'm still obsessed. \n \nOverall: 4.5/5 - I love coming to this cafe. It's so versatile and offers a wide range of delicious soups, salads, bagels, coffee, and pastry options. And very affordable! Overall, love the warm experience here (from the food and the service)!", "date": "2019-02-18 02:55:00", "user": {"name": "Annie", "review_count": 138, "yelping_since": "2019-01-30 15:53:24", "elite": "2019,20,20,2021", "average_stars": 4.08, "fans": 10}}
{"review_id": "X0X1YSsiUmlwPeDPviQbxg", "user_id": "rE7PAlJNMAwWhtewrdRP-w", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "Cozy place, great sandwich and salad combo which is similar to Panera Beard's but you actually walk away with an adequate amount of food instead of just being hungry and angry as is the case with Panera Beard's sandwich and salad \"deal\" lol. Nice place to open the laptop and get some stuff done!", "date": "2018-11-21 00:45:09", "user": {"name": "Russell", "review_count": 11, "yelping_since": "2014-06-29 05:01:34", "elite": "", "average_stars": 4.64, "fans": 0}}
{"review_id": "nf1Ut0pt_fUq7_8Kr1SFXQ", "user_id": "C8YOser4MCSfRREiCMviWw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Came here for a latte one afternoon. It was rainy out and the coffee warmed me right up! My girlfriend and I sat here talking, drinking, and watching the weather. Couldn't ask for a more perfect place. \nThere were plenty of people working on laptops but we managed to find a spot. The employees were Courteous, the prices average, WiFi of course, good music and it was clean!", "date": "2018-11-17 00:18:50", "user": {"name": "Er3yn", "review_count": 406, "yelping_since": "2018-01-12 18:54:05", "elite": "2018,2019,20,20,2021", "average_stars": 3.75, "fans": 27}}
{"review_id": "HpI1b86_vEsdSP8uYpZY4g", "user_id": "5H3XXON395DO7Bb7VFYMug", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 2.0, "useful": 1, "funny": 2, "cool": 0, "text": "Two male baristas openly mocked my girlfriend for ordering a Pumpkin Spiced Latte, a seasonal drink that is on their menu. This sort of audacious patronizing is unacceptable and fosters a culture of know-it-all exclusivity. It has tainted my view of an otherwise nice cafe.", "date": "2018-11-07 15:16:43", "user": {"name": "Nicholas", "review_count": 2, "yelping_since": "2017-01-17 20:37:52", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "uUNCgSWbyLP5TlDYpYhq2g", "user_id": "Vl_DijFhgI7LxvJwN_aysA", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "A really cute and homey cafe, with truly unique drink options! Only complaint is that you are paying Starbucks prices for local brews-- I wish it were just a little bit of a better bang for your buck. I will still come again, but definitely stick to the simpler options rather than the specialty concoctions. \n\nAlso, free WiFi and plenty of outlets! Great for students and studying", "date": "2018-10-02 01:51:54", "user": {"name": "Danielle", "review_count": 98, "yelping_since": "2016-05-22 17:36:59", "elite": "2018,2019,20,20,2021", "average_stars": 3.77, "fans": 5}}
{"review_id": "fPLl9PNQZR-aip-RFt6qIA", "user_id": "u3qALOPD7qsMsUXzCBltgg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "This is my locale coffee shop of choice. Starbucks is nothing special, the staff at Rival Brothers is always so snotty. I like La Va but Good Karma has consistently had a chiller vibe. \n\nNo extra charge for soy or almond milk. Small upcharge of fifty cents for oat milk. My go to for lattes when I want to splurge. \n\nLove their bagel sandwiches. Very affordable and filling!\n\nDog friendly (can bring dogs in while you order). They have treats for pooches as well. \n\nSmall backyard area with lots of seating. Dogs allowed back there.", "date": "2018-09-08 01:07:51", "user": {"name": "Kathy", "review_count": 103, "yelping_since": "2007-02-05 22:47:33", "elite": "2018,2019", "average_stars": 4.08, "fans": 5}}
{"review_id": "rgl0cx7P2eUJTEFIS09-BQ", "user_id": "3vhgB61xMkj5TzBvwzPTMw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Coffee shop with outstanding cafe food consistent across its three locations. Great for a quick bite/caffeine buzz/study spot if you don't mind some louder music in the background. They have an eco-friendly, farm-to-store, sustainable focus and a warm community feel. I got the happy buddha bagel and loved it!", "date": "2018-08-11 18:51:27", "user": {"name": "Nicole", "review_count": 75, "yelping_since": "2017-02-19 18:00:40", "elite": "2018,2019,20,20", "average_stars": 4.64, "fans": 9}}
{"review_id": "ulSq6AzzUkCS00lSfxsXRw", "user_id": "i6xwZiqFCejYVuXLZ9356Q", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Needed a place to check email. Good coffee. Equal Exchange fair trade coffee.Friendly staff. Nice place to sit inside & outside. Will be back", "date": "2018-08-06 14:30:53", "user": {"name": "Camping", "review_count": 22, "yelping_since": "2010-08-08 02:56:58", "elite": "", "average_stars": 4.48, "fans": 0}}
{"review_id": "-hGovFi07sRRtMNf5bFRzQ", "user_id": "Yiycqy4gbIMfU9N9l_xtqw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great coffee, welcoming atmosphere, great place to get work done. The place is bright and cheery and had a great neighborhood feel. The hidden back deck is a big bonus. Iced americano was delicious as well as the Buddha Bagel (hummus + veggies). Very well priced! Less than $3 for the americano and the less than $5 for the bagel. Internet is fast and consistent. Plenty of places to plug-in and power strips made available. Bring your reusable cup because they do serve in plastic/paper.", "date": "2018-07-18 22:19:59", "user": {"name": "Mirelle", "review_count": 15, "yelping_since": "2015-10-18 16:29:40", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "fOL9VJaumWUjPntB4kfQvw", "user_id": "hx-5Sh-99DfHsN9c87EDjw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice comfortable environment. Good hours, open till 9 pm.  The Brass Monkey cold drink was really good.", "date": "2018-07-03 00:11:42", "user": {"name": "Leon", "review_count": 2, "yelping_since": "2012-11-22 04:58:08", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "izsNfDAD609X4viASyTn1Q", "user_id": "Ttn1RtATzZBtWsx6MoPGqQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Great coffee and pastry/cookie selection. Outdoor seating is best in the AM before the sun is in the west. Staff is very friendly. I particularly like it that in the past they've been a host site for the Bicycle Coalition's bike-to-work event.", "date": "2018-06-30 18:50:16", "user": {"name": "David", "review_count": 359, "yelping_since": "2011-11-11 00:16:00", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.49, "fans": 20}}
{"review_id": "IrnCb1CqQK0WbUSaKjWehQ", "user_id": "gpo7nsqFxWkrQ4EFXny26Q", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Got the spicy ginger chai w/ almond milk (hot) & garden bagel. Almond and soy milk substitutes are free!! Major pro. \n\nGinger chai is great. The ginger is subtle enough for it still be enjoyable for those who don't love ginger, yet still noticeable enough for those who do (me). \n\nGarden bagel tastes super clean. Could use more flavor (it's just eggs and veggies) but that's part of what it is. Would recommend for a pretty healthy, hearty breakfast! \n\nNice low-key environment with a pretty generous amount of seating. Looks great for studying. \n\nI'll be back!", "date": "2018-06-29 12:43:34", "user": {"name": "Shannon", "review_count": 16, "yelping_since": "2014-05-02 23:54:38", "elite": "", "average_stars": 4.06, "fans": 0}}
{"review_id": "Bvj_EXcvZgASC8DLYP7rOw", "user_id": "kPmJH3zV6o_-SkQO23gljg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Uh... wow. Awesome latte. Amazing bagel with lox. Cool space. Makes me wish I lived or worked nearby.", "date": "2018-06-11 12:31:18", "user": {"name": "Sam", "review_count": 41, "yelping_since": "2008-07-26 17:43:26", "elite": "", "average_stars": 3.77, "fans": 1}}
{"review_id": "ZOjDDG2qPOT7VSP2H9VNzQ", "user_id": "CiRdEzf_IfIOBx_sbdnuHw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing local place, lot of vegetarian options and very friendly staff. The backyard seating is very calm and relaxing.also it's a very short walk from schulkill trail so you can grab your coffee and breakfast after the run!! Will definitely come back here again.", "date": "2018-05-28 19:45:35", "user": {"name": "Ruchita", "review_count": 6, "yelping_since": "2014-11-28 21:46:29", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "zaSja6MrqdWK0o7HxJS59Q", "user_id": "KTxe33TKY86VJRm41iBm1A", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is my go to for a quick bite or coffee when I'm on the run. I usually pop over with my thermos and have them put my drink in that so I can bike to work! Their cold brew is my favorite. It is STRONG and so so good. Beware if you're looking for a place to set up camp and work, this place is relatively small and gets full easily. \n\nThey offer breakfast bagels and pastries if you're looking for something more substantial to eat. I think the classic breakfast bagel is pretty filling and reasonably priced (comes with egg/bacon/cheese). It's also great that they have smaller treats like bananas, yogurt, and snack bars if you just need something to tide you over while working. Overall, I keep coming back for the convenience and that delicious cold brew.", "date": "2018-05-15 14:25:01", "user": {"name": "Emma", "review_count": 64, "yelping_since": "2015-07-10 19:00:47", "elite": "2018,2019,20,20", "average_stars": 4.06, "fans": 7}}
{"review_id": "dX8VLV_Wgpqbn_viaPjUdQ", "user_id": "CcqpZkc5ngs88akzQ0rFHg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was in center city looking for a cafe with vegan pastries/options where I could spend an hour or two working on a paper, and Good Karma came to the top of the list in my yelp search. \n\nWhen I arrived I realized that they were out of pastries (not just vegan pastries but all pastries). I was a little disappointed because that's pretty much why I chose Good Karma, BUT they had vegan bagel sandwiches on their menu so I decided to get a bagel with tofutti instead. Turns out they're out of bagels too. This is weird to me since they're open until 10 apparently (so it's not as if this is the end of their business day and they've just run out of something). They did have bread apparently and the guy at the counter offered to do a substitution, but no part of that sounded appealing to me. \n\nI ended up buying a ~$3 prepackaged vegan cookie (by the alternative baking company) for lack of better options. I unfortunately didn't realize until after buying it that it has 480 calories... \n\nI grabbed a table by the back so that I could get some work done, but the WiFi was spotty so I kept getting stopped. I should also note that they played some decently loud (and not great) music, so if you're not into reading/studying/writing under those conditions (which I am not), then this place may not be for you. \n\nI left after 10 minutes because the whole thing was pretty frustrating and I wasn't getting work done.", "date": "2018-04-30 16:51:56", "user": {"name": "Aelita", "review_count": 509, "yelping_since": "2014-07-11 02:57:09", "elite": "2016,2017,2018,2019,20,20,2021", "average_stars": 4.12, "fans": 38}}
{"review_id": "QA15Semh2K6PkjweQRBQZA", "user_id": "X1Ur7RWPylRjj7fAjs_haQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place but I'm consistently disappointed in the lox they have. I almost always end up throwing it out because it just doesn't taste right. Very very disappointed because everything else is great - PLEASE INVEST IN BETTER LOX!!!!!! I really don't want to stop going here, but I will if it continues.", "date": "2018-04-28 17:18:37", "user": {"name": "Daisy", "review_count": 3, "yelping_since": "2017-06-02 00:41:49", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "eB7My8HGQNeF_xmchBTVWQ", "user_id": "S6qCyr_IdFjgHoAjVCh5IA", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place just does it for me. There are so many small touches that make you think that they just think of everything. Only reason I didn't give 5 stars is that a free refill and a board with a \"pay it forward for a stranger\" would make this good karma effort perfect. I put my suggestions in their suggestion box, so next time may just be able to bump my review to 5!", "date": "2018-04-08 14:16:14", "user": {"name": "Olivia", "review_count": 22, "yelping_since": "2015-07-14 00:17:05", "elite": "", "average_stars": 4.5, "fans": 1}}
{"review_id": "J1RDaP-tlXamkAElRrqiuA", "user_id": "Hf04lhxXJ6YgexrvpuSzvw", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I used to really like this place, and would come by occasionally to get some work done on weekend mornings. The breakfast sandwiches and coffee are good, but since the last time I've been here they've apparently put a very strict firewall up that prevents you from going to any page that is not Facebook or Google. This is ridiculous and prevents you from getting anything productive done. Don't plan on coming back again.", "date": "2018-03-24 15:01:16", "user": {"name": "K", "review_count": 5, "yelping_since": "2014-05-04 05:48:27", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "936WA348x5N_WbpxCBSikA", "user_id": "QATvP2P-tyEiKfsq1TRtIg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered a cortado and got an undrinkable cup of burned milk and bitter espresso. Way too much milk (a flat white is not the same as a cortado.) Had to throw it away. Strongly suggest you train your staff, clean your espresso machine. Won't go back here.", "date": "2018-01-24 21:52:51", "user": {"name": "R", "review_count": 6, "yelping_since": "2013-11-09 22:59:00", "elite": "", "average_stars": 2.33, "fans": 0}}
{"review_id": "KHHR_eFouJ1-ceYI0vfV5g", "user_id": "k4W4BRYvZemxKJHEOFkCLQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "So, have to say, I was excited to come in here. The reviews were good, it's a place on my way to work (so would be great to stop by in the mornings) and in a great area... but I was pretty disappointed! \n\nI came in and the first thing I noticed was that it was ROASTING hot. Granted, it was an unusually warm for winter day, but it was uncomfortably hot in there. Turn down the heat, prop the door, open a window, anything so that when I take off my jacket I'm not sweating...\n\nWhen I went up to the counter the baristas seemed more interested in their conversation than my order. I got a soy flat white (a lot of places don't even have those on the menu so I was excited to order it!), but when I tasted my drink it was almost like I had hot soy milk with a slight coffee flavor to it... NOT AT ALL when I was hoping for. \n\nThe space they have isn't huge (near Rittenhouse, what is?), but the tables were super small. I barely had enough space to fit what I needed on the table. My friend was going to meet me to work there too, but there wouldn't have been enough room for us to sit at the same table.\n\nAll in all, a disappointing experience. They have a nice seating area in the back patio area so maybe I'll try this place again in the summer... but won't be rushing back.", "date": "2017-12-19 21:34:22", "user": {"name": "Anna", "review_count": 261, "yelping_since": "2012-08-25 21:23:13", "elite": "2018,2019,20,20,2021", "average_stars": 3.85, "fans": 23}}
{"review_id": "6mRHe1Gj0CwQkbBTWafaVw", "user_id": "N-xwmRFQDQYoZU6b43AXvg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is the best coffee shop in the city! I come here regularly...the baristas are super nice and give great suggestions. Hands down the best iced coffee in the city, drinks like the Brown Bear and Rosie Palmer are personal favorites. I've studied here a few times and gotten a lot done. The bagels, sandwiches and soups (Senegalese Chicken is amazing) are all so good. You must go!", "date": "2017-11-26 16:28:43", "user": {"name": "N", "review_count": 11, "yelping_since": "2014-01-29 14:05:28", "elite": "", "average_stars": 2.87, "fans": 1}}
{"review_id": "hJXTTWUIArwubE73lSqEOA", "user_id": "jFckZv_dAGGvN2Uo_pfLJg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The employees here are fantastic! The coffee is nice and strong and the treats are the best in area. Would come everyday if my schedule allowed it. Can't wait for sunny days to return so we can sit outside.", "date": "2017-11-01 14:30:25", "user": {"name": "Gracie", "review_count": 54, "yelping_since": "2014-02-10 00:50:48", "elite": "", "average_stars": 2.78, "fans": 0}}
{"review_id": "upDe3OcrvrO0pJQZ97BrRg", "user_id": "FUM6lBtXfRvMGSoDGI_4WQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've only had the smoothies here, but they're pretty good and the service is always nice. There's always lots of people here during the day working. The smoothies are less on the creamy dense side and more in the liquidy fruity side, but still very thirst quenching. Not sure if this will be my go-to place yet, but if you're in a pinch and need to get a quick coffee or drink, this place will not disappoint.", "date": "2017-10-05 15:04:17", "user": {"name": "Zoe", "review_count": 21, "yelping_since": "2017-02-18 22:41:23", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "EZ9oMc2obQ9J_lTPOwfCMA", "user_id": "QogXrXzuFxdUCHvY-B-ltA", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I frequent Good Karma often. It's a great place to do work, has a friendly staff, and plays great throwback music. I usually get an iced coffee and it's really dark so you be prepared. They also have good sandwiches, though they run out of bagel flavors fairly early in the day.", "date": "2017-10-02 00:20:15", "user": {"name": "Steven", "review_count": 31, "yelping_since": "2017-03-09 18:24:46", "elite": "", "average_stars": 4.34, "fans": 1}}
{"review_id": "O-zbEPe4gAGwb-GWQ-W5zQ", "user_id": "UnX0tp4PLsok0SI51Mnhsg", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The service was excellent and they have such a wide variety of seasonal flavors. 10/10 would go here again", "date": "2017-09-18 22:37:24", "user": {"name": "Nara-Luiza", "review_count": 2, "yelping_since": "2017-05-04 15:09:17", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "cSQxDMBCpointx7VMDj1ZQ", "user_id": "zHt8JJlDk31V6tuBUxVn0w", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We come here often and the beverages are great! Gave it a 4 stars because the tables are tooooo small. Each table has two chairs, but two people with laptops and coffee-s simply cannot sit at one table without feeling extremely crunched for space. Please provide expandable tables for those who work on laptops, would really help.\nThe backyard seats are unhelpful as too many mosquitoes attack!\nThe service is very good hence we come here often.", "date": "2017-08-19 23:03:31", "user": {"name": "MJ", "review_count": 11, "yelping_since": "2015-05-12 18:38:31", "elite": "", "average_stars": 3.46, "fans": 0}}
{"review_id": "ztKlzL75fMGp0joRfzW_dQ", "user_id": "cFQGla2qFl6bRwlqmEwfGQ", "business_id": "SUpQ7uFtXvdzgVubewMV8g", "stars": 4.0, "useful": 3, "funny": 0, "cool": 1, "text": "I just came here once during a recent vacation in Philly but really loved the vibe of this place! My fiancé and I were both able to get a nice cup of coffee and I was able to get a breakfast sandwich with gluten free bread. The service was friendly and the wifi worked great! Not much else to say since it was such a brief visit, but I would definitely stop by again next time I'm in town.", "date": "2017-07-29 02:50:58", "user": {"name": "Nicole", "review_count": 543, "yelping_since": "2008-08-16 02:34:39", "elite": "2012,2013,2014,2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.15, "fans": 41}}
