{"business_id": "fhoqmnw5sXzj91-7yBW0Kw", "name": "Mugshots Coffeehouse & Cafe", "address": "2106 Fairmount Ave", "city": "Philadelphia", "state": "PA", "postal_code": "19130", "latitude": 39.9672753, "longitude": -75.1723717, "stars": 3.0, "review_count": 197, "is_open": 0, "attributes": {"RestaurantsAttire": "'casual'", "NoiseLevel": "u'average'", "RestaurantsDelivery": "False", "GoodForKids": "True", "RestaurantsReservations": "True", "Corkage": "False", "OutdoorSeating": "True", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}", "RestaurantsTakeOut": "True", "BYOBCorkage": "'yes_free'", "WiFi": "'free'", "Caters": "True", "BusinessAcceptsCreditCards": "True", "HasTV": "False", "RestaurantsGoodForGroups": "False", "RestaurantsPriceRange2": "2", "Ambience": "{'romantic': False, 'intimate': False, 'touristy': False, 'hipster': True, 'divey': False, 'classy': False, 'trendy': False, 'upscale': False, 'casual': False}", "Alcohol": "'none'"}, "categories": "Vegetarian, Food, Coffee & Tea, Vegan, Sandwiches, Restaurants", "hours": {"Monday": "6:30-22:0", "Tuesday": "6:30-22:0", "Wednesday": "6:30-22:0", "Thursday": "6:30-22:0", "Friday": "6:30-22:0", "Saturday": "7:0-22:0", "Sunday": "7:0-20:0"}, "category_list": ["Vegetarian", "Food", "Coffee & Tea", "Vegan", "Sandwiches", "Restaurants"], "stratification_tag": "Coffee & Tea"}
{"review_id": "WjlGPP-qiCc2oiuKNO8jtg", "user_id": "1arczfCtzq-ZuKIEHrF0jg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Staff Ui nice but coffee is bland. They increased prices and they said it was due to switching coffee...it's worse now then before!  Nice place to hang out but bring your own coffee!", "date": "2014-02-13 00:33:04", "user": {"name": "Sergio", "review_count": 20, "yelping_since": "2009-11-11 03:10:35", "elite": "", "average_stars": 2.96, "fans": 0}}
{"review_id": "SNbpKdMUPBgopjP9lB0NyQ", "user_id": "qGUMxlOaaPQvsHL5fVp5kA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love this new location! It appears to have more space (which isn't necessarily true in terms of square footage, an inside source told me) and it's much brighter. The eclectic group that makes up the staff is still pretty rad, not to mention friendly. The chef is fantastic, very creative, and they keep tasty vegan options on the menu (I'm a carnivorous creature, but I  can appreciate having options). Overall, two thumbs up.", "date": "2014-01-24 18:35:52", "user": {"name": "Amber", "review_count": 35, "yelping_since": "2013-01-15 14:30:49", "elite": "", "average_stars": 3.89, "fans": 1}}
{"review_id": "7g6FCvW2TIMdCwauXr7oCg", "user_id": "TNs7rqAwwdddl8JvTJPIiw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "On the recommendation of some friends, who told me they have some of the best smoothies in the city, I decided to stop in to see what the hype was all about. I walked in and was very greeted by a very nice lady at the counter who gave a few smoothie suggestions. I went with the Mango, and loved it! The only thing bad about it was the brain freeze I got from drinking it so fast. I'm not a vegan, but the desserts there are fabulous. I'm also big on environment. It was very clean, the staff was friendly, and was even greeted to some live entertainment (to my surprise, they have live music there too.)\n\nMy bottom line assessment is Mugshots is Starbucks on steroids!", "date": "2013-06-05 00:39:47", "user": {"name": "Oliver", "review_count": 8, "yelping_since": "2011-04-21 21:07:52", "elite": "", "average_stars": 4.11, "fans": 1}}
{"review_id": "CRzIc7gBxn2cAlig8tYU5g", "user_id": "Vnscbs5zaFVaNl46ElE47A", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Ok so this is specifically for the Girard store but should be noted for all the stores.  I call into the cafe to order a wrap.  They are out.  Then I try to order something else.  They are out.  They are out of all wraps- which makes up 1/2 their carry out menu!  What good is a carry out menu when you dont have ANYTHING on it???  Pretty screwed up.", "date": "2012-11-05 16:37:37", "user": {"name": "katey", "review_count": 46, "yelping_since": "2011-02-18 21:05:34", "elite": "", "average_stars": 2.8, "fans": 2}}
{"review_id": "IDsnnoxROb6aomcf1uF_rg", "user_id": "c1F6FZzGOz6U8xERoqQ7Eg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The lack of a fifth star is only because of the space. I liked the character of the old space. I do think in time, this one will 'collect' that feeling. AND I do like that students don't find it as welcoming for hanging out with their computers. There's nothing more irritating than going to your local cafe to sit, relax and have a coffee or sandwich for a moment to find all the tables taken up with laptops...I do wish they would sit at the counters instead. The new spot doesn't attract this 'habit' as much as the old one...yay!\n\nThe food is above cafe standards and well worth a try. MANY vegetarian options. I highly recommend the veggie chili for everyone. It's great with extras like sour cream or cheese. But don't try it if you're spice shy, this one is good and spicy hot.  \n\nThe Mugshot green-organic philosophy is a joy to be a part of. The events, while not dramatically attended, are a nice treat...especially the beer-coffee pairings :-)\n\nIf you're looking for a Seattle-style 'coffee' shop, this may not be your spot...come to think of it...go to Starbucks. If you're looking for a place to have a bite with your coffee or tea, have a conversation with the staff, sit for a bit, this is your spot.", "date": "2012-10-28 13:12:38", "user": {"name": "Karen", "review_count": 3, "yelping_since": "2009-01-14 05:32:28", "elite": "", "average_stars": 3.33, "fans": 2}}
{"review_id": "ysT-bIfK9t4Mp3REfIfSVA", "user_id": "ozUHEpWDfRn7IKqluK503A", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was a big fan of the Manayunk location and was happy to find a Mugshots in my new neighborhood, as well. My go-to has always been the Bonnie & Clyde (chicken, spinach, pesto, and provolone served on ciabatta). It might be a simple sandwich, but all the ingredients work so well together.. plus I'm a firm believer that ciabatta bread makes just about every sandwich better. The peppermint iced tea is also worth trying if you like peppermint.. its flavorful and refreshing.", "date": "2012-10-02 17:10:44", "user": {"name": "Therese", "review_count": 335, "yelping_since": "2012-02-29 21:38:27", "elite": "2012,2013,2014,2015,2016,2017,2018", "average_stars": 3.7, "fans": 4}}
{"review_id": "VB-chNl-wKxYadGNJbbjqg", "user_id": "aWJSrdwLFLGSu3qx0L7FOg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The new location is a win for Mugshots.  It's brighter, more modern and less confined.  The line moves more quickly and the food and coffee are still high quality.  I really like the bar and there is always room to sit and relax.  Whoever thought of the iced coffee growler is a genius!", "date": "2012-10-02 13:06:54", "user": {"name": "Lisa", "review_count": 29, "yelping_since": "2009-07-17 15:13:25", "elite": "", "average_stars": 3.24, "fans": 0}}
{"review_id": "wx-uoyMDCn_fXyoqD9OdpA", "user_id": "z8N1dc2kEOkytHcXeWoUng", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 4, "funny": 1, "cool": 0, "text": "We stopped in for iced chai tea lattes and got iced milk instead. We threw them out after a few sips and angrily headed to our local Starbucks for the real deal. It was most definitely a waste of $8.10 so we will not be returning. There is a Starbucks at 19th and Callowhill that will be worth the walk!", "date": "2012-09-10 19:50:34", "user": {"name": "Becky", "review_count": 5, "yelping_since": "2012-09-10 17:41:38", "elite": "", "average_stars": 3.2, "fans": 0}}
{"review_id": "vZ5y9d3xjEHiFHyOVtBXqQ", "user_id": "yna39ApeAFhVBzgqMJJgAQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I really hate to give this place a bad review because I used to love it so much, but I have to. The coffee and the food is still good, but I really don't care for their new location, the price bump, and the crowd it attracts. Not to mention, it looks like they canned all of their staff from 21st and Fairmount when they moved. Normally I don't mind when a place moves, usually it's for the better, but not this time. The Mugshots at 21st had more heart and the staff looked like they enjoyed being there, when I went in here the other day everything that I liked about the previous location was gone. A coffee shop is supposed to be comfortable, this one just morphed into something ugly and corporate.", "date": "2012-08-25 15:41:31", "user": {"name": "Jon", "review_count": 8, "yelping_since": "2011-06-15 16:49:30", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "T_8nN_MWH6H-upmh9CMUSg", "user_id": "sEgD3bZ0luYZ9WQLxpWyvQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 8, "funny": 7, "cool": 2, "text": "If you want disaffected trustafarians or hipsters to serve you overpriced coffee at their own leisurely pace, this is the place for you.\n\nComing off of living in Portland, Oregon for fifteen years, it's as if these jamokes were relocated to Philadelphia, since they couldn't hack it in the Pacific Northwest as a barista.  \n\nEverything about this place needs to be changed from the pricing to the seating and most importantly; the staff.  I strongly suggest that the owner learn the distinction between running a hipster group home and a business.", "date": "2012-08-22 15:22:22", "user": {"name": "Kyle", "review_count": 14, "yelping_since": "2009-09-13 11:49:16", "elite": "", "average_stars": 2.43, "fans": 3}}
{"review_id": "u0BWVJlo9JCo9-CpJER_Xw", "user_id": "GJVxudHglmgU7NtWAzEw5Q", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 3, "funny": 1, "cool": 1, "text": "I used to loooove Mugshots.  The old location was great.  The new one is horrible.  It is so loud.  Every conversation, every thought is interrupted by grinding or steaming.  The old place was charming, this one is cold and sterile and Starbucks.  The coffee and food are fine, but it is no longer a great place to hang out, study, read.  Just thinking about it gives me a headache!\n\nI have to say that I really like the grilled cheese with the apple slices.  I'm not a fan of cafe food, but this is a solid sandwich.  I used to go out of my way to eat and work here, but I'm not going to make the trip from Northern Liberties just to get a sandwich I can make at home.  The staff still seems fine, the place is clean and well lit, but if the noise level of a place gives me a headache, I can't enjoy any of that.  \n\nThey need a few walls that can absorb some of that sound, and to put up something around the blender/steamer/grinder.", "date": "2012-08-11 05:47:43", "user": {"name": "F", "review_count": 109, "yelping_since": "2010-02-14 09:34:40", "elite": "", "average_stars": 3.44, "fans": 4}}
{"review_id": "u10BU1zTUr0pCYwArYrfUA", "user_id": "jfIvQyiFMahx2F7NaVpD7A", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Loud! Loud! Loud!\nI came here to get some grad work done, which seemed like like a common reason for many to go to a coffee shop, right? Anyway,  there weren't a lot of people there, yet still every five minutes the blender was blaring. BLAR-ING! Sorta hard to read technical writings with all of the noise.  I agree with a previous poster, the staff are a far cry from warm. To top it off, I got kicked out an hour early because it was slow, not cool for me.", "date": "2012-08-08 23:35:45", "user": {"name": "Ali", "review_count": 8, "yelping_since": "2011-09-03 17:46:27", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "8hnpHMrWIDBUdxoHBQ-c6g", "user_id": "A1HaQ8AA00cdiXyp7SWXrA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "I live in the neighborhood and supporting the local businesses has always been important to me.  However, I will tell anyone and everyone to skip Mugshots.  The only reason they get two stars from me as opposed to one is because I agree with their fair trade values when it comes to sourcing coffee.  \n\nI've been to Mugshots about ten times and every time, without fail, the staff was rude and brusque.  It was almost as if they were put out that I was there.  No eye contact, no smile, no greeting, no thanks for stopping by.  The food and drink were insanely overpriced and took a lifetime to appear.  I appreciate that they make everything to order, but it doesn't take 15 minutes to make a latte or a BLT.  Ever.  Couple all of this with the fact that each time I visited, the quality of the food and drink steadily declined and you have a pretty decent picture of why I will never go back.  I will, however, be cheering for both Cafe L'Aube (at 16th and Wallace) and the new coffee shop that's coming to the old Mugshots location to succeed.", "date": "2012-07-30 18:14:45", "user": {"name": "Michelle", "review_count": 11, "yelping_since": "2009-10-26 05:05:40", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "RaIJGZ09GVfY96SAkyNQ9w", "user_id": "D-aWOUR3yvt_JjZvc93C2g", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "This is a solid O-K. Breakfast sandwiches are good the bacon is awesome, nice and thick. Don't over look the smoothies - good stuff. The thing that kills this place for me is the service and atmosphere, for whatever reason every employee looks annoyed they have the same people ring you up and make the smoothes and coffee. So if someone orders a smoothie and a coffee they are inline for 5+ min waiting for their drinks then have to pay. Then you go over to this little window to get your food but its right next to the ordering line so you are in peoples way, very unorganized. The place is very loud and there are tables and chairs everywhere so gets crowded, their old location use to be much better more like a neighborhood  coffee shop but not any more. \n\nFood is good but just get it to go and try to stay out of the way.", "date": "2012-07-30 14:11:55", "user": {"name": "Dan", "review_count": 10, "yelping_since": "2012-01-30 14:32:13", "elite": "", "average_stars": 3.6, "fans": 0}}
{"review_id": "ZB9IsD_Vy42i-gGxHexluw", "user_id": "xGlcVgVwlXBD3FSdnx5KBQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I used to look forward to coming in to Fairmount so I could go to Mug Shots with my sons.  We've done it for years and it marked some of the most enjoyable times we've shared.  We went to the new location yesterday and what a disappointment.  What happened to the character and warmth of the place?  Where's the eccentricity? Where are the comfy caste offs from grandmom's attic and the cozy nooks and crannies?  Where is the incredible menu filled with imaginative vegetarian and vegan sandwiches?  All we found was a sanitized, coffee chain ghost of its former self.  Good coffee is not enough to bring me back here.  It looks like every other mass produced coffee shop.   Its meager selection of premade sandwiches in plastic wrap is nothing but a sad eulogy for the greatness that once was Mug Shots.  Why did this have to happen???", "date": "2012-07-17 20:30:40", "user": {"name": "Marian", "review_count": 6, "yelping_since": "2012-07-17 13:50:29", "elite": "", "average_stars": 2.83, "fans": 0}}
{"review_id": "PG2RW1y07XJXzMJZW2o1cw", "user_id": "mT-w26WMOYWAj9GPsDZRPw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "It's not hard to pour a cup of coffee and make a bagel sandwich.  Yet mugshots always seems to have a problem doing so.  Cold eggs in a bacon, egg and cheese sandwich is baffling to me.  Why would eggs be cold unless they were frozen.  How hard is it to crack an egg on a grill and flip it over.  Paying $2.50 for bacon in a breakfast burrito which finally comes without bacon.  Thanks.  The only reason people go to mugshots is because there are no other coffee shops in the area.  I don't even like giving it 1 star.  You guys suck.", "date": "2012-06-12 18:59:20", "user": {"name": "Mike", "review_count": 2, "yelping_since": "2012-06-12 18:57:07", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "0Nsokw62QTEKoK_du7uwPQ", "user_id": "hPApCJkWVg_yrS2aUuPQWw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 4, "funny": 0, "cool": 1, "text": "I have now stopped into Mugshots twice and can say that I would probably not go back.  Between the staff that seems uninterested whether or not I am there, the fact that the coffee (although quality coffee) is not made very well, and the \"hipster\" ambiance I would rather go elsewhere.  \nI don't know what it is, but the staff really does not seem to care about the customers.  Most of the space seems like it could use some serious cleaning which is why I only got coffee.  The noise is fantastic and the lighting is intermittent at best.", "date": "2012-05-30 19:01:07", "user": {"name": "Michael", "review_count": 144, "yelping_since": "2012-03-19 17:46:50", "elite": "", "average_stars": 3.06, "fans": 1}}
{"review_id": "9uZTEI40jHvGs5vcLbdyXg", "user_id": "LiQI6k9gW9AQx32wQZN5Yg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 1, "funny": 1, "cool": 1, "text": "Mugshots has moved to 19th and Fairmount. I really like the new location for some reasons and disappointed for others. The layout of the new place makes sense and there are more seats which was an issue at the previous location. The service seems faster and more efficient. I had the quiche and it was super tasty. A downside is the outside seating no longer overlooks Eastern State Penn, but Riteaid. There is less character since it is a new building and the noise level is higher.", "date": "2012-05-26 17:15:19", "user": {"name": "Nelly", "review_count": 5, "yelping_since": "2010-03-18 12:49:22", "elite": "", "average_stars": 2.8, "fans": 0}}
{"review_id": "udZ8RV90xJyUnAOq3o8UJA", "user_id": "_R-xEEF119h1faZ2xfSpjA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "If I could give this new site a zero, I would!  The place is brighter but the noise level is unbelievable!  All the loud talk echoing off the wood floors is bad enough. Add periodic banging from somewhere in the back and intermittent use of a very loud blender and I was finally driven out the door!!!\nToo bad. No more cozy neighborhood coffee place.\nUsed to be a good place to enjoy a chai.", "date": "2012-05-11 22:18:54", "user": {"name": "Tough", "review_count": 234, "yelping_since": "2011-03-23 22:32:29", "elite": "", "average_stars": 3.47, "fans": 3}}
{"review_id": "JMq5CygwwzwvoWjuvjN84A", "user_id": "hUtYJ8T2Fg2YjvplHajEsw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "Oh, Mugshots, why? What was the point of moving two blocks away to a worse location that has none of the character of your old one? Not only is the new place dark, spartan and corporate-looking, you have almost none of the good menu items from before (vegan reuben, vlt, etc.) You've switched to pre-made sandwiches so additions and substitutions are a thing of the past.\n\nYou've always been pricey, but it was worth it when you still had good food and atmosphere. If it's not broken, don't fix it!", "date": "2012-05-10 15:16:15", "user": {"name": "Cameron", "review_count": 17, "yelping_since": "2011-03-14 15:39:09", "elite": "", "average_stars": 3.24, "fans": 0}}
{"review_id": "la50hdwzaIUHd0VusjxEEQ", "user_id": "W0Cvuxt3J4r2lmqUz8yBBg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "I'm so disappointed that Mugshots moved three blocks up Fairmount into their new location.  The building is so unbelievably nondescript, it's sad. The interior looks like cross between a bad Starbucks and a cheep cinderblock daycare.  Mugshots has lost all it's character and charm and traded it for faux granite countertops and Ikea pleather couches.  It's sad to see you go, Mugshots, you had such a wonderful way of snapping me out of my Sunday stupor.  I know you just moved and I should give you a chance to acclimate, but I just don't see how there's anything you could do to right this - you really got everything so wrong.  So long, and thanks for the memories.  *sigh*", "date": "2012-05-05 18:03:49", "user": {"name": "Aaron", "review_count": 13, "yelping_since": "2010-04-04 19:37:32", "elite": "", "average_stars": 3.46, "fans": 3}}
{"review_id": "eb5ETCBTTBAN18OaMeKyww", "user_id": "F3fhjZMm92YyD6Em9e4xpw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was super excited to see the new location for the first time. As soon as I walked in, I was so depressed by how different everything looked that I almost left. I'm glad I didn't though because the salads and baked treats are as good as ever. After I sat for a while, I had to admit that it's not that bad. The space is smaller and everything looks nice and new with a fresh coat of paint on the walls. But the old venue just had that great vibe of an old building that's been reinvented a couple of times. From the windows you used to see the stone walls of the Penitentiary; now you're looking at Rite Aid. It's still a fine coffee shop, but a huge part of what made it unique is gone.", "date": "2012-05-03 23:24:26", "user": {"name": "Janet", "review_count": 20, "yelping_since": "2011-06-27 13:55:58", "elite": "", "average_stars": 4.43, "fans": 0}}
{"review_id": "QbI_M3bj1Gz7S5Qx5oshNw", "user_id": "F3fhjZMm92YyD6Em9e4xpw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "I think I've tried like 75% of their baked goods and have yet to find one I didn't like.  Coffee is pretty good too.\n\nThe food is just OK. All the salads are fine. The Capone wrap and Scapegoat Sandwich are yummy. The curried chicken salad wrap is not.\n\nAtmosphere is cool. It's a great place to come and study which is the main attraction for me, but I hear they're stingy with their internet.", "date": "2012-05-01 00:26:19", "user": {"name": "Janet", "review_count": 20, "yelping_since": "2011-06-27 13:55:58", "elite": "", "average_stars": 4.43, "fans": 0}}
{"review_id": "piFfBAgHHBUNusqjO3YBYA", "user_id": "6XFEZI4Awe79u_rvWlQPjw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 2, "funny": 2, "cool": 2, "text": "I love it here.  They really shake up the shake, combining lots of different, but extremely yummy flavors.  Flavors of the day are written on a blackboard in chalk, making the ambiance fun and inviting.  The only downside is seating.  While there is plenty of standing room - and it's perfect for people on the go, with lots of street parking available - there are very few seats. \n\nThe last time I went my date and I had trouble hearing our name called out - and ours mirrored the couple next to us.  So we rotated who got up when their name was called and finally got our correct meals.  The door we were sitting by we 'just for show', so my date and I spent hours telling people, \"That door doesn't work.\"  I suppose we could have let them struggle a bit, but that's just not the way we thought.", "date": "2012-04-10 12:18:44", "user": {"name": "Niki", "review_count": 85, "yelping_since": "2011-11-12 15:09:52", "elite": "", "average_stars": 4.22, "fans": 2}}
{"review_id": "Q3GTIT08t2813jT_Lwmjpg", "user_id": "6A78-_r2HDhqtiXS0chegA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Pros: Counter culture Coffee\nCons: Coffee is served in paper cups by default, staff attitude needs adjustment. \n\nAs I was also picking up some beans, being something of a coffee aficionado, I asked the person working the register a few questions about the blends available for sale and the latest roast date and even though there was no one else in the shop at the time his general behavior was borderline rude. We ordered a couple of drinks and sat at a table. When the first order came out it was served in a paper cup. I inquired as to why would they serve me a cappuccino with a cardboard flavor when we clearly were trying to enjoy it right there. In response I was handed a cold cup sitting on the counter - no apology or offer of a replacement...\n\nOverall the place is just average at best and not worth walking distance from the art museum. I would definitely recommend Elixr on 15th and Walnut instead - those guys know what they are doing.", "date": "2012-04-07 23:43:56", "user": {"name": "Andrey", "review_count": 7, "yelping_since": "2012-04-07 22:36:07", "elite": "", "average_stars": 2.57, "fans": 1}}
{"review_id": "AQRKiEplLJ7U5huRdCn18w", "user_id": "SVfazUWUTH0qT6OotQOa7g", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely adored the Manayunk store, and was prepared to give the Fairmount store a chance. While the staff is very friendly, they are just too overwhelmed and busy. Maybe more staff would help.  But this morning my coffee had grounds in it. I don't think I'll be returning.", "date": "2012-03-20 15:25:59", "user": {"name": "Meredith", "review_count": 14, "yelping_since": "2012-02-16 21:26:21", "elite": "", "average_stars": 3.6, "fans": 1}}
{"review_id": "4Vf05EG-Lc2GS_zuNnyhGA", "user_id": "FI04l6nA98JySbqmG5iCuA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really like the area, I like the design inside. The vegan treat the gf bought was better than I was expecting. The coffee was pretty good. But man I just don't know if it was worth the prices that we were paying. I feel like I can get better deals even in center city let alone someplace a little further from what I expect to be the most overpriced parts of the city. Tough for me to give it three stars cuz I really do like this place.", "date": "2012-03-11 21:32:34", "user": {"name": "Jose", "review_count": 127, "yelping_since": "2011-11-20 14:31:20", "elite": "2012", "average_stars": 3.39, "fans": 3}}
{"review_id": "ogghIyWT-6xHVb8OhzE1Ig", "user_id": "IRVMXWg8Ttaf_JTIoU-abA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "Just about the nicest staff in all of Philadelphia.  \n\nIt's big and roomy, but seating (and outlets) can get scarce.  It's a good place to get some work done, if you don't mind balancing your laptop on your lap.", "date": "2012-03-05 17:38:42", "user": {"name": "Eva", "review_count": 20, "yelping_since": "2010-02-05 17:44:09", "elite": "", "average_stars": 4.5, "fans": 2}}
{"review_id": "_dYxfT2gtzgqSvX7kMnfUw", "user_id": "-Wm9WZrDTIA4I2pDpdoplQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "COMMENCE RANT:\n\nTerrible, terrible, TERRIBLE customer service. \n\nMy girlfriend and I went to Mugshots yesterday. The place was very crowded, and when it was our turn to order we noticed that there weren't any free seats. So my girlfriend told the cashier that we weren't sure if we were going to order because of the lack of available seating. Before she even finished this sentence, the cashier smirked, pointed to the line like we didn't know it was there, and gestured to the person behind us to place their order. She didn't say a single word to us. \n\nI understand that that isn't the type of thing a cashier wants to hear when it is busy. We were, however, going to ask her for just a second to decide what we wanted to do. But apparently she didn't feel like giving us the chance. It's like she felt that she was doing us a favor by giving us the opportunity to order, and since we had inconvenienced her so terribly she decided to revoke that privilege. Overall, this woman came off as impatient and condescending. I must say it is ironic for a cashier to have a superiority complex. \n\nThe very fact that there was no available seating was also, in itself, annoying. Normally this wouldn't bother me, but I looked around a bit and noticed that about half of the customers were sitting there typing away on their Macbooks while nursing small coffees (some of them were just drinking water from Nalgene bottles). Even worse, many of them were sitting alone at tables meant for multiple people. And worst of all, every single one of them was a hipster. \n\nI know I am going to tick a lot of people off with these comments, but let's be serious here: Mugshots isn't just a \"coffee shop\" like Starbucks. They also serve breakfast and lunch. And people would like the opportunity to sit down and eat said foodstuffs. But they don't get the chance if everyone else thinks its acceptable to buy a cup of coffee and then sit there for extended periods of time writing term papers, brooding poetry, or whatever they consider to be trendy. This is fine when the place isn't so busy, but during rush hours it is downright inconsiderate. THERE IS A REASON WHY THEY PUT A ONE HOUR LIMIT ON WIFI ACCESS FOR CUSTOMERS!!!!!\n\nI should mention that although we left without ordering, we had been to Mugshots once before and the food was pretty tasty. This doesn't make up for the awful customer service and the droves of self-absorbed \"cool kid\" customers, however. \n\nSo in sum, go to Mugshots if you enjoy:\n-Good sandwiches (if you don't mind paying high prices and waiting a half an hour for your food to come out)\n-Snarky and disrespectful staff members\n-Not being able to find an open seat\n-Being around gaggles of hipsters who think the place is a library, or a Starbucks, or something. \n\nEND RANT!", "date": "2012-03-05 06:06:36", "user": {"name": "Matt", "review_count": 15, "yelping_since": "2011-10-09 21:51:41", "elite": "", "average_stars": 2.67, "fans": 0}}
{"review_id": "jhZMRsbymeDtzqirpFVYHw", "user_id": "VEj1OuO6QrQMXFhuMZJ8cQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 4, "funny": 4, "cool": 4, "text": "There's plenty of standing room to accomodate the plethora of people who zip in and out of this place like they're escaped convicts from the Easter State Penn grabbing a quick sandwich and coffee before Bonnie and Clyding it out of Fairmount.\n\n...and then there are plenty of people who stay - calm fugitives with families and friends, relaxing and enjoying their frothy cappuccinos, decadent cupcake and healthy hummus wraps. These people occupy  the numerous couches, tables, and chairs that spread across two rooms and a window facing bar. \n\n(The food selection is bountiful, from fresh fruit to vegan brownies to egg dishes to salads, sandwiches, and soups. Everyone is sure to smile, especially that three year old with frosting smeared all across his face and red velvet chunks in his hair.) \n\nThere's the constant rumble of conversation, but Mugshots is perfect for people watching - and studying if you can keep your eyes from wandering across the room to that perfect stranger...\n\nOH YEAH YOU CAN ALSO PAY WITH LEVEL UP SO THIS MEANS YOU'RE SAFE IF YOU LEAVE YOUR CARTE DE CREDIT A TA MAISON.", "date": "2012-03-04 19:46:03", "user": {"name": "Ettya", "review_count": 705, "yelping_since": "2011-03-16 14:44:46", "elite": "2011,2012,2013,2017", "average_stars": 4.25, "fans": 90}}
{"review_id": "CYJ0DmRj9Pi1WQb8o_CmxQ", "user_id": "tWES6_T7MRybOtqNS9NcVw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 1, "funny": 1, "cool": 0, "text": "Two hot chocolates, one muffin, one brownie. $12\n\nI remembered a flavorful hot chocolate from my last visit to Mugshots over a year ago. This one had barely any taste.\n\nI remembered a richer, thicker, nut-free brownie from a visit to Mugshots maybe two or three years ago. This one was high school bake sale quality.\n\nThe muffin was good. Not amazing, but good.\n\nService was interesting. My hot chocolates were slow to come out because it looked like the staff was running around like the kids of Scooby Doo when they get spooked by a ghost. During the apparent confusion, a guy waited for awhile at the register and finally asked if anyone was taking orders, and that seemed to bring some order to the staff, and shortly after I got my bland chocolate-ish drinks.\n\nWhat I'm saying here is that I feel like I overpaid. Poor Mugshots. You used to be awesome.", "date": "2012-02-22 01:59:55", "user": {"name": "Candice", "review_count": 281, "yelping_since": "2007-07-28 01:20:26", "elite": "2009,2011,2012,2013,2014,2015,2016", "average_stars": 3.96, "fans": 29}}
{"review_id": "M5JvqN4oxNtctg-6Oud8ow", "user_id": "71-LO-SHbmLnf-AgxRtJTg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 0, "funny": 1, "cool": 0, "text": "Worst experience at a coffee shop ever. The layout does not allow for people to use their laptops with an outlet, so my friend and I were forced to sit on a couch in the corner so we could have power to a laptop. Normally, a couch would be great, but when you're studying and getting work done, it complicates things a little. My friend and I moved twice before being able to be productive. Scouting tables is not a valuable use of my time. It's also so dark in there that it's difficult to read. The layout allows for everyone's conversations to carry, so that even using earbuds is close to useless. \n\nThe tea was great, I had the Rooibos Mate. It was just such an inconvenient experience that I doubt I'll come back.", "date": "2012-02-15 22:47:15", "user": {"name": "Robin", "review_count": 34, "yelping_since": "2010-09-21 19:21:55", "elite": "", "average_stars": 3.63, "fans": 1}}
{"review_id": "928PnDaT49NG8p-PR-U5Og", "user_id": "QWwcYdXQmGSVt59rJJqz6A", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The taste (or lack thereof) of baked eggs is still lingering on my breath as I write this.\n\nThis is a tale of a local coffee shop swallowed into the branding of some corporate big-wigs.\n\nI had been patronizing Mugshots for over a year and have never felt dissatisfaction once, until now.\n\nAfter switching hands, (management or ownership, it is a bit unclear) Mugshots has officially jumped the shark. What does a girl want more than an egg sandwich on a Saturday morning. Instead of nice eggs, folded over from the griddle, I received some baked holey mess. Instead of cheese spilling over the eggs it was seemingly absent.\n\nWhen inquiring about the aesthetics and taste of the rubbery eggs the one employee began an obviously rehearsed spiel about how more people prefer their eggs baked and fluffy, that it's healthier and the eggs are so local they were fresh, just delivered yesterday. \n\nTo give credit where credit is due, he did try to accommodate by offering to make the sandwich again, yet it would still be baked into a square chunky mess of holey eggs. I declined and he told me that all major chains like Dunkin Donuts and Wawa bake their eggs, still harping on how most people prefer it that way.\n\nIf I was looking for shitty baked eggs I would go to Wawa, pay way less and wouldn't regret trying to get decent food from a presumably locally owned establishment. \n\nIt was at this point that the one line-cook offered to fry me some eggs on the griddle, something that the other employee never even offered. I was grateful that someone was listening to a customer's opinion instead of reciting what popular opinion polls found. \n\nI understand new owners mean a new style of doings things, but I didn't think when the shop boasted on Facebook about shorter waiting times it meant they were industrializing local and creating a more popular, yet less tasty egg.\n\nI will have to look elsewhere for a morning breakfast sandwich, unfortunately I am of the apparent minority who prefers an old fashioned egg. At the age of 28 I guess you need to get off my lawn.", "date": "2012-01-28 19:42:29", "user": {"name": "Megan", "review_count": 29, "yelping_since": "2006-08-15 17:23:19", "elite": "", "average_stars": 3.94, "fans": 1}}
{"review_id": "G9K6nBQ4UF51iNEFodvF6w", "user_id": "OeGo1dAOFEK62RsDvXCpLQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The veggie food was soooo good.  They had a really wide range of veggie sandwiches and a lot of delicious smoothies and teas. The atmosphere was nice, but I wish they had more couches! Definitely recommend it. The sandwiches were a little small but maybe we're just used to over-sized American portions that normal sandwiches look small....", "date": "2012-01-16 00:25:41", "user": {"name": "Zanna", "review_count": 23, "yelping_since": "2010-11-08 14:49:32", "elite": "", "average_stars": 4.32, "fans": 0}}
{"review_id": "M9YhhSqk5Ng4XMVVhxa8fw", "user_id": "NFqGjkooYQ91T78BDC3hcA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 5.0, "useful": 3, "funny": 1, "cool": 3, "text": "Every time I am down in Philly to visit friends we stop in at Mugshots daily.  The coffee is great and the staff is always really nice, no pretension here.\n\nAside from the awesome coffee the vibe is very welcoming, definitely the perfect way to start your morning after a late night!\n\nBeing a vegetarian I normally get the shaft when it comes to food options but the food here is actually well thought out, not just the standard veggie items you see at 90% of cafe's, and delicious.\n\nWish that there was a Mugshots near me!", "date": "2012-01-06 16:15:22", "user": {"name": "Roman", "review_count": 7, "yelping_since": "2009-07-12 16:00:14", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "5HjTvyYWRsb0tBHuOUqx5Q", "user_id": "upQwDazroow3rjNMW4PZww", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "decent specialty drinks, but the coffee is rarely good.  food is excellent, but pricey.  environment varies.  can be over crowded by the stroller set. staff varies as well.  some are quite friendly, some are far from it.", "date": "2012-01-04 21:44:49", "user": {"name": "texas", "review_count": 193, "yelping_since": "2011-01-03 18:36:29", "elite": "", "average_stars": 3.74, "fans": 6}}
{"review_id": "bHZd9tBC9-lmm4pa0cg_cA", "user_id": "94Ju08MchWtuSzw4GO-DAQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "This is my favorite cafe in Philadelphia.\nThe food is SO good and I love the way it feels / looks inside.\nMy sister and I went there yesterday before going to the Eastern State Penitentiary and had such an awesome time!  I don't normally write reviews on yelp but this cafe really stands out among the rest!", "date": "2011-12-22 13:55:28", "user": {"name": "Annie", "review_count": 11, "yelping_since": "2011-12-22 13:54:48", "elite": "", "average_stars": 4.64, "fans": 0}}
{"review_id": "3Ht2Ev-kiaY61sc-w7LTJw", "user_id": "zocZa3c_1EsBdkvUEeEsfA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "First of all, let's all welcome me to the Fairmount Neighborhood! Yes, I finally moved... But that's enough about me, let's talk coffee. Now, as some of you know, I am a huge fan of \"La Colombe\" and I rarely cheat on it but \"Mugshots\" is so close by that it's just that much easier to go there when I am at home, or when I am walking to work (30 minute is much less painful with a cap of java)...  \n\nNow, there is a reason why I mentioned the 30-minute walk and that reason is: I work in center city, the cafe is really NOT in center city, and the prices don't even come close to what they should be. I mean,  I pay $2.75 for a \"La Colombe\" latte (Rittenhouse Sq.) and I paid at least a $1 more for the same size latte at \"Mugshots\". Seriously? I mean, I get that the place is hipster-cool and, as seen by the lines and the lack of available tables, popular but it doesn't mean that the prices have to be so disproportionate. \n\nOverall:\n1. Ambiance is very hipster-cool (interior design and the patrons)\n2. Food is pretty good from what I tried\n3. Prices are highly disproportionate to the location\n4. Outside seating is lacking... 3 tiny tables, often occupied by people who didn't even get anything at the cafe\n5. Coffee could be better but, then again, I am a \"La Colombe\" snob so I am biased\n6. Customer Service seems to have its good days and its bad days, depending on who you get\n\nDue to the convenient location, I am sure I will become a regular regardless of points above but it would be nice if these points are noted", "date": "2011-11-28 15:36:23", "user": {"name": "Valerie", "review_count": 26, "yelping_since": "2011-03-30 14:42:54", "elite": "", "average_stars": 3.93, "fans": 2}}
{"review_id": "softtH0guoweDcy4HYWUFQ", "user_id": "BzIwl71yzAPoJpugzGrX1g", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Stopped here for a sandwich before visiting Eastern State Penitentiary across the street.  Great space, nice and spacious, very crunchy cozy.\n\nHowever, my Vegan BLT was served on bread, not toasted, and served on a big plate with no pickle, chips, nothing.  Just a lonely sandwich on a plate.  Lost major points for that one!  \n\nI feel like this place could be so much more!", "date": "2011-11-23 17:46:03", "user": {"name": "H", "review_count": 33, "yelping_since": "2010-12-31 03:01:34", "elite": "", "average_stars": 4.12, "fans": 0}}
{"review_id": "a0d-ohGuM5hirLgmau36ew", "user_id": "kFGSrAfXgerNEVy9SaLzJQ", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Sadly, this place is broken. The food & coffee was fine but the service is slow & the manager has a huge chip on her shoulder. \n\nI originally drafted this review while sitting outside of mugshots on marathon day. It was 7:23 am.  According to their website, they open at 7am.  I scoped this place out b/c it opened early & would have left if i had the luxury of time.  According to the manager who was setting up chairs outside when I approached, they open at 7:30. She seemed terribly annoyed that she had to speak to a customer a whole 7 minutes before they opened. There were actually 4 of us, including a dude with a baby in a stroller that she passed twice, locking us out until 7:30ish.  We were all confused about the opening time & her inexplicable rudeness.\n\nThe service didn't improve once inside. While the cashier was friendly, the manager was making espresso drinks and it took a good 15 min. to get my decaf latte. It took 2 attempts.  She first made a regular & when double checked, she looked at me like I was trying to screw with her.  Then, after checking the order slip, she wordlessly remade it without a word.  And *she's* in charge here. \n\nI don't know if they were busier than normal this morning b/c of the marathon or if they are always slow but the people around me were complaining about how long it took to get their food. And on top of it, for some reason they couldnt take credit cards. \n\n It seems that this place needs a bit of an overhaul in general, but the big problem seems to be management. \n\n If Iived here, I wouldn't be back. The coffee was good, I have to admit. But here's the thing: it's about the way you treat people. It's about how welcome your customers feel. You don't have to kiss ass, but the idea is that your customers keep the joint open. Be nice to them. It's not that hard. A little kindness goes a long way.", "date": "2011-11-21 02:20:14", "user": {"name": "Christina", "review_count": 10, "yelping_since": "2011-02-25 22:39:39", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "Bc1KWacgj4XtzWn0AxaDJQ", "user_id": "COEranxZuyCjs9iQDmrfYw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 0, "funny": 1, "cool": 1, "text": "One star for not allowing cats and goes without saying, poor service, you prior yelpers know what we're talking about.  The breakfast burritos are as cold as the service.  It's great they have lots of gluten free, vegetarian fare, but worthless when they mix up your order leaving you with green eggs and sausage.\nBuy your local produce at the grocery store.  Make your own coffee.  Not worth the 2 dollar upcharge. We really have to hold back yelping on about this.", "date": "2011-11-19 04:23:54", "user": {"name": "BethandGus", "review_count": 12, "yelping_since": "2011-11-19 03:40:36", "elite": "", "average_stars": 2.38, "fans": 1}}
{"review_id": "iJHJFOcUwIEGctkHD5q3og", "user_id": "Ebg8m7oCW-dMdNH4wf0w6w", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love mugshots- great cafe!\n\nmy only request would be for them to offer more gluten free options- gf wraps would make this place even better!", "date": "2011-11-07 15:13:06", "user": {"name": "Kara", "review_count": 62, "yelping_since": "2010-08-27 12:57:02", "elite": "", "average_stars": 3.7, "fans": 0}}
{"review_id": "Ew-Ipecv-U42TsL89Z_4FQ", "user_id": "DVqPt0smhv2s62aSl8KdOw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I recently moved to Fairmount and I have gone here two times.  Each time I came out of there saying \"Jeeze this is expensive.\"  This last time I went I found a hair in my egg and cheese.  I won't go back.  I'd rather make breakfast myself.  Plus, it gave me the runs both times!", "date": "2011-11-04 13:16:43", "user": {"name": "Jason", "review_count": 2, "yelping_since": "2010-12-03 22:58:33", "elite": "", "average_stars": 1.0, "fans": 0}}
{"review_id": "3Cq_j2ivzWb8CRuJp8AiFg", "user_id": "5Ws1wSIBmxxXY7WNNhc7Og", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "What on earth happened to the prices in this place?  $2.48 for a 16 oz. coffee now?  I think $2 is pretty much the barrier for me.  I've been a regular here for a while, but at this prices, I have to move on.  And, the coffee quality seems to have gone down...I may be mistaken but the coffee tasted robusta to me on this last visit...\n\nCustomer service has always been hit or miss here, and the fact that now a regular coffee is as much as a latte, I think I've had enough.", "date": "2011-11-02 13:14:19", "user": {"name": "Ramon", "review_count": 29, "yelping_since": "2009-10-08 19:56:06", "elite": "", "average_stars": 2.67, "fans": 1}}
{"review_id": "J2OsMNLVaj-21vpQNmZZrg", "user_id": "rCycGfUtOom97bt1Y5bmig", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The atmosphere is nice and cozy and the food is decent, but the drinks are definitely WAY over priced. Depending on the time of day, also too crowded to get a table and they run out of bagels all the time. what kind of coffeeshop runs out of bagels every day?\n\nThe staff are very professional and quick with the orders, but they can definitely get a little snippy if some entitlement brat is holding up the line (which also happens a lot).\n\nthe deserts are fantastic, but the \"healthy\" vegan foods and specialties are full of nasty substitutes instead of sticking with actual natural ingredients(e.g. they use the processed fake meat instead of just using lentils, stuff like that)", "date": "2011-10-31 18:40:28", "user": {"name": "kaz", "review_count": 15, "yelping_since": "2011-10-31 13:32:43", "elite": "", "average_stars": 4.2, "fans": 0}}
{"review_id": "H35uLf59jah-bsKjn8P3sQ", "user_id": "mpL9iS9Dv30o7oEYosfXTw", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I have tried to like Mugshots.  Mugshots has just kinda underwhelmed me for the last time.  Who the hell spends 10 dollars at a coffee shop?  You're about to, if you want to pay with a credit card, which is a totally normal person thing to do.  The coffee isn't very good, and the 1 hour internet rule is just the antithesis of hospitality.  Come on.  2 stars for the yummy breakfast burrito.", "date": "2011-10-27 20:17:21", "user": {"name": "Alix", "review_count": 114, "yelping_since": "2009-04-02 00:19:25", "elite": "2009,2010,2011", "average_stars": 3.84, "fans": 8}}
{"review_id": "1c61ZIpWOuXQ2xYoNWmq4g", "user_id": "rF5Uhd7dl6Y0FHIiQjZomA", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "Excuse me, I need to rant for a bit:\nI think one of the main reasons people have bad experiences here is because they come expecting bad service, or they expect star treatment every time they go in because they feel they are a \"regular\". One of my favorite pastimes is to stand in line and watch people get angry because they don't get what they want. Pro-tip: you're probably not that special\n\nWhat people forget when they make a decision to skip Starbucks and hit up a local coffee shop is that they forfeit their rights to \"have it your way\" service. Small places like this have specific/original menus for reasons. As soon as one starts deviating from it, mistakes are just asking to be made. You're not eating at a Stephen Starr restaurant- you're getting a burrito and a coffee.\n\nAlso, tickets get lost, mixed up or even forgotten. I've sat many places and watch the same food I ordered get served out to people who placed their orders after me. It happens\n\nFor as much as I'm willing to stick my neck out for Mugshots, I will admit there have been many a times I've walked away unhappy with my order. But that's part of eating out- you're not guaranteed perfection every time. Maybe the kitchen messed up, maybe the produce for the week isn't that good, maybe suppliers have been switched. Who knows, but goodness knows you most likely don't.\n\nThe food here is pretty darn good, the coffee has gotten way better and the customer service, although shaky, is great if you can take the time out of your day to treat the person behind the counter like a human being. It may be false that you catch more flies with honey than with vinegar, but you certainly do catch more smiles.", "date": "2011-10-24 17:21:54", "user": {"name": "Johnny", "review_count": 4, "yelping_since": "2011-03-30 15:45:53", "elite": "", "average_stars": 4.25, "fans": 0}}
{"review_id": "uF4DAWD5LAGSm4KMVHzArQ", "user_id": "WZUtW6Og580zoixYuvEjKg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "As a new Fairmount resident, I have to say that I have only a few months of experience with Mugshots. There are definitely good and bad points to it, and the end result is \"hmm\".\n\n[FYI my new system goes from \"God No!\" to \"Niceeeeeee\"]\n\nI put it in the middle because I really expected great things. I had heard about it from the hipster word of mouth chain before I moved, and when I saw it for the first time I thought I might have found my coffee mecca. Unfortunately, the fact that it just seems like it should be incredible really rebounds on you when you find out it's not. \n\nThe Good:\n\n-Great decor/comfy chairs and couches\n- Really amazing location\n- Clever name\n- Hip(ster) clientele AND yuppie clientele both accommodated\n- Delicious Pastries\n\nThe Bad:\n\n- Disorganized - The coffee station is down behind the counter at the far end, and I walked around like an idiot (much to the staff's delight) until I figured it out. I seriously saw them laugh when I found it :/\n- The staff can be hot and cold. Some are nice enough while others are pretty bitchy/unconcerned with what their doing. Most exasperatingly, one guy there (red curly hair and beard) will have a 10 minute long discussion with me about the prison, and then when I come in the next day and ask for a water cup (after I bought an espresso from him 10 seconds earlier and was drinking it outside!) he tells me it's only for customers. I tell him I was just sitting outside with my espresso and he reluctantly gives me a cup. I walk outside and he walks behind me to check and see if I'm lying... Really? For water? What if I was lying? Who really cares?\n- The outside seating could be nicer/more comfortable. \n- Wi-Fi for 1 hour? That gives people the feeling that you're pushing them out. A good coffee shop is welcoming and friendly.\n\nThe Ugly\n\n- Really the only decent place to get coffee in Fairmount.", "date": "2011-10-20 20:13:44", "user": {"name": "Davis", "review_count": 12, "yelping_since": "2011-09-20 21:35:17", "elite": "", "average_stars": 3.0, "fans": 1}}
{"review_id": "g2M1DYgRTxD-pPpuY9qfew", "user_id": "upUEKIxErRnO8VPNfj-zNg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Mugshots and I had a falling out. Oh Mugshots, I used to love you so. Until I branched out and saw that there are other fish (er, coffee shops) in the pond (um, city). \n\nPositives: The food is great. Organic, fresh ingredients, and I love the vibe there. The staff is pretty nice. Smoothies are good. Coffee is good. I do like their loyalty cards that earn you a free coffee once every 10(?) coffee drinks. \n\nNegatives: If you sit for an hour (that's all the time you're allotted for internet), you go home smelling like stale coffee. My boyfriend calls it the \"Mugshots Smell.\" The food takes awhile, so don't expect to pop in for a quick bite. There aren't many outlets, so you either get a cold seat by the windows or hog a whole table to yourself.\n\nIt's extremely pretentious to restrict internet in an area like Fairmount where there are many people who would love to hang out in a coffee shop and do work. And the fact that it's the biggest establishment in the area means it would probably run a similar one out of business. But please, future coffee shop owners, try! We need a better alternative.\n\n*Note: Rybread on Fairmount is awesome but oh-so small!", "date": "2011-10-06 21:18:52", "user": {"name": "Emily", "review_count": 41, "yelping_since": "2011-02-23 14:35:11", "elite": "", "average_stars": 4.04, "fans": 1}}
{"review_id": "vEsW9ERjLbAMq5j7LUNhoA", "user_id": "PLKPHi0yI5coxi5yKBLkjg", "business_id": "fhoqmnw5sXzj91-7yBW0Kw", "stars": 1.0, "useful": 4, "funny": 1, "cool": 2, "text": "I've been saying I am going to write a review about this place for quite some time - usually after something so infuriating happens that I leave the shop shaking with anger and my boyfriend and I walk home muttering \"never again.\" However, I am the type that can drop transgressions easily and move on so by the time I take the 4 block trek home, I'm over it enough to not log onto Yelp.\n\nHowever, today was the last straw. \n\nThe overall reason for a one star review is the total lack of customer service in any capacity whatsoever. I have never once had an experience there related to customer/employee interaction that has EVER been more than a two at most. I'm going to go ahead and share all of these experiences. Maybe (but probably not) someone at Mugshots will care this time. \n\nToday: Brought all my school work and computers down to Mugshots to work on school work. There Wi-fi is accessible for 60 minutes only with purchase and with a code provided by the cashier (I am not even complaining about this fact but still, come one guys, free wi-fi is a little give for a lot of get in the coffee shop world. Your image could use a boost.). I also ordered an egg, tomato, guacamole, and cheese sandwich and an americano. Americano was fine. Sandwich was made with obviously old guac...it was brown, cold, and flavorless as avocados tend to become when refrigerated for too long. I was contemplating asking for a different sandwich but then I thought better of it because I would just be met with blank stares and don't care attitudes (those things are extremely commonplace with the staff). The first code I received for wi-fi access came up with \"promotional access denied.\" So I asked for assistance, was given another code, and that one did not work either. When I went back to the counter and said that it didn't work either the guy said he didn't know. He asked two of his co-workers about it and they said \"Last time it happened, we had to call the company.\" Then the three of them kinda stood there with blank stares (like I said, a common response). Then the guy said \"Well, how do I do that.\" One girl shrugged her shoulders and the other said \"Oh, I don't know I don't go into the office.\" More blank stares then the guy said to me, \"Sorry, I don't know what to do.\" What?! You DO know what to do, dude. Call the company and fix the problem. Obviously this has happened before as your co-workers pointed out and obviously the solution is to call the provider. However, none of them wanted to do it so I was told \"Too bad.\" Really, Mugshots? You know how to solve a problem but you don't do it because...you're lazy? You don't want to? It's not \"your\" job? What is it? This is a common theme throughout all of my negative experiences here. Disconnected, disinterested, too-cool-for-school employees who can't be bothered with simple customer service. \n\nA summary of other complaints:\n\n1. A few weeks ago I ordered an Americano. There were three people at the registers and one person in the kitchen area. I waited 18 minutes (I timed it on my phone) before I said anything. I said \"excuse me, is someone going to make my drink?\" Yes, I said it with a little bit of an attitude. The girl stared at me (blank stares!) then said, \"Yea, give me am minute\" and went back to the registers where two other people were (there are only two registers so...) Two minutes later she went to the espresso machine clearly annoyed and sloppily made my drink. It was filled all the way to the top making it difficult to carry to the condiment stand. I felt it was done on purpose. My evidence: the smirk and \"here you go\" delivered with an attitude when she handed me the drink.\n\n2. Last Saturday morning (an insanely busy time at Mugshots) I was waiting in line along with 16 other customers (I counted because I wanted to write a Yelp review and be accurate) for my morning coffee. Some man walks in the door, cuts to an open register before the woman waiting in line gets to it. The woman seemed confused and said she was too embarrassed to say anything so I leaned over and said to the cashier, \"That man just cut in front of everyone.\" The cashier look flustered, said \"oh, I just got here\" and continued to help the man instead of asking him to wait in line. Yea, no. \n\n3. The food and drink are over-priced for the quality of customer service. I understand that Mugshots supports local and sustainable farms and I truly appreciate that and understand that that means higher prices. I wouldn't have a problem paying them if I was treated like the PAYING customer that I am.\n\n\nSo, the reason why I keep going here is two-fold. One, I live 4 blocks away and I will put up with a lot for convenience and non-Starbucks coffee. Two, I'm somehow convinced it will get better. I, for some reason, believe management will catch on to the arrogant, disrespectful ignorant way it's staff operates and make changes. Meh, I'm done Mugshots.", "date": "2011-09-30 13:52:49", "user": {"name": "Cait", "review_count": 7, "yelping_since": "2010-04-28 22:52:07", "elite": "", "average_stars": 4.0, "fans": 1}}
