{"business_id": "Ddupo1zhmoct1yPFbF6ipQ", "name": "Via Napoli", "address": "2500 Welsh Rd", "city": "Philadelphia", "state": "PA", "postal_code": "19152", "latitude": 40.0731939, "longitude": -75.0352627, "stars": 3.5, "review_count": 75, "is_open": 0, "attributes": {"RestaurantsPriceRange2": "2", "HasTV": "True", "RestaurantsAttire": "u'casual'", "NoiseLevel": "u'average'", "OutdoorSeating": "False", "Ambience": "{'romantic': False, 'intimate': False, 'touristy': False, 'hipster': False, 'divey': False, 'classy': False, 'trendy': False, 'upscale': False, 'casual': True}", "GoodForKids": "True", "BusinessAcceptsCreditCards": "True", "RestaurantsDelivery": "False", "RestaurantsGoodForGroups": "True", "BusinessParking": "{'garage': False, 'street': False, 'validated': False, 'lot': True, 'valet': False}", "Alcohol": "u'full_bar'", "RestaurantsTakeOut": "True", "RestaurantsReservations": "True", "Caters": "True", "BikeParking": "True", "WiFi": "u'free'"}, "categories": "Restaurants, Italian, Pizza", "hours": {"Monday": "11:0-22:0", "Tuesday": "11:0-22:0", "Wednesday": "11:0-22:0", "Thursday": "11:0-22:0", "Friday": "11:0-23:0", "Saturday": "12:0-23:0", "Sunday": "12:0-22:0"}, "category_list": ["Restaurants", "Italian", "Pizza"], "stratification_tag": "Pizza"}
{"review_id": "2T8rVuOlCEDxucA6LQCMyg", "user_id": "IjeFvceHIiCn_NdEfyrJDg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really like this place. The food is great and I like the atmosphere. My husband and I like to come here to have a relaxing meal and we often bring our out-of-town guests here.", "date": "2016-06-09 15:32:17", "user": {"name": "Tatyana", "review_count": 18, "yelping_since": "2012-10-08 21:04:26", "elite": "", "average_stars": 4.38, "fans": 1}}
{"review_id": "NnL0AffLkq6H_Qzvfe-ReQ", "user_id": "S0Mi7jPIejcvX3EW1qbyAw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was born in Naples, and I can tell you this is about as close to authentic Italian cuisine as I've come across in Philadelphia. A little more salt in the sauces than we might use at home but that is to be expected in restaurants. Excellent food. Try their Napoli salad....fantastic!", "date": "2016-05-21 16:02:31", "user": {"name": "D F", "review_count": 35, "yelping_since": "2015-04-19 14:55:43", "elite": "", "average_stars": 4.69, "fans": 1}}
{"review_id": "jNWjB48onv77y0RHzmvJzA", "user_id": "3zZQUPy10KDUu5-j_kk-wQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Felicia reviewed this place 3 weeks before this update and said the mussels tasted like dirty diapers...I JUST HAD to ask ... How are you familiar with the taste of dirty diapers???\nThe place has permanently closed.", "date": "2016-05-20 22:39:17", "user": {"name": "Jeff", "review_count": 40, "yelping_since": "2009-02-27 14:00:00", "elite": "", "average_stars": 2.68, "fans": 1}}
{"review_id": "JFtV8Xl76CBUeyM2UmHqLA", "user_id": "6c_a4XxduJka98QvMIM8Tg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 2, "funny": 1, "cool": 0, "text": "driving from burlington county to philly to meet my family for mother's day dinner. wtf?? closed on mother's day due to an emergency --but -- restaurant management fails to notify all these large parties who had reservations! our party of 8 had to scramble to find alternatives!  fail\n\nupdate: no apologies from the restaurant when i called a few days later to let them know how unhappy i was about *not* being notified about their closure. \n\nstay away!", "date": "2016-05-08 22:24:21", "user": {"name": "Steve", "review_count": 187, "yelping_since": "2012-03-23 23:59:50", "elite": "2015,2016,2017", "average_stars": 3.43, "fans": 2}}
{"review_id": "6p2fqT1gKHVY_gc1vz6tSQ", "user_id": "p-3grx8aw9eowG36jkouWA", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "I am very disappointed with Via Napoli lately. The mussels were not fresh at all (they had that dirty-diaper smell and taste), the eggplant parm was not as good as it used to be, and the waiter brought a wine that was not what my stepdad ordered. Ever since they made changes a year or two ago (you now have to pay extra for the bubble bread, they give you less food, they replaced the salmon with tilapia in the Scoglio), the meals have just not been as good. It's a shame because Via Napoli was great when they first opened (when they first switched from Italian Bistro to Via Napoli) and they were good for a couple of years, and then they really went downhill. I think they became complacent.", "date": "2016-04-30 02:17:07", "user": {"name": "Felicia", "review_count": 428, "yelping_since": "2009-08-26 01:36:41", "elite": "2015,2016,2017,2018,2019,20,20,2021", "average_stars": 4.41, "fans": 27}}
{"review_id": "1BApyBmrVMvVjV1y_gENLQ", "user_id": "1Fjv_5gyA3w_lFolXU5Txg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a gem in the northeast. Don't go downtown for fresh, delicious, above the ordinary Italian until you come here!\nIt was quiet because we came on a weeknight.  Check out the pictures. Plenty on the menu for you to find your meal.  House made bread like fluffy pizza dough, great! Recommended!", "date": "2016-04-06 01:46:52", "user": {"name": "Andrea", "review_count": 8, "yelping_since": "2015-02-21 03:40:18", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "uZgX2W-0XXYLYlSAERG5TA", "user_id": "T5BoEXbJrp0vs38JmS8LfQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is mediocre at best. Food is average and overpriced. The portions are small (4 pieces of shrimp in the shrimp pasta).", "date": "2016-03-19 20:20:47", "user": {"name": "István", "review_count": 14, "yelping_since": "2015-01-24 14:19:55", "elite": "", "average_stars": 2.79, "fans": 2}}
{"review_id": "6DKGWJAviXo9Q9k7JSpV5w", "user_id": "0LLg0OW7ssvmMIR3efquqw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 1, "funny": 1, "cool": 1, "text": "I've been here as few times. The only thing I enjoyed (sadly) was the warm bread while waiting for our food!", "date": "2016-02-10 20:29:38", "user": {"name": "Sara", "review_count": 232, "yelping_since": "2015-02-15 18:46:28", "elite": "2016", "average_stars": 3.77, "fans": 7}}
{"review_id": "PYYkg2T5Oh_r-5B4HxT1IA", "user_id": "h1DiklhUxONi9yQVbF9vRw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "The worst calamari I have ever had in my life, all salty, I love salty but when it is like all salt and you can't taste anything else it's bad , and when the waitress lets you know that that the way it is , and you ask to leave before your , entrée  have arrived, got to say not your kind of place, so I suggest you if this place is no good, but if you do show up do not bring the salt shaker with you", "date": "2016-02-07 02:15:33", "user": {"name": "Curtis", "review_count": 18, "yelping_since": "2015-02-15 14:52:12", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "enUkevQ263cYDM56c9IHyQ", "user_id": "0vidAomh9zmoKYBuueWkXw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Terrible. We used to go here for lunch a lot. Pizza, pasta, fresh bread. Cheap glasses of wine.. Just went here for dinner. We ordered the bread which didn't puff up as promised and was covered in Parmesan cheese. It was barely edible. While my husband still ate his soup, the waitress brought over our entrees. No timing for us to enjoy our courses. I had the shrimp scampi and he had the puntanesca. The shrimp was so over cooked it was rubbery.. The sauce on my scampi was nothing more then olive oil. Absolutely tasteless and swimming in oil. I couldn't eat it. My husbands pasta was visually appealing but eating it you got a mouth full of anchovy paste. Our waitress never even asked how our dinner was. She saw my plate sitting there in front of me untouched. Never even acknowledged, all she did was pack it up for us to go. \nNever again.", "date": "2016-01-10 02:42:09", "user": {"name": "Yana", "review_count": 25, "yelping_since": "2011-10-15 12:54:43", "elite": "", "average_stars": 3.3, "fans": 0}}
{"review_id": "BRdiYNwWUjlfMGeE-NZNAA", "user_id": "TRNA5LNrm8AueJNzx8vKiw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My family has a wonderful time every time we come here. The food is fantastic for the price and you get a good portion. The service is spectacular and usually on point. Everything is fresh and the focaccia bread is simply delicious. Definitely a favorite. A little place that's never too crowded, and always just perfect. Don't go to the Olive Garden, come here instead.", "date": "2015-12-20 00:03:05", "user": {"name": "Michelle", "review_count": 11, "yelping_since": "2015-03-14 22:57:13", "elite": "", "average_stars": 4.5, "fans": 1}}
{"review_id": "9wgpJmeNLYRpApAr7AzF8Q", "user_id": "kPcrzx-F6bncD-SpdcT-_A", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very mediocre Italian food. I ordered the eggplant rottilini - the eggplant itself with the ricotta and spinach was very good, but the sauce was flavorless and everything was little smothered in mozzarella cheese. I mean, I like my cheese as much as the next person, but this was ridiculous! My pasta-loving boyfriend ordered the bolognese rigatoni, and he had the same complaints about the sauce and cheese. He came into the restaurant starving, and couldn't even finish his plate because he disliked it so much. I doubt we'll ever be back. Even Italian food at a diner would've been better than this.", "date": "2015-11-23 02:52:51", "user": {"name": "Amanda", "review_count": 39, "yelping_since": "2014-06-12 17:15:54", "elite": "", "average_stars": 4.44, "fans": 1}}
{"review_id": "jxvSo5E9WFnxaUzj8q2fOw", "user_id": "1_CiKc7t1WqbdSV6ivAczw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Good solid Italian food. Despite what other reviewers said,  we didn't find the menu to be limited. They had a nice rounded variety. The decor and atmosphere was very nice. The service was a bit slow but bearable. Great bread. The antipasti was excellent, especially the roasted red peppers. The chicken parm was very good with tender chicken, crispy breading and a good sauce.  With a salad and app or was enough to share. Ceasar salad was fresh and tasty. Our friends shrimp scampi looked great but had a slightly spicy taste which while good, was unexpected. All in all, we will definitely go back.", "date": "2015-11-21 22:42:43", "user": {"name": "Paul", "review_count": 26, "yelping_since": "2012-09-27 04:27:15", "elite": "", "average_stars": 4.35, "fans": 0}}
{"review_id": "pYN0E0df6R2DcdSGh8Wvrg", "user_id": "HAZShChw0VyLC63gbpkdaw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Over priced pizzeria. Almost everything I ordered was made from Frozen. Pre ordered precooked fresh from a card board box. There fried mozzarella just frozen mozzarella sticks I could of got from a pizzeria for half the price. Same thing goes for there chicken Parmesan frozen pre breaded chicken.  And there sauce come strait from a jar. Service was nice food sucks.", "date": "2015-10-25 18:48:15", "user": {"name": "Ruben", "review_count": 13, "yelping_since": "2012-11-29 01:27:47", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "rCC96fDcnK-_5KaLicdmPQ", "user_id": "rN3qmqGClupjvinGuwYVLA", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 1, "funny": 2, "cool": 2, "text": "Food is wonderful.. calamari were a big hit with the kids. Tagliere plate was a nice especially the fennel salami. Our main selections  were... branzino aqua pazza and cotolette with arugola salad which were both expertly prepared. Kim our server was excellent. Going on a web search for italian in the area we hit a homerun. Great job!!!!!", "date": "2015-08-19 01:31:01", "user": {"name": "Max", "review_count": 9, "yelping_since": "2014-02-10 07:52:38", "elite": "", "average_stars": 3.56, "fans": 1}}
{"review_id": "gQaJaPtRZpAIdx6z1TpkFA", "user_id": "SGvsin5Fw5tk3F0mx_QEDA", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Honestly nothing to rave about, the pizza was okay. I think places in philly need to travel to other states and learn how to make a nice pizza sauce. The sauce didn't have that amazingly fresh tomato taste. It was definitely fresh, just not as good as I wanted it to be. My girlfriend had linguine with chicken, which she said she enjoyed very much. \n\nIf you are very hungry and want something, the food is edible... But it may not fulfill your Italian desires.", "date": "2015-07-27 15:17:10", "user": {"name": "Mike", "review_count": 154, "yelping_since": "2013-06-10 18:41:53", "elite": "", "average_stars": 4.32, "fans": 9}}
{"review_id": "ZFqgGRLXcN5F8NQ1kWYZUw", "user_id": "6ZNnGHBEk2ZZctdC0fX8vw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "It the name of this place Mia Napoli or via Napoli? One will never know, as it was represented equally all over the restaurant as both. My review really is a 3.5. Our waitress was a little rude. Didn't offer a refill on a soda, but did on wine. The bread was pretty good. I'd eat it again. I just wish it came with oil instead of a butter. As for main dishes, pizza I'd ok. We ordered 2 pizzas: the mushroom with added ricotta and a 4 cheese pizza. Both were over cooked and fair at best. We also ordered the seafood fra diablo. It was perfectly spicy and very good. Also ordered was the chicken Milanese. It was just ok. It came with a lemonchello and arugula salad on top. That was delicious! The chicken was fried( not mentioned on the menu) which was a huge disappointment. Also, there was no side to the dish. Overall, just ok. I might be back.", "date": "2015-07-12 01:31:44", "user": {"name": "Kimberly", "review_count": 455, "yelping_since": "2013-04-06 23:54:09", "elite": "2013,2014,2015,2016,2017,2018,2019", "average_stars": 3.52, "fans": 41}}
{"review_id": "DfoLi8ebB5CKiWTENCwvqw", "user_id": "TBVwAvxz70PSi4Y3sOixWg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The atmosphere and service here made a great impression as soon as we walked in the door. Then it just got better. The oven bread was delicious. So flavorful! I came here with my family and everyone enjoyed their entrees. I highly recommend the Italia pizza. But the dessert was the best finale. The tiramisu was perfect.", "date": "2015-07-11 04:00:38", "user": {"name": "Jennifer", "review_count": 100, "yelping_since": "2010-12-14 20:34:42", "elite": "2015,2016,2017", "average_stars": 4.51, "fans": 7}}
{"review_id": "lSNY2N1NsrIXoDObifwPkw", "user_id": "2FJM0JF3Yo3DMQtU4-fgMg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice atmosphere... Caesar Salad, very good - attractive presentation.  Margarita pizza, not very good.  Tasted like jarred sauce with a few pieces of basil thrown in top - nothing special.  But the main reason for the two stars was the $1.98 sharing charge when we did not ask for anything to be divided in kitchen nor did we ask for additional plates or silverware.  Will not patronize any restaurant that is so willing to gouge their customers with sharing charge. Leaves a bad taste that overwhelms the good salad.", "date": "2015-06-14 18:24:07", "user": {"name": "Diane", "review_count": 8, "yelping_since": "2011-06-29 11:38:23", "elite": "", "average_stars": 3.13, "fans": 0}}
{"review_id": "PRg0rAHHrgUthtdNKC2p2Q", "user_id": "Rte5H82-lElDqWlNizt1ew", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Disppointing. I was hoping for better.\nOrdered salmon with string beans and roasted potatoes. The string beans were the best thing on the plate. I could tell the salmon was frozen when they cooked it. It just had that texture. Over priced for what I had gotten. Bathroom was absolutely gross. Im sorry but I will not return.", "date": "2015-04-15 01:57:02", "user": {"name": "Erin", "review_count": 31, "yelping_since": "2014-08-20 14:31:35", "elite": "", "average_stars": 3.76, "fans": 0}}
{"review_id": "3wzg_w4HCAQrUdZWvHp7qw", "user_id": "4Aikd28ZO0U3KwhEKwijNQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I moved here from Michigan 4 years ago and this place was the place to go. I went here almost every month for \"date night\" with my wife before we would go to movies and it was the best Italian food I had ever had. Nothing in Michigan came close to the authentic Italian food that they served. When relatives were in town from Michigan we took them here and they agreed, this place was amazing. This place was the best until they changed the menu. They used to serve fresh bread from their oven that was literally worth the trip itself, now they serve bread that you can pick up at shoprite. The menu has been downsized to such a miniscule variety of the same themed food that its redundant to even try new things here. It seems like the menu has been downsized to reduce costs but from the reviews here it seems like it has also reduced appeal. They had a \"build your own\" pasta menu that had more variety than their entire menu does now. The portions are smaller now, there are fewer choices now, the price has gone up, but the service remains decent. The staff is friendly but they went from serving \"grandma's house\" to chef boyarde. Go here if you have never had decent Italian food and you will have a somewhat pleasant experience. Don't go here if you went here 2 years ago and loved it, it will ruin your opinion of this place. I'm giving it 2 stars for the memories and the service (after all I have been here literally about 30 times). My wife grew up in philly, she can make me the food that they now serve here. If your wife can't i recommend a frozen dinner from the grocery store, it is only a slight downgrade from the food they serve, and could probably match it's caliber with salt.", "date": "2015-03-19 00:20:28", "user": {"name": "Alex", "review_count": 9, "yelping_since": "2015-03-19 00:01:00", "elite": "", "average_stars": 3.9, "fans": 1}}
{"review_id": "GouuqpSKl1qYik_fTYCBYA", "user_id": "vXJ7qdNJY4Rjv0zcKkdKYg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "we came here after my college graduation with a party of 8 people and it did not disappoint! Our servers were very nice and accommodating and the entree sizes were huge, I had 3 dinners out of it! Finding the bathroom was a bit confusing, its downstairs and theres a fountain it does not look like another level. I live literally 3 minutes away from here and will return again!", "date": "2015-03-02 04:13:43", "user": {"name": "Michele", "review_count": 165, "yelping_since": "2013-08-19 21:31:07", "elite": "", "average_stars": 3.62, "fans": 5}}
{"review_id": "dOqf4HIupwSNgvgbVsMX6w", "user_id": "5jKScvMqxW_rzd0D8xgX1A", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for a quick lunch with my parents today. Our server was really great, friendly and informative.  She knew her wines, and helped me pick a nice red wine that I have never tried before.   I ordered the veal with wild mushrooms... it was juicy, flavorful and delicious. My mom ordered crab cakes and they were fried, and not the best . My dad had some kind of sea food pasta and it was good.   I would of liked this spot more it more if it was a byob.  For northeast Philly location, it can really get pricy.  If im in the area, I would definitely come by here again.", "date": "2015-02-14 22:50:04", "user": {"name": "Mike", "review_count": 271, "yelping_since": "2011-06-23 20:30:28", "elite": "2014,2015,2016,2017", "average_stars": 4.29, "fans": 9}}
{"review_id": "RqJx9ma9kpkmAKl3HHE_4w", "user_id": "LwuHCmFSeFhCGeschjwmnQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ordered dinner from here recently. I wasn't really a fan of my meal, but I was definitely very happy with the service. They labeled everything and made it all nice and neat and individually packaged so it was easy to distinguish what was what, which was GREATLY APPRECIATED.\n\nAs far as the food, I would say I probably wouldn't order it again. I got the spinaci insalata ..... spinach salad with chicken and bacon and a bacon dressing, candied walnuts, and more...\n\nThe combination of savory and sweet wasn't really appealing to me, but it normally isnt so I guess I wasn't surprised. I just really didn't like that dressing!", "date": "2015-02-08 02:17:04", "user": {"name": "Ancy", "review_count": 205, "yelping_since": "2014-12-26 02:10:05", "elite": "2015,2016,2017,2018", "average_stars": 3.84, "fans": 26}}
{"review_id": "Mcsw1WahulnETuZ001HoUw", "user_id": "BhvkI9Ft6PHNwU-6CuPc9w", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a big fan of Italian restaurants that aren't afraid to spice up their menu. They have all the traditional Italian favorites but also a variety of other choices. Pizza was great. Caesar salad was on point. Staff was extremely friendly and service was great.", "date": "2014-12-31 06:06:54", "user": {"name": "Bobby", "review_count": 173, "yelping_since": "2009-11-05 16:33:47", "elite": "", "average_stars": 3.48, "fans": 2}}
{"review_id": "-XI3raa89FTEZfwxZv3IFw", "user_id": "uKrNTV1KTSANn_uwoSXg6w", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I was here a few days ago, I am a foodie and as such look for very unique dishes, but on this outing I was tired from Christmas shopping and to my surprise the level of service was to notch. The seafood manicotti was so flavorful along with fried calimari....this will become my go to spot a quick dinner, great job", "date": "2014-12-26 21:05:08", "user": {"name": "Larry", "review_count": 30, "yelping_since": "2014-03-08 20:18:29", "elite": "", "average_stars": 3.9, "fans": 0}}
{"review_id": "xyyKQNLb9JwDwYEwZYtL3g", "user_id": "2mpb8K40Vn299iw6RJFwSQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went there with a big party today for my parents anniversary and everything was wonderful!!  They even allowed us to bring our own cake and served it for us.  Thank you so much!!", "date": "2014-10-12 23:18:25", "user": {"name": "Sheri", "review_count": 8, "yelping_since": "2014-05-26 22:45:13", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "HCjH6OEOGLZb49MfTlGkHA", "user_id": "3zZQUPy10KDUu5-j_kk-wQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We dined here tonight and were very happy. Our waitress (Xhejsa) was amazing. I ordered an off menu item and they happily obliged. Our drinks were never empty and we were treated very well from checkin to our departure. Gnocci is fantastic...I had it with vodka sauce and shrimps!! \nWe really enjoyed ourselves!", "date": "2014-07-21 00:58:02", "user": {"name": "Jeff", "review_count": 40, "yelping_since": "2009-02-27 14:00:00", "elite": "", "average_stars": 2.68, "fans": 1}}
{"review_id": "GGq8i_4hZjaDWcttYejCqw", "user_id": "tOw95b7DQlqYIo3PJPmLbQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Went here recently and my husband and I ordered the caesar salad and salmon. My salad had a hair in it. So I asked the waitress to bring me a new one. She came back after a half hour with the same salad with just more salad on top of my old one. How did I know, because the salad on the bottom was soggy and they put the same piece of salmon right on top. (Idk why it took them that long to chop up more lettuce. It's not like they made me a new piece of fish) I asked her if they can make me a new plate and she asked if I wanted something different. No, I wanted the same darn thing. By the time I got my salad my husband was done, I was so agitated and and wanted to leave. We got no apology or anything for the lack of service, so we just paid and left. We won't be going back.", "date": "2014-07-15 20:53:14", "user": {"name": "Sam", "review_count": 35, "yelping_since": "2013-08-10 20:09:56", "elite": "", "average_stars": 3.21, "fans": 1}}
{"review_id": "l1Lnk2m3N7ZZP7ks6vhIng", "user_id": "NfQOO5jBV8MUGu5IhwWHgw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Sorry bad reviewers, I love it here. Every visit the food has been fresh and delicious ( my personal favorite is the create your own pasta, ziti with vodka sauce and lump crab is phenomenal) the wait staff is always attentive and friendly. Bread is awesome and the wine is really inexpensive. I really don't have a bad thing to say about it. If you are heading down the Blvd and have a pasta or parm craving, head here! NOT the Olive Garden, us \"real\" Italians find that place offensive ;)", "date": "2014-06-27 13:02:58", "user": {"name": "Ketchup Love", "review_count": 86, "yelping_since": "2011-02-10 19:37:36", "elite": "", "average_stars": 3.04, "fans": 0}}
{"review_id": "TATnO3_Gng9VWTBsav3U5g", "user_id": "f3x6dINZolXO3OVbjKhiAw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We ordered take out here while traveling and all in all it was good. My better half had the sausage with broccoli rabe and a salad with shrimp. I had grilled vegetables and a salad with shrimp also. The real test would have been to try their pizza and pasta but we wanted something light.", "date": "2014-03-20 19:04:58", "user": {"name": "Dana", "review_count": 235, "yelping_since": "2012-01-10 23:11:04", "elite": "", "average_stars": 3.26, "fans": 2}}
{"review_id": "BPPtzj4TmED0LkFJ3ooprQ", "user_id": "X0EXWAZhImMwwM4FrIUxxw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "Was a great restaurant but came out with a new menu and no more baked pizza dough bread and no more chicken pollo. Very disappointed with new menu for the chicken pollo was season so well with the best roasted potatoes ever and now is off the menu", "date": "2014-03-12 20:35:00", "user": {"name": "Joe", "review_count": 25, "yelping_since": "2013-07-05 12:29:36", "elite": "", "average_stars": 3.65, "fans": 2}}
{"review_id": "kCrUnq894F0vNLQWlCLLkg", "user_id": "hMHhCL7WjbFrhul7TSGPvQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place is really close to my house and I often come here when I don't feel like cooking. I came here recently and saw that they changed there menu but most of the things I love are still on there. The muscle with red sauce is so good. I love bread and there bread is amazing!", "date": "2014-03-04 17:04:36", "user": {"name": "Janice", "review_count": 6, "yelping_since": "2014-03-04 15:58:21", "elite": "", "average_stars": 4.5, "fans": 0}}
{"review_id": "dF_gENDVkL_cxdgNlSYXNQ", "user_id": "qZ3svN7CTvYJOKrqnhcDHQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "I remember the old place from when I was younger, and it's been a huge improvement since! \n\nI love their pizzas and I've been here twice. The bread is absolutely delicious and I find myself eating more of it than I thought I could. It's got a lovely atmosphere--cute, authentic looking decor, Italian music that adds to the atmosphere and not to mention some great, quality food. \n\nThe service is pretty good because I haven't really seen this place when it's been very crowded. Just thinking about this place makes me crave a pizza from here! \n\nNice work.", "date": "2014-03-04 08:25:52", "user": {"name": "Shayla", "review_count": 9, "yelping_since": "2014-03-04 07:29:44", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "NAo64g900yxhLQVE9-zOjw", "user_id": "X0EXWAZhImMwwM4FrIUxxw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Please bring back the artisan baked bread for do not like this new bread and especially the butter u serve with it", "date": "2014-01-25 22:15:18", "user": {"name": "Joe", "review_count": 25, "yelping_since": "2013-07-05 12:29:36", "elite": "", "average_stars": 3.65, "fans": 2}}
{"review_id": "Yclha1yGk060xX4_emsZbg", "user_id": "4bMz5b10ecucm8iAGlFGog", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 4, "funny": 0, "cool": 0, "text": "Like the review below, my boyfriend and I have been coming to this place for years and just went back tonight for a disappointing dinner. We kept coming back for their amazing brick oven bread with parmesan and olive oil they used to serve complimentary-- but they replaced this with a cold three slices of stale sourdough bread served with dinner and frozen butter instead. It also seemed like our waitress was uncomfortably pushing extras or add-ons like sausage or soup/salad, which aren't included in the meal, when we were ordering.\n\nThe portion of gnocchi I got was much smaller than it used to be (almost half the size!). The arrabbiata sauce wasn't even listed on the menu anymore, and when the dish came out, my gnocchi were dense and the sauce was overwhelmingly oily and not spicy at all. \n\nWhen we looked online, we saw the old menu was still posted, and they had RAISED THE PRICES for many items-- my gnocchi used to be $10.95 but is now $13.50 for half the portion. The pizza my boyfriend got was also no longer made with fresh mozzarella. While the service is okay, they've definitely lost our return business. It's very apparent that they're trying to cut costs or save money, but in the process will probably lose loyal customers. There's just nothing special about this place anymore. It's just another no-personality Italian restaurant in a strip mall.", "date": "2014-01-13 00:11:20", "user": {"name": "Erica", "review_count": 18, "yelping_since": "2013-12-21 05:59:40", "elite": "", "average_stars": 3.21, "fans": 0}}
{"review_id": "oJwWut-_ui6FY3FvH88xUw", "user_id": "QqETYDUfjIHAY2-XKIsAZw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great new menu! the service and food was great as always. Great place to meet for business or pleasure.", "date": "2014-01-12 22:29:40", "user": {"name": "Joe", "review_count": 1, "yelping_since": "2012-10-07 01:17:34", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "ynNg_vazieqkE3njnRxwVQ", "user_id": "XPWiUNYQVOAlc255F5zVQw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 7, "funny": 0, "cool": 0, "text": "I've been here several times before and they have always been good. Not amazing but decent...that was until our most recent visit last night. First off, the service is really fantastic. Everyone is super friendly and courteous so I really can't complain. But as for the food, I was really disappointed. \n\nTheir menu seems to have been updated recently and the selection is much smaller. They used to serve fresh pizza dough cooked from their fire/coal oven as the \"bread basket\" but last night they only gave us a basket of sliced bread. We ordered a calamari appetizer and the portion was definitely smaller than before. Luckily, the calamari was still pretty good.  As for the main courses, our table ordered the gnocchi, lasagna, braciole, and shrimp scampi. The braciole was lukewarm at best, and the meat sauce was bland. The gnocchi was OK with butter sage cream sauce, but the lasagna and shrimp scampi were both bland and unexciting.  I'm not sure if they have changed owners or kitchen staff with the new menu, but I was really unimpressed with the food. I don't think I can go back for a while if at all.", "date": "2014-01-10 12:24:14", "user": {"name": "Jennifer", "review_count": 276, "yelping_since": "2009-07-24 17:52:49", "elite": "2010,2011,2012,2013,2014,2015,2016,2017,2018", "average_stars": 3.78, "fans": 26}}
{"review_id": "Jn0qHjLcJPQU3E8WwRnlhg", "user_id": "m9OA7rHfw_SK21WXwwzLmA", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 2, "funny": 3, "cool": 1, "text": "I must be an idiot, I got my arm twisted into going, So I finally caved and tried to go with an open mind. To put it bluntly, the place might have gotten worse than before. The food is still salty and chemically tasting, The waitress is a white young blonde girl who was such a sweetheart.  Poor thing, you could do so much better than this place.   Portions are about a quarter of the if you were there before the menu change.\n \nThis is a darn shame what they did to this place.\n\nNext time I hurt someone's feelings if they insis on going here again.  But I am confident the folks I went with won't come back.  It was so funny to hear the manager agree with my pal, Manager says the food is supposed to this way, My pal says so it supposed to taste awful, The manager says yes. That was the only redeeming thing about the event, finally some honesty", "date": "2014-01-06 21:52:11", "user": {"name": "Michael", "review_count": 7, "yelping_since": "2013-11-01 23:53:26", "elite": "", "average_stars": 1.0, "fans": 1}}
{"review_id": "SFys5WuaqCRHWS3-zariwg", "user_id": "m9OA7rHfw_SK21WXwwzLmA", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "(This just my experience and opinion)\nTo save time reading the full review, OVER PRICED GARBAGE. \nThe quality of the food here has dropped to VILE. This place WAS great, now its just plain terrible. IF you want a VERY DISAPPOINTING CULINARY experience, you want to come here.  The only thing that was not bad was the DIET COKE we had. \nThe waitress was rude and obnoxious. The Manager was all to quick to try and pick a fight.  The one thing we all agreed on is WE WILL NEVER RETURN HERE AGAIN...THIS WAS OUR FAVORITE PLACE TO COME. Note it is the past tense.\n\nThe new menu and new recipes are terrible. Everything is excessively salty or has that out of the jar chemical taste. \n\nThis was a better than average place, but with the new menu/manager/owner the place is still pretty inside, but everything tastes of cutting costs.\n\nHere are the reviews from us\n\nThey previously served a fresh out of the oven bread with olive oil and parm cheese , it is now a COLD STALE BLAND probably mass produced , dare I call it bread that are now half slices.\n\nHere are a couple reviews from us of the main courses we had.\n\nThe \"grandma's house\"\nThe pasta was server in a puddle of water.\nThe big homemade meatball has been replaced with 2 little ones That taste like is came out of a bag frozen ones. The sausage was boiled then grilled (YUCK!)\nThe escarole was replaced with poorly cooked broccoli rabe.\n\nThe gnocchi was GRITTY like SAND.\n\nBoth Veal Parm that were ordered were excessively over cooked.\nInstead of baked cheese, a couple of cold cut slices were slapped on top with a splash of sauce, just like diner does, NOT LIKE FINE ITALIAN DINING As the store front signage promises.\n\nThe Veal tortellini was not good enough to feed to the dog.\nIt was so salty, it was disgusting. and not even close to what\ndescribed in the menu.\n\nThe \"baked ziti\" was more like boiled ziti slopped up in some sauce with a sprig on top. This seems to be the new theme here.\n\nWe skipped Dessert and Coffee to go somewhere else.\nWhen a meal experience is this awful, and the personnel\ncare so little to make it right, you have to know to cut your \nlosses and move on. And if they screwed this much up, \nthe rest will be two.\n\nThe pictures look nothing like what you will get now. They should be removed \n\nThe changes are just more then the menu, its the owners obviously do not care and are all about profit....Send out the SLOP, most won't complain mentality.\nThe one thing we all agree on is none of would even bring any of our EX's here, we just aren't cruel", "date": "2013-12-29 01:10:18", "user": {"name": "Michael", "review_count": 7, "yelping_since": "2013-11-01 23:53:26", "elite": "", "average_stars": 1.0, "fans": 1}}
{"review_id": "w_VzPsd6HTRMJWGwymA0Ug", "user_id": "X0EXWAZhImMwwM4FrIUxxw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "They stop serving the hot bread out of the oven and changed the menu but still great food", "date": "2013-12-28 22:41:57", "user": {"name": "Joe", "review_count": 25, "yelping_since": "2013-07-05 12:29:36", "elite": "", "average_stars": 3.65, "fans": 2}}
{"review_id": "w8UF_19tTI8j9aSfC2Bmqg", "user_id": "wUTjHpPAs6EWFZtMfEQUiw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I had been wanting to go here since I am a big fan of their other two restaurants.\n\nThe service was great, waitress was prompt, friendly, took our order, etc.  Food wasn't anything special, typical neighborhood restaurant.  The Muscles were great, similar to their other two restaurants.  The meal itself was good, but no where as good as the restaurant in Trevose or Cherry Hill.\n\nNo complaints, ok place to stop for a quick bite.", "date": "2013-12-12 22:35:08", "user": {"name": "Steve", "review_count": 372, "yelping_since": "2013-09-09 15:53:04", "elite": "", "average_stars": 4.08, "fans": 4}}
{"review_id": "jDw7Sk84DXlkOMsVnJVLDA", "user_id": "jaSAVvYIEPmy93n2s2nSZg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great service. One of the staff brought the food to us in our car while it was snowing for take out!! Other than that, the pasta with ricotta meatballs were good. Spicy tomato sauce wasn't all that spicy. No complaints.", "date": "2013-12-08 18:23:56", "user": {"name": "Intan", "review_count": 7, "yelping_since": "2013-07-26 23:55:56", "elite": "", "average_stars": 3.29, "fans": 0}}
{"review_id": "-NoH2nAChS7xPP8cMfJ7yw", "user_id": "X0EXWAZhImMwwM4FrIUxxw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very disappointed. Been coming here since they open and the portion I received tonight of the Grandmas house was 1/3 what I used to get.  great food but not much", "date": "2013-11-16 22:55:52", "user": {"name": "Joe", "review_count": 25, "yelping_since": "2013-07-05 12:29:36", "elite": "", "average_stars": 3.65, "fans": 2}}
{"review_id": "o-vDJ5y9E1r8mmWDg95WPA", "user_id": "flADKCjpuH9YpP-lxm7nPw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely love this place. food is delicious. Staff is courteous & friendly. Wood fired brick oven pizza great as an appetizer. Enough for 3 of us. My favorite item is the steak marsala with mushrooms. It melts in your mouth. I've tried other items too but that is the best. Coming from family where my grandparents and parents came from Italy & I am a picky eater. Don't waste your money or anyone else's money going anywhere else. Trust me. You will like it. Meatballs are delightful.", "date": "2013-11-11 05:13:01", "user": {"name": "Maria", "review_count": 13, "yelping_since": "2013-11-10 14:52:01", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "W3FJgtygJ3l9-njupBDs1w", "user_id": "CXldbTNwK0r5buwL2m4Mjw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for a family dinner or alone night w spouse. Wine is amazing, spaghetti and meatball dish is amazing along w their pizza.  Bathroom in a terrible location which is why I gave 3 stars.  You have to go down a flight of stairs, not good for elderly or handicapped ppl.", "date": "2013-11-05 03:24:47", "user": {"name": "Alyssa", "review_count": 91, "yelping_since": "2012-12-31 02:50:55", "elite": "", "average_stars": 2.36, "fans": 4}}
{"review_id": "NaDbyI3nuZXaE176fYfOEQ", "user_id": "7d4FE0T185wvYUNNXo92uw", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "The food is so delicious!! Spaghetti and spicy meat sauce is def worth the extra calories!! Great Italian food with a perfect location if you don't want to go into the city and deal with parking.", "date": "2013-10-24 22:28:32", "user": {"name": "Melissa", "review_count": 4, "yelping_since": "2012-08-07 12:55:52", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "cvwPxAcvHeEb85lJcnMrDA", "user_id": "CDxlgCoUoNRV3VMkYZrUuQ", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 3.0, "useful": 2, "funny": 0, "cool": 1, "text": "I came back here on a Saturday night and ordered rigatoni in a sage-butter-parmesan sauce with grilled shrimp on top which was phenomenal. \n\nMy friend had a pasta and seafood dish (it had scallops, calamari, clams, mussels and salmon in it) which was served in a lemon-garlic white wine sauce which she thought was delicious.\n\nThe only reason I won't up the rating is because their salads are always wilted and soggy which grosses me out.  In addition, their service is hit-or-miss and the night I was there, our waiter was completely out of it.", "date": "2013-09-09 01:29:42", "user": {"name": "Suzanne", "review_count": 242, "yelping_since": "2009-09-25 18:27:06", "elite": "2011,2012,2013,2014,2015,2016", "average_stars": 3.64, "fans": 33}}
{"review_id": "3VrertCAp-qC445I85NURQ", "user_id": "eFXXX_bJrOzEpA1yEuzTDg", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here for lunch and got the penne vodka, it was good definitely not the best but I'd come here again!!", "date": "2013-09-09 01:17:31", "user": {"name": "Christine", "review_count": 1, "yelping_since": "2012-03-21 04:07:00", "elite": "", "average_stars": 4.0, "fans": 1}}
{"review_id": "CFq4NjtqSMATTwe0oMTV1Q", "user_id": "WLfARX9glTzStJlNBMK-8A", "business_id": "Ddupo1zhmoct1yPFbF6ipQ", "stars": 1.0, "useful": 2, "funny": 0, "cool": 1, "text": "So my meal started with a pretty good bottle of wine and the waitress was helpful and nice and that's the only reason I'll be giving this place 2 stars after eating! My meal I glance down and find a fly in the sauce like are you serious!! Then after talking to the owner/manager his excuse is he doesn't know how the fly got there that maybe it could've possibly flew in the front door lamest excuse ever completely handled the issue as is it wasn't a big deal personally I don't ever leave reviews but I do not recommend eating there", "date": "2013-08-17 19:44:15", "user": {"name": "Carlo", "review_count": 4, "yelping_since": "2011-10-29 14:57:35", "elite": "", "average_stars": 3.0, "fans": 0}}
