{"business_id": "x1CpCXik31TwTtMPMcrcug", "name": "A Tutti, Ristorante Italiano", "address": "5154 Ridge Ave", "city": "Philadelphia", "state": "PA", "postal_code": "19128", "latitude": 40.018238, "longitude": -75.2115092, "stars": 4.5, "review_count": 78, "is_open": 0, "attributes": {"RestaurantsDelivery": "True", "RestaurantsTableService": "True", "Caters": "True", "RestaurantsPriceRange2": "2", "GoodForMeal": "{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': False, 'brunch': False, 'breakfast': False}", "BusinessAcceptsCreditCards": "True", "GoodForKids": "True", "RestaurantsTakeOut": "True", "Alcohol": "u'none'", "WiFi": "u'free'", "RestaurantsGoodForGroups": "True", "RestaurantsReservations": "True", "OutdoorSeating": "False", "HasTV": "True", "Ambience": "{'touristy': False, 'hipster': None, 'romantic': None, 'divey': None, 'intimate': None, 'trendy': None, 'upscale': None, 'classy': True, 'casual': True}", "BusinessParking": "{'garage': False, 'street': True, 'validated': False, 'lot': False, 'valet': False}"}, "categories": "Restaurants, Pizza, Coffee & Tea, Italian, Food", "hours": {"Monday": "0:0-0:0", "Wednesday": "16:0-22:0", "Thursday": "16:0-0:0", "Friday": "12:0-0:0", "Saturday": "12:0-0:0", "Sunday": "12:0-22:0"}, "category_list": ["Restaurants", "Pizza", "Coffee & Tea", "Italian", "Food"], "stratification_tag": "Pizza"}
{"review_id": "MRSYEsVwe61znu7Q5aONIg", "user_id": "FDCQdm8EgEcnTv-dOAYYqQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Stopped by this place to eat twice and twice I left before eating. First attempt to eat here was at 12noon on a Saturday. I was looking forward to eating pasta only to find out they don't serve pasta until 4pm. Mind you, this is not stated anywhere on the website. Second attempt to eat there was on a random Wednesday night and it was closed for a private party. Call it bad luck but this place is not worth the hassle. I shall not be back.", "date": "2020-02-27 01:33:31", "user": {"name": "Noreen", "review_count": 4, "yelping_since": "2016-08-24 22:40:20", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "Wm8dhCgu_a-qFyfo5NZ_rQ", "user_id": "HrlJkq3uWBLsiK1NAJOqUg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is great. So far we have had the pizza and tonight we chose to venture and get mussels. The mussels were great tasting! But... also it \nwas 16 dollars and we had 10 mussels for that order. I don't mind spending the money but was very disappointed in what we got . Decent size but nothing over the top. I've had very big mussels at another restaurant in manayunk and we got about 20 to 25 in that order for about 14 dollars. We definitely we be going back but was hoping for more for the price.", "date": "2020-02-13 01:01:26", "user": {"name": "Maddi", "review_count": 2, "yelping_since": "2020-02-13 00:49:23", "elite": "", "average_stars": 2.5, "fans": 0}}
{"review_id": "kASN6SdLnV7mCsCx43Wvbw", "user_id": "PV6cmSEG9ADTEptQmxkztA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "We ordered for delivery and each of us had pasta dishes (polpette) and (carbonara). The bacon of the carbonara was served in HUGE pieces that were mostly fat and very tough to eat. Both dishes were fettuccine, the dishes would have been much better done with spaghetti. \n\nThe focaccia bread that came with the meals was good but heavy on the black peppercorn spice. The spinach saltati was ok, but not worth the price. All in all, we were not very impressed with our meals.", "date": "2019-12-26 02:09:37", "user": {"name": "P", "review_count": 50, "yelping_since": "2013-11-07 03:14:24", "elite": "", "average_stars": 3.64, "fans": 0}}
{"review_id": "w_cuvrwwqEOz50dbJpMcKw", "user_id": "3VpYwTpNhVS_eqOhCKr5wg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 2, "funny": 1, "cool": 2, "text": "Such a cute little find at the end of Manayunk / Roxborough. BYOB Italian restaurant with a cafe styled feel. The menu is small but I was able to find something I wanted instantly. The spinach pasta was delicious and the large size white pizza was perfect to split with 3-4 people. The blanco pizza was well seasoned and so cheesy. The service was fast and our server Sarah was so friendly. I'll definitely be back!", "date": "2019-12-22 02:28:15", "user": {"name": "Sarah", "review_count": 86, "yelping_since": "2018-04-11 20:40:26", "elite": "2019,20,20,2021", "average_stars": 4.01, "fans": 4}}
{"review_id": "1GH_TM-3ppT3lyLX7hdPqQ", "user_id": "NNatfCbvuy6JUhShn79lBQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is incredible! The bread and pizzas are warm, perfectly seasoned, and soft and crisp in all the right ways. The owner is generous and makes everybody feel at home. Great quality for a much lower price than we'd expected, and they were really accommodating to our party of 18. Definitely give it a try either dine-in or takeout. It's a convenient location to pick up some awesome food on your way home. Love it!", "date": "2019-12-08 15:58:41", "user": {"name": "Arielle", "review_count": 1, "yelping_since": "2016-02-28 23:55:11", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "52AMAdPqYm_swwq7Bp6AqA", "user_id": "hQJtQwENDLqE4ndu3LeS_Q", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love love love A Tutti. Great atmosphere and great addition to Roxborough. Tomato Basil soup with focaccia is a must have. Love their crust! Very family friendly and the staff is so nice! BYOB but their coffees are delicious", "date": "2019-11-23 18:30:38", "user": {"name": "Rachael", "review_count": 4, "yelping_since": "2017-04-18 01:02:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Jd7eAUzL0ve3m-MsauvMmA", "user_id": "encss72uOIm6Izd0LOK1sg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Wanted to support a neighborhood spot.  Ordered for delivery.  Pizza was ice cold, very burned, and 30 minutes late.  3 strikes and you are out.  We will will not order from them again.", "date": "2019-11-23 03:38:51", "user": {"name": "Greg", "review_count": 7, "yelping_since": "2010-08-29 17:24:52", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "dU-Dq8lCUCC4YAFmk3qKcg", "user_id": "peEzSzuKhHIeslQDsLGK2g", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Hehe I love you guys. This pizza is pretty damn close to what I had when I studied abroad in Italy. Bang bang.", "date": "2019-11-10 03:53:37", "user": {"name": "Madilyn", "review_count": 21, "yelping_since": "2015-07-24 22:54:54", "elite": "", "average_stars": 4.0, "fans": 0}}
{"review_id": "B7eypt7_zayc2eklxOK-uA", "user_id": "cEhl7ElyEWatc7GVkZs9sg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "What a hidden gem!! Local BYOB!! Italiano to die for!! Food and service were awesome! Greeted immediately upon arrival, Sara was Very warm and prompt attentive service!! Food was incredible! The specialty bread is a must! The Chef (Paul) was checking in with each table to insure that food was delicious as ordered! Will definitely be back", "date": "2019-10-27 13:21:23", "user": {"name": "Tara", "review_count": 4, "yelping_since": "2014-07-12 23:33:00", "elite": "", "average_stars": 5.0, "fans": 1}}
{"review_id": "XENrd63jzFlFLVSC_hYrLA", "user_id": "0wG915tosdUxPa3vdtmS6w", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great service and super fresh food and amazing pizza. The menu is very affordable, three of us ate for under $50. They give you the best bread prior to the meal. Definitely a great place for dinner or if you just want to pick up a pizza.", "date": "2019-10-12 22:38:59", "user": {"name": "Bobby", "review_count": 2, "yelping_since": "2019-07-14 22:52:15", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "Jcao5u0eX8OHDM2NqS6pew", "user_id": "fq78BZ3C8qfgl-EwNRTjVA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "A unique pizza experience off the beaten half that you definitely need to try. Thin crispy pizza with a fluffy doughy crust. The environment is a nice casual dinner setting with plenty of seating and TVs. BYOB.", "date": "2019-10-12 13:05:13", "user": {"name": "Mike", "review_count": 13, "yelping_since": "2013-03-31 17:35:57", "elite": "", "average_stars": 4.23, "fans": 0}}
{"review_id": "lrzIVsfFnz0mowybHnvuiw", "user_id": "NlOZNYYRsLA51nD6WxC7Jg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing deal Monday, Wednesday, Thursdays 5 to 7 pm- great pizzas for only 5$. Food is really good. BYOB as well makes it even more attractive. My girlfriend got the pasta and loved it. We have gone once a week since we discovered this place", "date": "2019-10-05 13:46:33", "user": {"name": "Tim", "review_count": 10, "yelping_since": "2019-02-09 02:19:39", "elite": "", "average_stars": 3.4, "fans": 0}}
{"review_id": "Fbt7T0pY54k_vEzTuXSjNQ", "user_id": "BmykAn13YBce1Q1neCzQOw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "My favorite, favorite pizza in the manayunk area. It's between this and Pizzeria Vetri for my top favorite philly pizza. You definitely need to give this place a try. The decor is cozy and service is fast and friendly. The location kind of stinks since it's on a busy road, but you can normally find close parking near Osborn street if Ridge is too crowded. This place is definitely worth the trip. Pro tip: stop in for pizza and then work it off with a walk to get ice cream at the top of Ridge Ave.", "date": "2019-09-30 23:02:57", "user": {"name": "Holly", "review_count": 144, "yelping_since": "2012-10-08 22:41:39", "elite": "", "average_stars": 4.39, "fans": 1}}
{"review_id": "PrSkVPCCYqinqOSQkC2mnA", "user_id": "1jEmjihu1sFi5W5fmGbGOA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Love it here!! \nGreat atmosphere and beyond delectable and delicious food!! \nPaulie is a gentleman and a hell of a chef!\nJoe is kind and cooooooool!\nDo yourself a favor and frequent this oasis!\nIt is a BYOB.", "date": "2019-09-21 19:28:57", "user": {"name": "David", "review_count": 48, "yelping_since": "2011-03-25 23:24:44", "elite": "", "average_stars": 4.1, "fans": 1}}
{"review_id": "Jx_3z68m9uBlAh9SazuqSw", "user_id": "jQhMQnGbY4YFvu8ikhLjFw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "So this night started by ordering the vegan pizza with onions and peppers added from A Tutti from Uber Eats. I ordered this item as I have a dairy allergy and was excited to see a pizza that I didn't have to ask to be modified in order to be dairy free. Both on their menu and on Uber eats it explicitly states that this pizza does not contain cheese.\n\nSo I get my pizza in a timely manner from Uber Eats, and when I open the box, what do I see? A pizza with ONLY cheese, peppers, and onions. There was not even sauce on the pizza and it did not contain any of the other toppings that were stated on the menu... I also received the actual A Tutti receipt and it stated the correct order, so I am very unsure how such a big mixup happened.\n\nI call the restaurant and they state that they will remake the pizza and have their delivery person deliver it to me as soon as possible. She stated that the driver will call me when he arrives at my apartment. So I wait for about 40 min and then TRY calling the restaurant back to ask what the ETA is. However, now their phone is not working. I had to call about 10 times for about 15 min before I can get through to the restaurant. When I finally get through, they state that they have been waiting for me to call back, because they were unable to get my address from Uber Eats. So I give it to them, and they state that it should be delivered soon.\n\nAnother 30 min go by and I have still not received my pizza or heard from the restaurant so I call back again, but of course it takes another 10 min of calling to get through. When I finally do they state that the driver is out making other deliveries, and if he was not back in 5 min that they would call the driver and then call me when the driver was on the way to my apartment. So after ANOTHER 30 min I try calling the restaurant, and \"surprisingly\" cannot  get through so I decide to get in my car and drive to the restaurant. As soon as I get there, I get a call from the delivery guy that he is at my apartment. I had not received a call from the restaurant stating he was on his way as promised.\n\nI go into the restaurant hoping to speak with the manager. I told the woman that had been answering the phone that I was expecting a refund seeing as it took all-in-all almost 3 hours to get the correct order delivered from the time I ordered it on Uber Eats until the time I got the pizza. She told me that when the manager was not busy, he would call Uber Eats to get my refund, so we will see if that happens. Also, I was obviously frustrated and upset with this whole situation, and this woman at the counter was giving ME attitude. \n\nSo now I am sitting here eating the pizza, and it is soggy, tasteless, and obviously very cold. Save yourself the hassle and go find better pizza somewhere else.", "date": "2019-09-14 00:38:11", "user": {"name": "Molly", "review_count": 15, "yelping_since": "2016-06-23 20:49:06", "elite": "", "average_stars": 4.13, "fans": 0}}
{"review_id": "p8vODUBdhAfogZatZ8PJNw", "user_id": "d3D9wfDsl7sPcJLhVxzSOg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pizzas and focaccia are amazing (so far all pasta has been too but these are our favorite) and the service is great. They were patient when we brought a tired 4 year old, even making a pizza specifically so that he'd eat it.", "date": "2019-09-04 11:33:04", "user": {"name": "E", "review_count": 28, "yelping_since": "2013-11-13 13:10:55", "elite": "", "average_stars": 3.63, "fans": 0}}
{"review_id": "fkEv7YURFLEhEUAkyCTRnA", "user_id": "VtZUWsESS_FE2LjodkuR-Q", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Delicious BYOB. Huge space, family friendly. Small but simple menu. Everything comes with this amazing bread. And the staff is anyways attentive and friendly. Couldn't ask for anything else from a quaint neighborhood joint.", "date": "2019-09-01 01:16:44", "user": {"name": "Ross", "review_count": 1, "yelping_since": "2011-05-19 09:14:43", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "n28HxehLRXhdXhmJPW00Tw", "user_id": "4Jsmb92lYx8Djk4QBk6aXA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "First but not the last time I go there! BYO, outstanding food and service not to mention so reasonably priced. Loved everything!", "date": "2019-08-18 01:01:07", "user": {"name": "Anita", "review_count": 8, "yelping_since": "2016-08-30 16:27:48", "elite": "", "average_stars": 4.78, "fans": 0}}
{"review_id": "a-6UEiB_KqzpyO46m_dMcw", "user_id": "_le5s4gaO7N5TJA6flB5BA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pizza is absolutely fantastic, also Paulie is the absolute sweetest - I was just passing through, but now I'm definitely coming back to try some of his Mom's famous meatballs!", "date": "2019-07-28 02:09:33", "user": {"name": "Emily", "review_count": 32, "yelping_since": "2013-02-03 02:11:07", "elite": "", "average_stars": 4.19, "fans": 2}}
{"review_id": "x62_36dUdsHt1N_R4hbBOw", "user_id": "LN2eNwjoyTq350CyO0SGzA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "Crust was undercooked. Ordered a half cheese, half prosciutto and mushroom. Got a half prosciutto half mushroom. Flimsy. Took about an 45 mins for takeout. Walked in and the place was empty. I'm not saying \"oh there was no one there\" and there was a table or two, there was the girl behind the counter. Period.\n\nAlso, it was pretty expensive for what I have l got. $19 all in after tax and tip. If it wasn't so close (2 blocks) I would have gone elsewhere, and in the future I'm sure I'll drive the extra few blocks for something better.", "date": "2019-07-21 19:49:11", "user": {"name": "Steven", "review_count": 30, "yelping_since": "2013-11-04 13:08:40", "elite": "", "average_stars": 3.97, "fans": 0}}
{"review_id": "1gBtmysEYKYC_BqtAnmP2w", "user_id": "5__acJUyemEpQgaI_Gqfzg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My daughter just had a first birthday party for her twins.  There were over 70 adults and 30 children.  The food just kept coming, and the staff were so attentive.  What made it so pleasant was how helpful the staff were in making sure every one was enjoying themselves. The owner mentioned that the meatballs were his mother's recipe, and they were exceptional.  In fact, everything about the experience was exceptional.  I just noticed some reviewers giving this restaurant one star.  I just find that difficult to accept.  This is truly a five star, especially for special events.", "date": "2019-07-21 13:02:19", "user": {"name": "Vincent", "review_count": 9, "yelping_since": "2013-02-17 03:29:10", "elite": "", "average_stars": 3.7, "fans": 0}}
{"review_id": "ZSPuBjm967utAZQF6ag4Kg", "user_id": "Bo2jzVwkSKluV9PPWLE-Yg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The pizza was delicious. Best pizza I've had in the area since I moved here a year ago. Plus you can't beat BYOB and a $5 happy hour personal pizza. The happy hour pizza can have up to 3 toppings and all the speciality pies are included. Personal pies are rather large in size. So we were all able to bring home leftovers. My group was very happy with our food and service. \n\nThere must have been a kitchen mess up because we left with an additional free pizza. Something that worked out in our favor. \n\nThe restaurant was a little hot....benefit of the doubt is that it's over 90 degrees out right now. My group was content with the temperature but we heard other tables complaining it was hot.", "date": "2019-07-18 16:35:58", "user": {"name": "Nicole", "review_count": 12, "yelping_since": "2018-12-07 21:27:41", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "aEAEG5Egbed0N9PzORdkXw", "user_id": "9g2yOSgIpHq3gcpX756HeQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 1.0, "useful": 1, "funny": 0, "cool": 1, "text": "Update (13JUL2019). I had previously given A Tutti 3/5 based on a dinner service, and I recently attempted to give them another shot which revealed to me that I was mistaken in my 3-star judgment: let's bump that down to 1-star and dive into the lambasting, shall we?\n\nThe entire point of the hospitality service is just that: to provide guests with a good experience and to make them feel welcome. This was the total opposite of my most recent - and definitely last experience - at A Tutti. I want so badly to have a good pasta restaurant near my house, so I decided to give them another shot, and boy did I regret it! My friend and I ordered a salad on focaccia, and pasta and meatballs. Pretty standard fare for an Italian place, right?\n\nMy food - the pasta and meatballs - came out of the kitchen pretty quickly. Notably absent was a salad, which seemed odd since normally Caesar salads are pretty quick to prepare, right? We waited about 10 minutes in the absence of the aforementioned salad - and our waiter - so I decided to take things into my own hands and beckoned over who appeared to be the owner (I believe his name is Paul). Upon learning that we were missing a salad (read: on focaccia), he retreated to the kitchen to presumably fix this problem. \n\nA few minutes later, the salad, devoid of focaccia - Paul in tow - sauntered over to our table. Our waiter joined Paul in delivering this incorrect dish to us with a smug expression on his face, and remarked, \"It's all Paul's fault!\"\n\nIn response to our evident displeasure, Paul asked, \"Was this supposed to be on focaccia?\" To our great dismay - and I can't make this up - after we affirmed his query he responded with, \"Oh well! I'll take it off the bill.\" (Said in reference to the additional charge of the focaccia NOT the whole salad.) What? He did not even offer to fix the dish that was wrongfully prepared. Just an \"Oh well.\"\n\nThis was such a backwards experience, all in the pursuit of truly mediocre pasta. The cacio e pepe I received this time was as awful as ever, the salty punch of pecorino was nowhere to be found and instead was replaced by an acrid, plasticky pre-ground black pepper flavor. \n\nI will absolutely not be giving them a third chance, and I most definitely hope this review saves some other poor souls from sharing a similar experience. Go in grace, friends.\n\n-- \n\nI have been dying to go to A Tutti for a while now because I'm very eager to find an Italian restaurant it's great pasta near me. Unfortunately, I was let down by the pasta at A Tutti, but everything else was pretty good and I like the energy of the place, so I do want to go back and try again.\n\nService: Our server Sarah was great. She was super friendly and gave us good advice throughout the meal.\n\nAmbiance: I felt like I was in a little trattoria in Italy. Very authentic vibe with big band and swing music playing which further transported me out of Roxborough and into another time. We were immediately greeted warmly like family when we walked in, and I couldn't stop smiling after that. \n\nFood: Definitely some stuff that can be worked on, here. I will start with my sad pasta, cacio e pepe, which was bland, gummy (overcooked & stuck together), and truly unpleasant to eat. It had none of the sharpness I would expect from a dish which is supposed to primarily consist of Pecorino Romano, and I really couldn't even eat it. We also got the carbonara, which tasted good, but the egg was hugely scrambled (GIANT pieces of scrambled egg) and was a far cry from the luxurious, rich sauce you expect from this dish. I am not sure if we just got a bad night on the pasta front or if they need to tweak their recipes, but this was definitely a letdown.\n\nWe also got pizza, flatbread, tomato soup, and meatballs. All of this was awesome and tasted very authentic. The pizza was crispy - I love the dough - and had bright, tomatoey sauce with sweet, chewy cheese. The flatbread was made from the same dough and delivered crispy, herbal rosemary perfectly. The tomato soup was exquisite and was particularly tasty with the breads dipped into it! Finally, I was happy with the meatballs, which came out steaming and covered in tomato sauce.\n\nOverall, there were some misses this night, but I liked the good food and the atmosphere so much that I definitely want to return. Thanks for the meal, A Tutti.", "date": "2019-07-13 15:58:19", "user": {"name": "Robert", "review_count": 55, "yelping_since": "2017-07-20 22:53:44", "elite": "2018,2019", "average_stars": 3.6, "fans": 5}}
{"review_id": "i-0XMLhKplSWJRVtUYYh1g", "user_id": "PcoeVMyUkgOyROjWQEo2Zg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 4.0, "useful": 4, "funny": 0, "cool": 1, "text": "I can't believe that I have driven by this spot 1,000 times and it took me THIS long to discover it. Very happy I finally tried it out last night though! The restaurant is cute with modern decor and a relaxed atmosphere. It's BYOB so make sure you bring some wine. Our server, I believe his name was Dan, was attentive and a super cool guy. We were disappointed at first because the restaurant was out of a couple items that we wanted to order, such as the calamari and some of the ingredients that come in the Pasta alle Cipolle. However, when Dan brought out the focaccia all of our doubts about the restaurant faded. It was baked to perfection and we loved all of the rosemary and spices on it. Also, Dan and the cook told us that they can whip up a special pasta dish with the ingredients they did have in the kitchen. We really appreciated the accommodation and the pasta was great! The star of the show was the pizza. The crust was perfectly crisp and the sauce tasted amazing. This will be my new place to order pizza from in Manayunk and I can't wait to come back for another date night to try more of their pizzas!", "date": "2019-07-12 13:27:09", "user": {"name": "Samantha", "review_count": 134, "yelping_since": "2017-06-16 15:45:11", "elite": "2019,20,20,2021", "average_stars": 4.34, "fans": 14}}
{"review_id": "bIIrLciIBZqZ-QQofGxA3g", "user_id": "N51icCZQjs9gG-IgJCn5xw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great place for Italian that won't break the bank. Authentic hand made pastas, pizzas, and flatbreads. Super fresh ingredients.  The focaccia is so flavorful. Also a BYOB which is great.", "date": "2019-06-30 23:55:34", "user": {"name": "Peter", "review_count": 15, "yelping_since": "2015-03-07 00:14:42", "elite": "", "average_stars": 3.89, "fans": 0}}
{"review_id": "4l2PXob8SWJ9uVhpQQvxeA", "user_id": "o7pSJW5ekWfloLmM1bKRDg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We loved this Manayunk restaurant last week! The focaccia bread and homemade pasta were DELICIOUS! Great spot to have right around the corner in our neighborhood!", "date": "2019-06-27 21:21:46", "user": {"name": "Darcy", "review_count": 4, "yelping_since": "2018-08-30 19:20:52", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "wEdtsvLhMO_WqvvwPbBeCA", "user_id": "UN6MXJuhyGcX7LTj4-b7FA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 1.0, "useful": 4, "funny": 0, "cool": 2, "text": "Ugh.\n\nI gave this place 2 stars a few months ago. I'm downgrading it to ONE.\n\nOne of my writing buddies from Manayunk was heading over to my neck of the city so I could help him with editing a project. I offered to make dinner but he said he'd pick something up on the way so we'd have more time to edit. I was in doubt of anything good coming from Rox/Wiss/Manayunk-but hope springs eternal and my thought was, \"Fine with me\", lazy sod that I truly am.\n\nWhat did Jake bring for dinner? Yep, you guessed it. A salad and a Tre Carne pizza from A Tutti. He was utterly chuffed with himself, saying Michael Klein from The Inquirer had just reviewed the place so he knew the food must be good. I like Jake a lot so rather than criticize his choice or look a gift horse in the mouth, I made us a pitcher of sangria, told him he was a mensch, set the table and figured the second time's the charm.\n\nNo. It's certainly not. \n\nThe \"Caesar\" salad was just as bad as it was the first time I got it. Lots of the ends of romaine, mostly yellow with too much of that salty, gaggingly fishy dressing, 2 anchovy filets and a piece of lemon laid atop the yellows-umm-I mean the 'greens.'  I passed. Told Jake he was looking like he was not getting enough fiber in his diet as I crossed my fingers behind my back and said I'd already had a huge salad for lunch. \n\nThe Tre Carne pizza was definitely a pizza but it was minus the carne. Not a scrap of pig or cow. It still came with the half burned basil scattered all over it like before, very little cheese and no black olives or meat of any kind to be found on top, in the box or up Jake's sleeve. I asked Jake if he was okay with me crisping it up a bit. He said 'do your thing,' so I discreetly grated some mozz, drizzled on some garlic oil, sliced up and scattered some pepperoni, dug out a few long hots, dressed the pathetic pie, put it on a pizza stone and gave it a blast in the oven. The fluffing helped. Just barely.  \n\nWe ate the pie because it was there, Jake had some polite forkfuls of the sad salad then moved it to my fridge, we gloried in the sangria and later in the bounty of frozen goodies I'd bought a few days before from Lil Pop Shop.\n\nA Tutti-you let me down again.", "date": "2019-06-27 19:55:34", "user": {"name": "Warren", "review_count": 167, "yelping_since": "2006-03-12 01:04:23", "elite": "", "average_stars": 3.26, "fans": 67}}
{"review_id": "QwSFr3FwSvAT81_cy6vtcg", "user_id": "Z5dh2ITQAoXGMXQcWi46iw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely amazing service and wonderful food. We were caught in a rain storm on our way in and the waitress took care to point out a table that wouldn't be cold to sit at. She was very knowledgeable about the menu and took the time to explain how a very generously sized focaccia bread came with every pasta dish. When asked, she gave her recommendations.  \n\nThe other staff (maybe the owner?) was equally generous and welcoming. He did everything in his power to make sure that this date was one to remember. He even sent out some to-die-for chocolate salami! Highly recommend", "date": "2019-06-08 16:04:59", "user": {"name": "Katie", "review_count": 2, "yelping_since": "2019-06-08 16:04:57", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "csB2bgQUteEDeVArtbTYpg", "user_id": "pYaCbN49TO3Kaay7yZzxug", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 2.0, "useful": 1, "funny": 0, "cool": 1, "text": "I gave A Tutti a second opportunity tonight. I'm afraid to say I left feeling disappointed. I ordered the carbonara. The dish had chunks of cooked egg and what looked like fatty ham, not pancetta you would normally see in a carbonara. The dish also lacked any flavor. On a plus side, the waitress was nice and accommodating.", "date": "2019-06-08 00:06:21", "user": {"name": "Marissa", "review_count": 7, "yelping_since": "2014-11-23 20:41:39", "elite": "", "average_stars": 4.43, "fans": 0}}
{"review_id": "o9SPlHqJf45j7JhZz-Tthg", "user_id": "5uYARe7O_D95tbPanyPdqA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely Love this restaurant! The Focaccia Bread that comes with the pasta was fantastic.  There sever was knowledgeable and attentive. The owner came out and introduced himself to us.  We even got a dessert to share as new comers in the neighborhood.  The food was delicious. My friend and I got the fettuccine and meatballs and my wife got the fettuccine in a white wine sauce with carrots and red onion, it all tasted great and we look forward to coming on our next night out.  Love it!!!", "date": "2019-05-30 12:33:11", "user": {"name": "Robert", "review_count": 45, "yelping_since": "2016-12-10 05:20:15", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "X29LulByt0vZTn-c-M4cPQ", "user_id": "BAvsYuRRTRCQyNn0kV3qOQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food, great pizza, great staff and owner! Deserves way more business", "date": "2019-05-06 00:18:37", "user": {"name": "Henry", "review_count": 6, "yelping_since": "2019-05-04 16:19:13", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "ghUwSN8l-1oiRXV8Y7_How", "user_id": "1j2yL4okpUeY5-rm9idCEA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was delicious! It came out hot and fresh from the kitchen...and fast! We also had a little one with us and the staff was great with her and very accommodating. Will definitely be going back.", "date": "2019-04-13 23:03:16", "user": {"name": "Lindsey", "review_count": 3, "yelping_since": "2012-08-18 06:45:42", "elite": "", "average_stars": 4.33, "fans": 0}}
{"review_id": "Jc1fhf-r2kaT1WSuuZkciQ", "user_id": "yTfCapoM1CheDcFBnQ0svg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 4, "funny": 0, "cool": 0, "text": "I go to Italy twice annually and this is the closest experience to authentic  Milan style pizza. Go in, have a personal pie, finish with a small coffee. Put off your post Italian trip depression... \n\nPrices are incredibly fair for the quality and experience especially when compared to places like Vetri Pizza. This is not your typical neighborhood pizza. It is about the flavors and passion that goes into making it. Buonissima!", "date": "2019-04-08 16:13:15", "user": {"name": "Tito", "review_count": 3, "yelping_since": "2014-12-22 00:22:26", "elite": "", "average_stars": 3.67, "fans": 0}}
{"review_id": "gTAol24aCNAfIHdcNRUMuA", "user_id": "cJwR_gKTtHYQ4jgUOwGdLA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "OK, so I'm from New York originally, and so I'm a pizza snob. I have a very hard time finding pizza I really like in Philly, and hadn't yet found it in my neighborhood until I went to A Tutti. They have some of the best pizza in the entire city. The crust is flavorful, and is that perfect blend of floury and crisp on the outside/chewy on the inside that I love about NY style pizza. The sauce and cheeses are high quality as well. I also had the arugula salad that was very nicely dressed, and not too heavy. The waitress was efficient and friendly. The interior is larger than it looks from the outside. I'm so happy it's right down the hill from me!", "date": "2019-04-05 08:31:36", "user": {"name": "Susanna", "review_count": 1, "yelping_since": "2019-01-18 22:43:49", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "Le3VtysYdu39XgbyazUzSw", "user_id": "Zu6t6Op6Bk4UGpbgFWmfpw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "A Tutti ristorante is a great addition to the Manayunk scene. We recently had a fundraiser at the restaurant and everyone was blown away by how great the pizza was. The dough is perfect and the combinations are classic. The owner hand makes fresh pasta everyday so if you are looking for authentic Italian goodness A Tutti is the spot for you. Stop by for some amazing food and a good time", "date": "2019-03-31 17:58:34", "user": {"name": "Sydney", "review_count": 1, "yelping_since": "2014-10-27 14:35:15", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "9IDSb5z-vWrYQ4pf4djeJA", "user_id": "VJ5H-Emw4JK2RAP_4YYn5w", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Thank you Paul! What a great gathering place with yummy dishes and wonderful service! \n\nWe had a group dinner this past Saturday night (20 people) and they truly were great with our group! The appetizers were plentiful and delicious. Their focaccia was baked to perfection. Everyone ordered different dishes and they were large enough to share! \n\nIt's BYOB so be sure to bring your favorite wines! \n\nGreat place for a large group gathering with great service & food!", "date": "2019-03-25 16:14:21", "user": {"name": "Eli", "review_count": 60, "yelping_since": "2009-12-31 17:50:34", "elite": "", "average_stars": 3.33, "fans": 0}}
{"review_id": "mjgf0TQRLUgt9b-EMhorpg", "user_id": "9g2yOSgIpHq3gcpX756HeQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "I have been dying to go to A Tutti for a while now because I'm very eager to find an Italian restaurant it's great pasta near me. Unfortunately, I was let down by the pasta at A Tutti, but everything else was pretty good and I like the energy of the place, so I do want to go back and try again.\n\nService: Our server Sarah was great. She was super friendly and gave us good advice throughout the meal.\n\nAmbiance: I felt like I was in a little trattoria in Italy. Very authentic vibe with big band and swing music playing which further transported me out of Roxborough and into another time. We were immediately greeted warmly like family when we walked in, and I couldn't stop smiling after that. \n\nFood: Definitely some stuff that can be worked on, here. I will start with my sad pasta, cacio e pepe, which was bland, gummy (overcooked & stuck together), and truly unpleasant to eat. It had none of the sharpness I would expect from a dish which is supposed to primarily consist of Pecorino Romano, and I really couldn't even eat it. We also got the carbonara, which tasted good, but the egg was hugely scrambled (GIANT pieces of scrambled egg) and was a far cry from the luxurious, rich sauce you expect from this dish. I am not sure if we just got a bad night on the pasta front or if they need to tweak their recipes, but this was definitely a letdown.\n\nWe also got pizza, flatbread, tomato soup, and meatballs. All of this was awesome and tasted very authentic. The pizza was crispy - I love the dough - and had bright, tomatoey sauce with sweet, chewy cheese. The flatbread was made from the same dough and delivered crispy, herbal rosemary perfectly. The tomato soup was exquisite and was particularly tasty with the breads dipped into it! Finally, I was happy with the meatballs, which came out steaming and covered in tomato sauce.\n\nOverall, there were some misses this night, but I liked the good food and the atmosphere so much that I definitely want to return. Thanks for the meal, A Tutti!", "date": "2019-03-25 00:27:08", "user": {"name": "Robert", "review_count": 55, "yelping_since": "2017-07-20 22:53:44", "elite": "2018,2019", "average_stars": 3.6, "fans": 5}}
{"review_id": "sogPN3UQDxbjRYy_wfBFPQ", "user_id": "N7l1dL6T2LV6c8a2hsM9yA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Me and my boyfriend tried A Tutti for the first time for our anniversary and we were so excited to finally get to come to this place after waiting Months. To start, I got the roasted tomato bisque and it was amazing! We then shared a focaccia and a Margherita pizza, the focaccia was great, and my boyfriend loves the pizza. For me the focaccia was great and the pizza was pretty good to. I liked the dough. The sauce had good flavor, just not enough sauce or mozz for my liking and the basil was blackened which I understand is a certain look, but I  l just like mine with fresh basil (an easy fix that I can just ask for next time). The pasta? The pasta was ok, we got the carbonara and cacio e pepe. They didn't have much flavor, but we're picky when it comes to pasta dishes. We forgot it was a BYOB, so when you go, don't forget the vino!\n\nSarah (our server) and she was great. Thank you Sarah! We also met the owner Paul, who shook our hands and asked if it was our first time. Very hospitable, thank you Paul and Sarah for making us feel welcome. We will definitely be back to try the other pizzas and maybe some antipasti. Oh! And I can't forget about the soup! You gotta have the soup! All in all it was a great night out! Ciao! Arriverdverci! Till next time!", "date": "2019-03-22 00:31:56", "user": {"name": "Anthony", "review_count": 10, "yelping_since": "2019-02-15 06:56:57", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "aKwD5Jf412ZM55gzgzDMEA", "user_id": "UN6MXJuhyGcX7LTj4-b7FA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 2.0, "useful": 4, "funny": 2, "cool": 0, "text": "It truly pains me to diss a neighborhood place, but it pains me more to waste money on sub par food.\n\nLet's start with the good. Hospitality here is fantastic. It's that down home, casual friendliness that I have not found anywhere other than Philly. The new owners turned what was a depressing space into a warm, nice looking environment. The prior business, also pizza, was abysmal with surroundings to match. A Tutti is clean and looks like a place where you wouldn't mind settling in and enjoying a meal. \n\nNot so nice or good was my Caesar salad which consisted of a large handful of not so fresh looking, yellow romaine, a few slivers of cheese, a lemon wedge (?!) and a dressing that tasted heavily of anchovy and salt. Where the hell were the herb croutons? Cracked black pepper? Sorry not sorry-this was a pathetic excuse for any kind of salad, never even mind that it wasn't what was described on the menu. 3 bites convinced me this was a waste of money and plate space and not worth taking home for later.\n\nThe Tre Carne pizza also saddened me. The puffy, browned crust hinted at what was going to be a toothsome, worth waiting for pie but damn-that crust lied to me. Bottom was blackened, bordering on burnt. The center of the pizza was soggily wet, limp and floppy. Careful excavation revealed no mozzarella at all, though again, that's what the menu promised. The pie was sloppily thrown together and who ever said that fresh basil should be roasted with the rest of the pie's ingredients? Uh uh. Bad move. The few basil leaves scattered on the pizza were crisp from the oven and tasted like overdone marijuana; bitter and brackish. The paper thin slices of mushroom fared equally badly in the oven, coming out leathery and flavorless, making me miss the earthy marriage of funghi to sweet tomato sauce. And the sauce? Umm-made me wish for shakers of garlic powder and oregano or even the ubiquitous dried chiles I used to rely on at the buck a slice joints to give it some taste. *sobs*\n\nI purposely chose to eat here instead of the chain-Santucci's-on Ridge but dammit-it will be my last visit to A Tutti. A shame, too, because if the food was even half as good as the friendliness I found here, I'd be a fat, happy, pizza gut gay boy in no time at all from patronizing this place.", "date": "2019-03-02 20:32:21", "user": {"name": "Warren", "review_count": 167, "yelping_since": "2006-03-12 01:04:23", "elite": "", "average_stars": 3.26, "fans": 67}}
{"review_id": "uFW9c4y_JgNNDdC3pwDbrA", "user_id": "7zKsEREhy91jMmi9rVOWRA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I live in the neighborhood and I am so glad to finally see a quality restaurant in this location. The pizza was excellent and the staff was friendly. The owner was also very welcoming. Will definitely be a return customer!", "date": "2019-02-23 19:00:14", "user": {"name": "Geoffrey", "review_count": 8, "yelping_since": "2014-11-03 14:52:25", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "rCzP7jttkAav47TVC0uyog", "user_id": "o9V9pFx2Sc4U0_Nxgf6QXg", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "A JOKE. their \"fresh mozzerella\" literally showed up in the squares bought directly from a grocery store. their cacio e pepe was hard and clearly had been microwaved and was nothing but dry egg noodles with pepper which i added red pepper flakes to.", "date": "2019-02-22 03:01:44", "user": {"name": "Natalie", "review_count": 4, "yelping_since": "2019-02-22 02:58:39", "elite": "", "average_stars": 3.25, "fans": 0}}
{"review_id": "GYS0QAM7dsSGyhG3DECVXQ", "user_id": "IqUC9tSafu8h33CuJaLSCQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great casual Italian fare. I went for dinner a few nights ago and I ordered the cacio e pepe, which was delicious. The portions are generous and all of the pasta dishes come with focaccia. Service was quick and friendly.", "date": "2019-02-20 23:32:22", "user": {"name": "Maya", "review_count": 19, "yelping_since": "2017-02-20 13:05:12", "elite": "", "average_stars": 4.53, "fans": 1}}
{"review_id": "fnwWToZhGj-A9ywZ4agpIQ", "user_id": "W9XsN3wrZU9PGuowOAUhDQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is my favorite Italian restaurant. I ordered Prosciutto and spinach pizza is absolutely delicious. It's fresh and crispy. I highly recommend this place.", "date": "2019-02-05 01:25:56", "user": {"name": "Naoko", "review_count": 2, "yelping_since": "2013-02-25 19:23:10", "elite": "", "average_stars": 4.67, "fans": 0}}
{"review_id": "qlA-sidn3I680hSiWnbV2A", "user_id": "fS-H2TK1yj6On3hbCVHbKA", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Delicious! The pizza and focaccia were perfectly cooked.... I only wish there was a whipped ricotta to compliment that amazing dough!\n\nService was impeccable.. we had our 3 kids there and it was completely family friendly.\n\nI can't wait to go back and order a pasta dish, which are all homemade !!", "date": "2019-02-02 01:12:46", "user": {"name": "Georgeann", "review_count": 1, "yelping_since": "2011-07-23 20:08:23", "elite": "", "average_stars": 2.0, "fans": 0}}
{"review_id": "z6bqSqhhYw5hTGD9W6brMg", "user_id": "ta-ywtRLDEoKD-sH_UgLTw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Average Italian place, not a lot of choices though.\nHad the pasta Pepe and cibolle and vegan pizza. Was ok but have had better at other places in the area.", "date": "2019-01-31 02:12:35", "user": {"name": "Jean-Luc", "review_count": 67, "yelping_since": "2014-01-08 16:53:27", "elite": "", "average_stars": 3.0, "fans": 0}}
{"review_id": "kBrpvF4QjmFzDrF4MmtFlA", "user_id": "0cmS5UNWfa7BkksIrhhHDQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've never had pizza like this. This place has some of the best pizza in all of Philadelphia hands down. Went the other night and ordering another one in 5 minutes. Owner is a super friendly guy too. Definitely worth a try.", "date": "2019-01-26 18:41:05", "user": {"name": "Jimmy", "review_count": 1, "yelping_since": "2016-08-24 21:03:50", "elite": "", "average_stars": 5.0, "fans": 0}}
{"review_id": "KouDhSZMtR-NawSS7DbiRQ", "user_id": "9qiJY4u_265scjdpwTObJQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place has high quality food and fresh ingredients. I mean you could taste the freshness in each dish. The Caesar salad was fabulous and had homemade croutons. I found myself sitting there planning my next visit as I ate the meal. Everything is affordable and the pizza is very light. I must say I agree with other reviews about this place lacking in service. The waitress didn't offer dessert and had to return for order clarification. But for me- high quality food, nice people, and affordable prices will overrule the lack of service expertise. If you are on the fence, I say try it! The meal will not disappoint.", "date": "2019-01-20 20:58:59", "user": {"name": "J.", "review_count": 12, "yelping_since": "2015-05-15 18:38:38", "elite": "", "average_stars": 4.31, "fans": 0}}
{"review_id": "dxYUZd3qY0RYrqtIBxT_4w", "user_id": "4vwofK-bD2TGuuipLQFMDQ", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place has some real potential but unfortunately it did not live up to it. The focaccia could be amazing, but there was waaaay too much rosemary. After I took the rosemary off it tasted much better. The pizza was good, they put your toppings on top of the focaccia, which was interesting. The caccio e peppe was a complete let down. It was really low quality noodles with a horrible caccio e peppe type of sauce, tasted like it came from a Lipton packet. \nI was going to give it 2 stars but the staff was genuinely nice and helpful. The room itself was very well decorated as well. I would return here for the focaccia as a quick snack. What a shame after reading the reviews I seriously was looking fwd to this place.", "date": "2019-01-19 02:05:32", "user": {"name": "Brad", "review_count": 8, "yelping_since": "2009-08-19 03:27:25", "elite": "", "average_stars": 3.5, "fans": 0}}
{"review_id": "h7f8CZ9UrPaBL7h15T3pug", "user_id": "SXHNkZfxbRnKIWKroqB5Hw", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I decided to give this place a shot tonight and ordered a pizza with mushrooms. It was tasty but had hardly any cheese on it ! Some slices has maybe a half a bite of pizza with cheese on it and in my book cheese is a very important part of a pizza! The lack of cheese meant the pizza wasn't really very filling, which was a pretty big disappointment. I would have given two stars but it was very tasty, even if it was more like bread with marinara sauce on it. I might not give it a forger shot but If I do I definitely will order extra cheese !", "date": "2019-01-14 02:24:24", "user": {"name": "Tim", "review_count": 102, "yelping_since": "2014-07-26 04:32:33", "elite": "", "average_stars": 3.51, "fans": 1}}
{"review_id": "WdSVMUMDgm5gUe2gmJft8g", "user_id": "fQiOrVjFNsVGjxxCTCt_Ew", "business_id": "x1CpCXik31TwTtMPMcrcug", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent restaurant!! The Bianca Aglio (White pizza) is the best I've ever had! Fresh made focaccia bread and also the home made tomato soup was to die for!!! Can't forget dessert! Home made pizzelles with a delicious cup of coffee to finish it off and the owner could not be nicer! Absolutely will be back this place is wonderful and very decently priced!!!", "date": "2019-01-09 11:45:47", "user": {"name": "Daniel", "review_count": 21, "yelping_since": "2015-01-26 00:45:49", "elite": "", "average_stars": 4.81, "fans": 0}}
